<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[new-pow's space]]></title><description><![CDATA[Thought, stories and ideas for development.]]></description><link>http://localhost:2369/</link><image><url>http://localhost:2369/favicon.png</url><title>new-pow&apos;s space</title><link>http://localhost:2369/</link></image><generator>Ghost 5.59</generator><lastBuildDate>Sat, 26 Aug 2023 14:48:12 GMT</lastBuildDate><atom:link href="http://localhost:2369/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[2022년 회고 (1) 커뮤니티 기획자가 개발자를 꿈꾸게된 이야기]]></title><description><![CDATA[<h2 id="%EA%B0%9C%EC%9A%94"><strong>&#xAC1C;&#xC694;</strong></h2><p>&#xC5C4;&#xCCAD; &#xB2A6;&#xC5C8;&#xC9C0;&#xB9CC; 2022&#xB144; &#xD68C;&#xACE0;.<br>1&#xD3B8;&#xC740; &#xC0AC;&#xD68C;&#xACFC;&#xD559;&#xACC4;&#xC5F4; &#xC804;&#xACF5; &#xAE30;&#xD68D;&#xC790;&#xAC00; &#xAC1C;&#xBC1C;&#xC790;&#xB85C; &#xC774;&#xC9C1;&#xC744; &#xACB0;&#xC2EC;&#xD55C; &#xC774;&#xC57C;&#xAE30;.</p><p><em>&#xC8FC;&#xC758;, &#xCCA0;&#xC800;&#xD788; &#xB098;&#xC758; &#xC598;&#xAE30; &#xAE30;</em></p>]]></description><link>http://localhost:2369/hangeul-teseuteu-poseuteuibnida/</link><guid isPermaLink="false">64e12a8b749ee079fb78d1f2</guid><category><![CDATA[Log]]></category><category><![CDATA[Posts]]></category><category><![CDATA[2022]]></category><dc:creator><![CDATA[saehim lee]]></dc:creator><pubDate>Sat, 07 Jan 2023 20:48:00 GMT</pubDate><content:encoded><![CDATA[<h2 id="%EA%B0%9C%EC%9A%94"><strong>&#xAC1C;&#xC694;</strong></h2><p>&#xC5C4;&#xCCAD; &#xB2A6;&#xC5C8;&#xC9C0;&#xB9CC; 2022&#xB144; &#xD68C;&#xACE0;.<br>1&#xD3B8;&#xC740; &#xC0AC;&#xD68C;&#xACFC;&#xD559;&#xACC4;&#xC5F4; &#xC804;&#xACF5; &#xAE30;&#xD68D;&#xC790;&#xAC00; &#xAC1C;&#xBC1C;&#xC790;&#xB85C; &#xC774;&#xC9C1;&#xC744; &#xACB0;&#xC2EC;&#xD55C; &#xC774;&#xC57C;&#xAE30;.</p><p><em>&#xC8FC;&#xC758;, &#xCCA0;&#xC800;&#xD788; &#xB098;&#xC758; &#xC598;&#xAE30; &#xAE30;&#xB85D;&#xD558;&#xB294; &#xAC70;&#xB77C; &#xB531;&#xD788; &#xB3C4;&#xC6C0;&#xC740; &#xC548;&#xB420; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.. &#xAD73;&#xC774; &#xB530;&#xC9C0;&#xC790;&#xBA74; &#xC815;&#xBCF4; 10, &#xC0AC;&#xB2F4; 90&#xC758; &#xAE00;&#xC774; &#xB420; &#xC608;&#xC815;&#xC785;&#xB2C8;&#xB2E4;.</em></p><p><br></p><figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.kakaocdn.net/dn/c0BRK8/btrXImSBARN/CRkcHsKgnADHHVv31ekHZk/img.png" class="kg-image" alt loading="lazy"><figcaption>&#xAC04;&#xB2E4;, &#xC774; &#xC545;&#xBB3C;&#xACE0; &#x1F62C;</figcaption></figure><p><br></p><h2 id="%EA%B8%B0%ED%9A%8D%EC%9E%90%EC%9D%98-%EA%B8%B0%EC%81%A8%EA%B3%BC-%EC%8A%AC%ED%94%94"><strong>&#xAE30;&#xD68D;&#xC790;&#xC758; &#xAE30;&#xC068;&#xACFC; &#xC2AC;&#xD514;</strong></h2><blockquote>2022&#xB144; &#xC774;&#xC804; : &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xAE30;&#xD68D;&#xC790;&#xB85C;&#xC11C;&#xC758; &#xC77C;!<br>2022&#xB144; 1~2&#xC6D4; : &#xD1F4;&#xC0AC; &#xC5EC;&#xD589;, &#xC0AC;&#xB78C;&#xB9CC;&#xB098;&#xAE30;</blockquote><p>&#xC9C1;&#xC5C5;&#xC744; &#xBB3B;&#xB294; &#xC9C8;&#xBB38;&#xC744; &#xCC38; &#xC790;&#xC8FC; &#xB4E3;&#xB294;&#xB2E4;. &#xB098;&#xB294; &#xC5B8;&#xC81C;&#xB098; &#xB0B4; &#xC9C1;&#xC5C5;&#xC744; &#xC124;&#xBA85;&#xD558;&#xAE30;&#xC5D0; &#xC5B4;&#xB824;&#xC6C0;&#xC774; &#xB4E4;&#xC5C8;&#xB2E4;.</p><p>&#xBCF4;&#xD1B5; &#xB300;&#xB2E4;&#xC218;&#xC758; &#xC0AC;&#xB78C;&#xB4E4;&#xC5D0;&#xAC8C;&#xB294; &apos;&#xBB38;&#xD654;&#xC608;&#xC220; &#xD504;&#xB85C;&#xADF8;&#xB7A8;/&#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xAE30;&#xD68D;&#xC790;&apos;&#xB77C;&#xB294; &#xB2F5;&#xBCC0;&#xC744; &#xD588;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC815;&#xD655;&#xD558;&#xAC8C; &#xB0B4; &#xC2A4;&#xC2A4;&#xB85C; &#xADF8;&#xB3D9;&#xC548;&#xC758; &#xC9C1;&#xC5C5;&#xC744; &#xADDC;&#xC815;&#xD558;&#xC790;&#xBA74; &#xC9C0;&#xC5ED; &#xD65C;&#xB3D9;&#xAC00;&#xC774;&#xC790;, &#xCCAD;&#xB144; &#xD65C;&#xB3D9;&#xAC00;&#xC600;&#xB2E4;. &#xCCAD;&#xC18C;&#xB144;&#xAE30;&#xBD80;&#xD130; &#xC0AC;&#xD68C; &#xBB38;&#xC81C;&#xC5D0; &#xAD00;&#xC2EC;&#xC774; &#xB9CE;&#xC558;&#xACE0;, &#xD2B9;&#xD788; &#xB2E4;&#xC591;&#xC131;&#xACFC; &#xB3C4;&#xC2DC;(&#xC11C;&#xC6B8;) &#xBB38;&#xC81C;&#xC5D0; &#xC9C0;&#xADF9;&#xD788; &#xAD00;&#xC2EC;&#xC774; &#xB9CE;&#xC558;&#xB2E4;. &#xADF8;&#xB7EC;&#xB2E4;&#xBCF4;&#xB2C8; &#xC0AC;&#xD68C;&#xD559;&#xC744; &#xC804;&#xACF5;&#xD558;&#xACE0; &#xC774; &#xC9C1;&#xC5C5;&#xC744; &#xAC16;&#xAE30;&#xAE4C;&#xC9C0; &#xAD49;&#xC7A5;&#xD788; &#xC790;&#xC5F0;&#xC2A4;&#xB7EC;&#xC6B4; &#xC218;&#xC21C;&#xC774;&#xC5C8;&#xB2E4;.</p><p><br></p><p>&#xADF8;&#xB3D9;&#xC548;&#xC758; &#xB0B4; &#xC77C;&#xC758; &#xC804;&#xBC18;&#xC740; &#xC0AC;&#xD68C; &#xC774;&#xC288;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xB418;&#xB294; &#xAC83;&#xB4E4;&#xC744; &#xD3EC;&#xCC29;&#xD558;&#xACE0; &#xC6D0;&#xC778;&#xACFC; &#xD574;&#xACB0;&#xC5D0; &#xB300;&#xD55C; &#xAC00;&#xC124;&#xC744; &#xC138;&#xC6B0;&#xB294; &#xAC83;&#xC73C;&#xB85C;&#xBD80;&#xD130; &#xAE30;&#xD68D;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xAE30;&#xB3C4; &#xD558;&#xACE0;, &#xC0AC;&#xC5C5; &#xCCAD;&#xC0AC;&#xC9C4;&#xC744; &#xADF8;&#xB9AC;&#xB294; &#xAC83;&#xBD80;&#xD130; &#xC2DC;&#xC791;&#xD588;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xAE30;&#xD68D;&#xB41C; &#xC0AC;&#xC5C5;&#xC5D0;&#xC11C; &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC5C5; &#xACC4;&#xD68D;&#xC744; &#xC9DC;&#xACE0; &#xC6B4;&#xC601;&#xD558;&#xACE0; &#xBCF4;&#xACE0;&#xC11C;&#xB97C; &#xC791;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xC74C;.. &#xC774;&#xB807;&#xAC8C; &#xB9D0;&#xD558;&#xBA74; &#xB108;&#xBB34; &#xCD94;&#xC0C1;&#xC801;&#xC778;&#xAC00;? &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB860; &#xC758;&#xC790; &#xC55E;&#xC5D0;&#xC11C; &#xC549;&#xC544;&#xC11C; &#xD558;&#xB294; &#xAE30;&#xD68D;&#xC11C; &#xC791;&#xC131;&#xBD80;&#xD130; &#xD64D;&#xBCF4;&#xB9C8;&#xCF00;&#xD305;, &#xC0AC;&#xC5C5; &#xAD00;&#xACC4;&#xC790; &#xC12D;&#xC678; &#xBC0F; &#xD611;&#xC5C5;, &#xACF5;&#xAC04; &#xAE30;&#xD68D;, &#xD589;&#xC815;&#xD68C;&#xACC4;, &#xD589;&#xC0AC;&#xD560; &#xB54C; &#xB9C8;&#xC774;&#xD06C;&#xB97C; &#xC7A1;&#xB294; &#xAC83;&#xB3C4; &#xC885;&#xC885; &#xB098;&#xC758; &#xC5C5;&#xBB34; &#xC601;&#xC5ED;&#xC774;&#xC5C8;&#xB2E4;. &#xC774;&#xB7F0; &#xC804;&#xBC18;&#xC801;&#xC778; &#xACFC;&#xC815;&#xC744; &#xBAA8;&#xB450; &#xACAA;&#xB294; &#xAC83;(&#xD639;&#xC740; &#xC77C;&#xC758; A-Z&#xAE4C;&#xC9C0; &#xD30C;&#xC545;&#xD558;&#xACE0; &#xC788;&#xB294; &#xAC83;)&#xC774; &#xB0B4; &#xC131;&#xACA9;&#xC5D0;&#xB294; &#xC798; &#xB9DE;&#xC558;&#xB358; &#xAC83; &#xAC19;&#xB2E4;.</p><p><br></p><p>&#xC774; &#xC77C;&#xC744; &#xD558;&#xBA70; &#xC815;&#xB9D0; &#xD798;&#xB4E0; &#xC810;&#xB3C4; &#xB9CE;&#xC558;&#xC9C0;&#xB9CC; &#xB9C9;&#xC5F0;&#xD558;&#xAC8C; &#xD544;&#xC694;&#xD558;&#xB2E4; &#xC0DD;&#xAC01;&#xD588;&#xB358; &#xAC83;&#xC744; &#xD604;&#xC2E4;&#xB85C; &#xB9CC;&#xB4DC;&#xB294; &#xC791;&#xC5C5;&#xC774; &#xB108;&#xBB34;&#xB098; &#xC990;&#xAC70;&#xC6E0;&#xB2E4;.</p><p>&#xC785;&#xC0AC;&#xD588;&#xB358; &#xACF3;&#xB4E4;&#xC774; &#xC601;&#xC138;&#xD55C; &#xACF3;&#xC774;&#xC5B4;&#xC11C; &#xC790;&#xC720;&#xB3C4;&#xAC00; &#xB192;&#xC558;&#xB2E4;. &#xAE30;&#xD68D;&#xC790;&#xC758; &#xC5C5;&#xBB34; &#xC601;&#xC5ED;&#xC774; &#xB113;&#xC740; &#xAC83;&#xB3C4; &#xC77C;&#xC758; &#xD2C8;&#xD2C8;&#xC774; &#xB0B4; &#xAD00;&#xC2EC;&#xC0AC;&#xB97C; &#xB179;&#xC774;&#xAE30;&#xC5D0; &#xCD5C;&#xC801;&#xC758; &#xD658;&#xACBD;&#xC774;&#xC5C8;&#xB2E4;. &#xC0C8;&#xB85C;&#xC6B4; &#xD234;, &#xAC1C;&#xB150;&#xC774;&#xB098; &#xC7A5;&#xBE44;&#xB97C; &#xBC30;&#xC6B0;&#xB294; &#xAC83;&#xC744; &#xC88B;&#xC544;&#xD588;&#xB2E4;. &#xC77C;&#xC744; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xB9CC;&#xB4DC;&#xB294; &#xAC83;&#xB3C4;. &#xC77C;&#xC774; &#xAD11;&#xBC94;&#xC704;&#xD55C; &#xAC83;&#xB3C4; &#xBCC4;&#xB85C; &#xBB38;&#xC81C; &#xB418;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;. &#xC624;&#xD788;&#xB824; &#xB9E4;&#xBC88; &#xC0C8;&#xB85C; &#xC2B5;&#xB4DD;&#xD55C; &#xAC83;&#xB4E4;&#xC744; &#xC77C;&#xC5D0; &#xBC14;&#xB85C; &#xC801;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xB3C4; &#xAE30;&#xAEBC;&#xC6E0;&#xB2E4;.</p><p>&#xADF8;&#xB9AC;&#xACE0; &#xD588;&#xB358; &#xC77C;&#xB4E4;&#xC758; &#xACFC;&#xC815;&#xC744; &#xAF3C;&#xAF3C;&#xD788; &#xAE30;&#xB85D;&#xD558;&#xACE0;, &#xD6C4;&#xAE30;&#xB97C; &#xB0A8;&#xACA8; &#xC0AC;&#xB78C;&#xB4E4;&#xC5D0;&#xAC8C; &#xC77D;&#xD788;&#xB294; &#xAC83;&#xB3C4; &#xC815;&#xC2DD; &#xC5C5;&#xBB34;&#xB294; &#xC544;&#xB2C8;&#xC5C8;&#xC9C0;&#xB9CC; &#xC790;&#xCC98;&#xD574;&#xC11C; &#xC5C5;&#xBB34;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xD558;&#xACE4; &#xD588;&#xB2E4;. &#xC9C0;&#xAE08; &#xC0DD;&#xAC01;&#xD574; &#xBCF4;&#xBA74; &#xC774;&#xB7F0; &#xAC83;&#xC73C;&#xB85C; &#xB204;&#xC801;&#xB41C; &#xC2A4;&#xD2B8;&#xB808;&#xC2A4;&#xB97C; &#xD480;&#xC5C8;&#xB358; &#xAC83; &#xAC19;&#xAE30;&#xB3C4; &#xD558;&#xB2E4;.</p><p><br></p><p>&#xAE30;&#xD68D;&#xC790;&#xB85C; &#xC77C;&#xD558;&#xB294; &#xAC83;&#xC740; &#xAC89;&#xC73C;&#xB85C; &#xBCF4;&#xC774;&#xB294; &#xC990;&#xAC70;&#xC6C0;&#xBCF4;&#xB2E4; &#xD798;&#xB4E0; &#xC77C;&#xC774;&#xB2E4;.</p><p>&#xB9E4;&#xBC88; &#xC0C8;&#xB85C;&#xC6B4; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB97C; &#xC0DD;&#xC0B0;&#xD574; &#xB0B4;&#xC57C;&#xD558;&#xACE0;, &#xB9E4;&#xB825;&#xC801;&#xC774;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;. &#xB0B4;&#xAC00; &#xC124;&#xB4DD;&#xB418;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xAE30;&#xD68D;&#xC740; &#xC77C;&#xC744; &#xD560; &#xB54C;&#xB9C8;&#xB2E4; &#xC5EC;&#xAC04; &#xAD34;&#xB85C;&#xC6B4; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xB2E4;.</p><p>&#xACF5;&#xBD80;&#xC640; &#xD2B8;&#xB80C;&#xB4DC;&#xB97C; &#xB530;&#xB77C;&#xAC00;&#xB294; &#xAC83;&#xC744; &#xB3D9;&#xC2DC;&#xC5D0; &#xD574;&#xC57C; &#xD55C;&#xB2E4;. &#xAE30;&#xD68D;&#xB3C4; &#xC544;&#xC6C3;&#xD48B;&#xC774;&#xC5B4;&#xC11C; &#xC778;&#xD48B;&#xC774; &#xC5C6;&#xC73C;&#xBA74; &#xC81C;&#xB300;&#xB85C; &#xB098;&#xC624;&#xC9C0; &#xBABB;&#xD55C;&#xB2E4;. &#xADFC;&#xB370; &#xC544;&#xC6C3;&#xD48B;&#xC744; &#xB0B4;&#xB290;&#xB77C; &#xAD11;&#xBC94;&#xC704;&#xD55C; &#xC5C5;&#xBB34;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB2E4; &#xBCF4;&#xBA74; &#xC778;&#xD48B;&#xC744; &#xB123;&#xC5B4;&#xC904; &#xC2DC;&#xAC04;&#xC774; &#xC5C6;&#xB294; &#xC544;&#xC774;&#xB7EC;&#xB2C8;&#xD568;&#x1F62C;... &#xC815;&#xB9D0; &#xC57C;&#xADFC;&#xC740; &#xBC25;&#xBA39;&#xB4EF;&#xC774; &#xAFB8;&#xC900;&#xD788; &#xD588;&#xB2E4;. &#xADF8;&#xB807;&#xAC8C; &#xC77C;&#xD558;&#xB2E4; &#xBCF4;&#xBA74; &#xB0B4;&#xAC00; &#xC544;&#xC8FC; &#xC88B;&#xC544;&#xD558;&#xB358; &#xC77C;&#xC778;&#xB370;&#xB3C4; &#xC885;&#xC885; &#xC77C;&#xC5D0; &#xD30C;&#xBB3B;&#xD600; &#xC790;&#xAE30; &#xD655;&#xC2E0;&#xC774; &#xC548; &#xB4DC;&#xB294; &#xB54C;&#xB294; &#xB0B4; &#xAE30;&#xD68D;&#xC744; &#xB0B4;&#xAC00; &#xBB34;&#xC11C;&#xC6CC;&#xD560; &#xB54C;&#xB3C4; &#xC788;&#xC5C8;&#xB2E4;. &#xB2F5;&#xC774; &#xB098;&#xC624;&#xC9C0; &#xC54A;&#xB294; &#xAC83;&#xC744; &#xC54C;&#xBA74;&#xC11C;&#xB3C4; &#xC774;&#xAC83;&#xC774; &#xC720;&#xC758;&#xBBF8;&#xD55C;&#xAC00; &#xC758;&#xC2EC;&#xD574; &#xBCF4;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p><p>&#xB3CC;&#xC774;&#xCF1C;&#xBCF4;&#xBA74; &#xC9C1;&#xBB34; &#xC804;&#xD658;&#xC744; &#xACB0;&#xC2EC;&#xD55C; &#xAC83; &#xC911; &#xAC00;&#xC7A5; &#xD070; &#xC774;&#xC720;&#xAC00; &#xC774;&#xAC83;&#xC774;&#xC9C0; &#xC54A;&#xC744;&#xAE4C;...?</p><p><br></p><figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.kakaocdn.net/dn/bwutVh/btrXHCPpSmb/dYy9DV5hYacg9V7k0UmRJK/img.png" class="kg-image" alt loading="lazy" width="594" height="394"><figcaption>&#xD1F4;&#xC9C1; &#xC9C1;&#xD6C4; &#xD558;&#xB3D9;, &#xAD6C;&#xB840;, &#xC81C;&#xC8FC;&#xB3C4;&#xB97C; &#xCE5C;&#xAD6C;(&#xC0AC;&#xC9C4; &#xC18D; &#xC778;&#xBB3C;)&#xC640; &#xC5EC;&#xD589;&#xD588;&#xB2E4;. &#xC774;&#xB54C;&#xB294; &#xBAB0;&#xB790;&#xB2E4;. &#xC0C8;&#xB85C;&#xC6B4; &#xC9C1;&#xC5C5;&#xC744; &#xAFC8;&#xAFB8;&#xAC8C; &#xB420; &#xC904;&#xC740;.</figcaption></figure><p><br></p><p>&#xC9C1;&#xC804; &#xC870;&#xC9C1;&#xC5D0;&#xC11C; &#xC77C;&#xC740; 3&#xB144;&#xC815;&#xB3C4; &#xD588;&#xB2E4;. 21&#xB144; 12&#xC6D4;&#xC744; &#xB05D;&#xC73C;&#xB85C; &#xD1F4;&#xC9C1;&#xC744; &#xD558;&#xACE0; &#xB098;&#xC11C;&#xB3C4; &#xB098;&#xB294; &#xC774; &#xC9C1;&#xC5C5;&#xC744; &#xAF64; &#xC0AC;&#xB791;&#xD574;&#xC11C; &#xD55C; &#xBC18;&#xB144; &#xC7AC;&#xCDA9;&#xC804; &#xD6C4; &#xB2E4;&#xC2DC; &#xD65C;&#xB3D9;&#xAC00;&#xB85C;&#xC11C; &#xCDE8;&#xC5C5;&#xC744; &#xD558;&#xB9AC;&#xB77C; &#xC758;&#xC2EC;&#xCE58; &#xC54A;&#xC558;&#xB2E4;.</p><p><br></p><hr><h2 id="%EA%B7%BC%EB%8D%B0-%EB%B6%84%EC%9C%84%EA%B8%B0-%EA%B0%91%EC%9E%90%EA%B8%B0-%EA%B0%9C%EB%B0%9C%EC%9E%90-%F0%9F%91%A9%F0%9F%8F%BB%E2%80%8D%F0%9F%92%BB"><strong>&#xADFC;&#xB370; &#xBD84;&#xC704;&#xAE30; &#xAC11;&#xC790;&#xAE30; &#xAC1C;&#xBC1C;&#xC790; <strong>&#x1F469;&#x1F3FB;&#x200D;&#x1F4BB;</strong></strong></h2><blockquote>2022&#xB144; 3~4&#xC6D4; : &#xC9C0;&#xC778; &#xCE74;&#xD398; &#xC54C;&#xBC14;, &#xCDE8;&#xC5C5; &#xC900;&#xBE44; &#x1F449; &#xAC1C;&#xBC1C;&#xC790;&#xB85C; &#xC9C1;&#xBB34; &#xC804;&#xD658; &#xACE0;&#xBBFC;</blockquote><p>&#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; &#xCDE8;&#xC5C5; &#xC2DC;&#xC7A5;&#xC5D0; &#xB6F0;&#xC5B4;&#xB4E4;&#xACE0; &#xC870;&#xAE08; &#xC9C0;&#xB0AC;&#xC744; &#xB54C;&#xC600;&#xB2E4;. &#xC5B4;&#xCA4C;&#xB2E4; &#xB35C;&#xCEE5; &#xCF54;&#xB85C;&#xB098;19&#xC5D0; &#xAC78;&#xB838;&#xB2E4;. &#xB204;&#xAD6C; &#xB9D0;&#xB9CC; &#xB530;&#xB77C; &#xD55C; 3&#xC77C;&#xC740; &#xC9C0;&#xB3C5;&#xD558;&#xAC8C; &#xC544;&#xD30C;&#xC11C; &#xCE68;&#xB300;&#xB97C; &#xBABB; &#xBC97;&#xC5B4;&#xB098;&#xACE0; &#xB059;&#xB059; &#xC553;&#xC558;&#xB2E4;.</p><p><br></p><p>&#xADFC;&#xB370; 4&#xC77C;&#xC9F8;&#xBD80;&#xD130; &#xCE68;&#xB300; &#xC704; &#xC0DD;&#xD65C;&#xB9CC; &#xD558;&#xAC8C;&#xB418;&#xC790; &#xC2AC;&#xC2AC; &#xC9C0;&#xB8E8;&#xD574;&#xC9C0;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xB2E4;. &#xACA9;&#xB9AC;&#xB294; 4&#xC77C;&#xC774;&#xB098; &#xB354; &#xD574;&#xC57C; &#xD588;&#xB2E4;. &#xB204;&#xC6CC;&#xC11C; &#xC601;&#xD654;&#xB97C; &#xCF1C;&#xB450;&#xB294; &#xAC83;&#xB3C4;, &#xCC45;&#xC744; &#xBCF4;&#xB294; &#xAC83;&#xB3C4; &#xB354; &#xC9C0;&#xB8E8;&#xD574;&#xC9C8; &#xB54C;&#xCBE4; &#xD3C9;&#xC18C; &#xAF2D; &#xBC30;&#xC6B0;&#xACE0; &#xC2F6;&#xC5C8;&#xB358; &#xCF54;&#xB529;&#xC744; &#xBC30;&#xC6B0;&#xC790; &#xC2F6;&#xC5C8;&#xB2E4;. &#xC0AC;&#xC2E4; &#xAC1C;&#xBC1C;&#xC740; &#xC131;&#xC778; &#xC774;&#xD6C4;&#xC5D0; &#xACC4;&#xC18D; &#xBC30;&#xC6B0;&#xACE0; &#xC2F6;&#xB2E4;&#xACE0; &#xB9C8;&#xC74C; &#xD55C;&#xD3B8;&#xC5D0; &#xB2F4;&#xC544;&#xB450;&#xC5C8;&#xB358; &#xAE30;&#xC220;&#xC774;&#xC5C8;&#xB2E4;. &#xC61B;&#xB0A0; &#xC61B;&#xC801; &#xB098;&#xBAA8;&#xC6F9;&#xC5D0;&#xB514;&#xD130;&#xB85C; &#xC6F9;&#xD398;&#xC774;&#xC9C0;&#xB97C; &#xB9CC;&#xB4E4;&#xB358; &#xCD94;&#xC5B5;&#xC774; &#xD06C;&#xAC8C; &#xC791;&#xC6A9;&#xD588;&#xB2E4;. (&#xD639;&#xC2DC; &#xB2E4;&#xB4E4;.. &#xB098;&#xBAA8;&#xC6F9;&#xC5D0;&#xB514;&#xD130; &#xC544;&#xC2DC;&#xB294;&#xC9C0;...?)</p><p>&#xADF8;&#xB9AC;&#xACE0; &#xC704;&#xC5D0;&#xB3C4; &#xC5B8;&#xAE09;&#xD588;&#xB4EF;&#xC774; &#xB098;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xAC83;&#xC744; &#xC2B5;&#xB4DD;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC990;&#xAC70;&#xC6CC;&#xD558;&#xACE0; &#xD638;&#xAE30;&#xC2EC;&#xB3C4; &#xB9CE;&#xC740; &#xD3B8;&#xC774;&#xB77C; &#xBC30;&#xC6B0;&#xAE38; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;. &#xB208;&#xCE58;&#xCC44;&#xC168;&#xB4EF;&#xC774; &#xC6CC;&#xB099; &#xC2DC;&#xC791;&#xC774; &#xAC00;&#xBCBC;&#xC6B4; &#xC0AC;&#xB78C;&#xC774;&#xB2E4;.</p><p><br></p><p>&#xAD6C;&#xAE00;&#xB9C1;&#xC73C;&#xB85C; &#xBA87; &#xBC88; &#xAC80;&#xC0C9;&#xD574;&#xBCF4;&#xB2C8;&#xAE4C; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xCDE8;&#xBBF8; &#xCF54;&#xB529; &#xAC15;&#xC758;&#xB85C; <a href="https://opentutorials.org/course/1?ref=localhost">&#xC0DD;&#xD65C;&#xCF54;&#xB529;</a>&#xC744; &#xCD94;&#xCC9C;&#xD558;&#xAE38;&#xB798; <code>HTML</code>&#xBD80;&#xD130; &#xCC9C;&#xCC9C;&#xD788; &#xC2E4;&#xC2B5;&#xD558;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xB2E4;. &#xA0;&#xADF8;&#xB7EC;&#xB2E4; &#xAC1C;&#xBC1C;&#xC5D0; &#xB9E4;&#xB825;&#xC5D0; &#xD479; &#xBE60;&#xC838;&#xBC84;&#xB838;&#xB2E4;. &#xC9C0;&#xAE08;&#xB3C4; &#xCC98;&#xC74C; &#xCF54;&#xB529;&#xC744; &#xD574;&#xBCF4;&#xACA0;&#xB2E4;&#xACE0; &#xD558;&#xB294; &#xCE5C;&#xAD6C;&#xAC00; &#xC788;&#xC73C;&#xBA74; &#xC0DD;&#xD65C;&#xCF54;&#xB529; egoing&#xC744; &#xCD94;&#xCC9C;&#xD55C;&#xB2E4;. &#xD55C; &#xB2E8;&#xACC4; &#xB118;&#xC744; &#xB54C;&#xB9C8;&#xB2E4; &#xCE6D;&#xCC2C;&#xBC1B;&#xB294; &#xC7AC;&#xBBF8;&#xC5D0; &#xC5B4;&#xB290;&#xC0C8; &#xB9C8;&#xC9C0;&#xB9C9;&#xAE4C;&#xC9C0; &#xC644;&#xAC15;&#xC744; &#xD558;&#xACE0;&#xC57C; &#xB9C8;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p><p><br></p><p>&#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xAE30;&#xD68D; &#xC5C5;&#xBB34;&#xB294; &#xAE30;&#xD68D; &#xD6C4; &#xC900;&#xBE44;, &#xC2E4;&#xD589; &#xACFC;&#xC815;&#xC774; &#xC788;&#xC5B4;&#xC11C; &#xB204;&#xAD70;&#xAC00;&#xC758; &#xB9AC;&#xC561;&#xC158;&#xC774; &#xC788;&#xAE30;&#xAE4C;&#xC9C0; &#xC2DC;&#xAC04;&#xC774; &#xAF64; &#xAC78;&#xB9AC;&#xB294; &#xBC18;&#xBA74;, &#xAC1C;&#xBC1C;&#xC758; &#xACB0;&#xACFC;&#xB294; &#xBC14;&#xB85C; &#xD655;&#xC778;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC774; &#xB108;&#xBB34; &#xB9E4;&#xB825;&#xC801;&#xC774;&#xC5C8;&#xB2E4;. &#xC0AC;&#xB78C;&#xACFC; &#xADF8; &#xB0A0;&#xC758; &#xAE30;&#xC6B4;(?)&#xC5D0; &#xB9E4;&#xBC88; &#xB2EC;&#xB77C;&#xC9C0;&#xB294; &#xBAA8;&#xC784; &#xBD84;&#xC704;&#xAE30;&#xB3C4; &#xB9E4;&#xB825;&#xC788;&#xC5C8;&#xC9C0;&#xB9CC;.. &#xC774;&#xAC8C; &#xBC14;&#xB85C; &#xAE30;&#xC220;&#xC758; &#xBB18;&#xBBF8;&#xC778;&#xAC00;? &#xC791;&#xAC8C; &#xAE30;&#xB2A5;&#xC744; &#xB098;&#xB204;&#xACE0; &#xD55C; &#xC904; &#xD55C; &#xC904; &#xC77C;&#xC744; &#xC2DC;&#xD0A4;&#xACE0;, &#xC774;&#xB97C; &#xC124;&#xACC4;&#xD558;&#xACE0; &#xB3CC;&#xC544;&#xAC00;&#xAC8C; &#xD558;&#xB294; &#xC990;&#xAC70;&#xC6C0;&#xC774; &#xC788;&#xC5C8;&#xB2E4;.</p><p>&#xACF5;&#xBD80;&#xAC00; &#xC870;&#xAE08;&#xC529; &#xB298;&#xC5B4;&#xB098;&#xBA70; &#xD560; &#xC218; &#xC788;&#xB294; &#xAC83;&#xB4E4;&#xC758; &#xBC94;&#xC704;&#xAC00; &#xD655; &#xB298;&#xC5B4;&#xB098;&#xB294; &#xAC83;&#xB3C4; &#xC7AC;&#xBBF8;&#xC788;&#xC5C8;&#xB2E4;. &#xB3D9;&#xC2DC;&#xC5D0; &#xC0C1;&#xC0C1;&#xC758; &#xBC94;&#xC704;&#xB3C4; &#xB298;&#xC5B4;&#xB098;&#xACE0;. &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xD588;&#xB358; &#xC77C;&#xC911;&#xC5D0; &#xAC00;&#xC7A5; &#xC2DC;&#xAC04;&#xC774; &#xBE68;&#xB9AC; &#xD758;&#xB7EC;&#xAC00;&#xB294; &#xC77C;&#xC774;&#xC5C8;&#xC5B4;&#xC11C; &#xB354; &#xC2E0;&#xAE30;&#xD588;&#xB2E4;.</p><p>&#xB610; &#xC0C8;&#xB85C;&#xC6B4; &#xAC83;&#xC744; &#xBC30;&#xC6B0;&#xACE0;, &#xD55C; &#xAC83;&#xC744; &#xAE30;&#xB85D;&#xD558;&#xACE0; &#xC544;&#xB294; &#xAC83;&#xC744; &#xB098;&#xB204;&#xB294; &#xC77C;&#xB828;&#xC758; &#xACFC;&#xC815;&#xB4E4;&#xC774; &#xC990;&#xAC70;&#xC6E0;&#xB2E4;. &#xC774;&#xB7F0; &#xC9C4;&#xB4DD;&#xD55C; &#xBC30;&#xC6C0;&#xC758; &#xACFC;&#xC815;&#xC744; &#xB098;&#xB294; &#xAE4A;&#xAC8C; &#xBC14;&#xB77C;&#xACE0; &#xC788;&#xC5C8;&#xB358; &#xAC83;&#xAC19;&#xB2E4;.</p><p><br></p><p>&#xD55C; 2~3&#xC8FC; &#xD2C8;&#xD2C8;&#xD788; &#xC0DD;&#xD65C;&#xCF54;&#xB529; &#xCEE4;&#xB9AC;&#xD058;&#xB7FC;&#xC744; &#xB530;&#xB77C;&#xAC00;&#xB2E4;&#xAC00; &#xBF08;&#xBB38;&#xACFC;&#xC778; &#xB0B4; &#xC8FC;&#xBCC0; &#xC720;&#xC77C;&#xD55C; &#xAC1C;&#xBC1C;&#xC790;&#xC778; &#xCE5C;&#xAD6C;&#xB97C; &#xB9CC;&#xB0AC;&#xC744; &#xB54C; &#xC870;&#xC2EC;&#xC2A4;&#xB7FD;&#xAC8C; &#xC0C1;&#xB2F4;&#xC744; &#xD588;&#xB2E4;.</p><p>&#xC544;&#xBB34;&#xB798;&#xB3C4; &#xB098;&#xC774;&#xAC00; &#xC774;&#xBBF8; 30&#xB300;&#xC778;&#xC9C0;&#xB77C; &#xC9C1;&#xBB34;&#xB97C; &#xBC14;&#xAFB8;&#xB294; &#xB3C4;&#xC804;&#xC774; &#xC870;&#xAE08; &#xBD80;&#xB2F4;&#xC2A4;&#xB7EC;&#xC6E0;&#xB2E4;. &#xADF8;&#xCABD; &#xC5C5;&#xACC4;&#xC758; &#xC0DD;&#xB9AC;&#xB97C; &#xC54C; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC5C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xAC1C;&#xBC1C;&#xC744; &#xBC30;&#xC6B4;&#xB2E4;&#xBA74; &#xC751;&#xB2F9; &#xC598;&#xAE30;&#xB97C; &#xB4E3;&#xB294; &#xADF8;&#xB188;&#xC758; &quot;&#xC801;&#xC131;&quot;&#xB3C4; &#xAC71;&#xC815;&#xC774; &#xB418;&#xC5C8;&#xB2E4;.</p><p>&#xADF8;&#xB7F0;&#xB370; &#xADF8; &#xCE5C;&#xAD6C;&#xB3C4; &#xAD49;&#xC7A5;&#xD788; &#xD754;&#xCF8C;&#xD788; &#xAC1C;&#xBC1C;&#xC790;&#xB85C;&#xC758; &#xC9C1;&#xBB34; &#xBCC0;&#xACBD;&#xC744; &#xCD94;&#xCC9C;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2CC;&#xAC00;? &#xC624;&#xD788;&#xB824; &#xC798; &#xC5B4;&#xC6B8;&#xB9B4; &#xAC83; &#xAC19;&#xB2E4;&#xBA70; &#xACA9;&#xB824;&#xAE4C;&#xC9C0; &#xD574;&#xC8FC;&#xC5C8;&#xB2E4;&#x1F972; &#xD55C; 4&#xC2DC;&#xAC04;&#xC5EC; &#xAC00;&#xB7C9; &#xACE0;&#xBBFC;&#xD558;&#xB294; &#xBC14;&#xB97C; &#xC0C1;&#xC758;&#xD55C; &#xB4A4;, &#xB2F9;&#xC77C;&#xC5D0; &#xBC14;&#xB85C; &#xACB0;&#xC815;&#xC744; &#xB0B4;&#xB838;&#xB2E4;. &#xC5B4;&#xCC28;&#xD53C; 6&#xAC1C;&#xC6D4; &#xAD50;&#xC721; &#xB4E3;&#xB294;&#xB2E4;&#xBA74; &#xC6D0;&#xB798;&#xB3C4; &#xC26C;&#xBA74;&#xC11C; &#xC7AC;&#xCDA9;&#xC804;&#xD558;&#xB824;&#xACE0; &#xD588;&#xC73C;&#xB2C8; &#xB9D8;&#xCC98;&#xB7FC; &#xC798; &#xC548;&#xB418;&#xB354;&#xB77C;&#xB3C4; &#xADF8;&#xB0E5; &#xC26C;&#xB294; &#xC148;&#xCE58;&#xC790;&#xB294; &#xC548;&#xC77C;&#xD55C; &#xB9C8;&#xC74C;&#xB3C4; &#xC870;&#xAE08;&#xC740; &#xC788;&#xC5C8;&#xB2E4;. (&#x1F448; 1&#xB2EC; &#xB9CC;&#xC5D0; &#xBB34;&#xB108;&#xC9C8; &#xB9C8;&#xC74C;)</p><p><br></p><p>&#xADF8;&#xB9AC;&#xACE0; &#xADF8; &#xD6C4; 1&#xC8FC;&#xC77C; &#xC548;&#xC5D0; &#xAD6D;&#xBE44;&#xAD50;&#xC721;&#xC744; &#xC2E0;&#xCCAD;&#xD558;&#xAC8C; &#xB41C;&#xB2E4;.</p><p><br></p><figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.kakaocdn.net/dn/KFL3x/btrXInxb1NV/56q3RTwKcKv1dNvLR3rXYk/img.png" class="kg-image" alt loading="lazy"><figcaption>4&#xC6D4; 28&#xC77C;&#xC758; &#xC11C;&#xC6B8;&#xC232;. &#xC598;&#xAE30;&#xD558;&#xBA74;&#xC11C; &#xC11C;&#xC6B8;&#xC232;&#xC744; &#xBA87; &#xBC14;&#xD034;&#xB97C; &#xB3CC;&#xC558;&#xB294;&#xC9C0; &#xBAA8;&#xB974;&#xACA0;&#xB2E4; &#x1F635;</figcaption></figure><p><br></p><p>&#xB2E4;&#xB978; &#xC0AC;&#xB78C;&#xC774; &#xBCF8;&#xB2E4;&#xBA74; &#xAC11;&#xC790;&#xAE30; &#xC9C4;&#xB85C;&#xB97C; &#xD655; &#xD2C0;&#xC5C8;&#xB2E4;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xACA0;&#xC9C0;&#xB9CC; &#xC0AC;&#xC2E4; &#xB098;&#xB294; &#xB0B4;&#xAC00; &#xAC00;&#xC9C4; &#xC5ED;&#xB7C9;&#xC744; &#xD558;&#xB098; &#xB354; &#xD0A4;&#xC6B4;&#xB2E4;&#xB77C;&#xB294; &#xCE21;&#xBA74;&#xC774; &#xB354; &#xD06C;&#xB2E4;. &#xBB3C;&#xB860; &#xB3C8;&#xC744; &#xBC84;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xBC14;&#xB00C;&#xACA0;&#xC9C0;&#xB9CC;, &#xAE30;&#xC220;&#xC744; &#xD558;&#xB098; &#xB354; &#xAC00;&#xC9D0;&#xC73C;&#xB85C;&#xC368; &apos;&#xB0B4;&#xAC00; &#xD558;&#xACE0; &#xC2F6;&#xC740; &#xAC83;&#xC744; &#xB354; &#xC27D;&#xAC8C; &#xCC3E;&#xC544;&#xAC08; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xC5C8;&#xB2E4;&apos; &#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xC788;&#xB2E4;.</p><p>&#xB0B4;&#xAC00; 10&#xB144; &#xD6C4;&#xC5D0;&#xB3C4; 20&#xB144; &#xD6C4;&#xC5D0;&#xB3C4; &#xAC1C;&#xBC1C;&#xC790;&#xB85C; &#xC77C;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xADF8;&#xAC83;&#xB3C4; &#xD589;&#xC6B4;&#xC774;&#xB2E4;. &#xC0B4;&#xC544;&#xB0A8;&#xC744; &#xC218; &#xC788;&#xB294; &#xAC1C;&#xBC1C;&#xC790;&#xB77C;&#xB2C8;!</p><p>&#xD558;&#xC9C0;&#xB9CC; &#xB610; &#xC0C8;&#xB85C;&#xC6B4; &#xAE38;&#xC744; &#xCC3E;&#xC544; &#xAC00;&#xB354;&#xB77C;&#xB3C4; &#xADF8;&#xAC83; &#xB098;&#xB984;&#xB300;&#xB85C; &#xC88B;&#xC744; &#xAC83; &#xAC19;&#xB2E4;. &#xB0B4;&#xAC00; &#xC9C0;&#xAE08; &#xBC30;&#xC6B4; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xBAA9;&#xC801;&#xC744; &#xC704;&#xD55C; &#xC218;&#xB2E8;&#xC73C;&#xB85C; &#xC798; &#xC4F8; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xB354;&#xD560;&#xB098;&#xC704; &#xC5C6;&#xC744; &#xAC83;&#xC774;&#xB2E4;.</p><hr><p>&#xC0AC;&#xC2E4; &#xAD6D;&#xBE44;&#xAD50;&#xC721; &#xC218;&#xAC15;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xAC00; &#xAD81;&#xAE08;&#xD560; &#xC0AC;&#xB78C;&#xC774; &#xB9CE;&#xC744; &#xAC83; &#xAC19;&#xC544;&#xC11C;.. &#xBCC4;&#xB85C; &#xC548;&#xAD81;&#xAE08;&#xD560; &#xC598;&#xAE30;&#xB791; &#xBD84;&#xB9AC;&#xD574;&#xBD24;&#xB2E4;.</p><p>2&#xD3B8;&#xC740; &#xBF08;&#xBB38;&#xACFC;&#xAC00; &#xAD6D;&#xBE44; &#xAD50;&#xC721; &#xC218;&#xAC15;&#xD558;&#xBA74;&#xC11C; &#xD63C;&#xB780;&#xC758; &#xB3C4;&#xAC00;&#xB2C8;&#xC5D0; &#xBE60;&#xC9C4; &#xC774;&#xC57C;&#xAE30;&#xAC00; &#xC774;&#xC5B4;&#xC9C8; &#xC608;&#xC815;&#xC774;&#xB2E4;.</p>]]></content:encoded></item></channel></rss>