<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[null]]></title><description><![CDATA[null]]></description><link>http://localhost:2369/</link><image><url>http://localhost:2369/favicon.png</url><title>null</title><link>http://localhost:2369/</link></image><generator>Ghost 5.62</generator><lastBuildDate>Wed, 13 Sep 2023 08:10:48 GMT</lastBuildDate><atom:link href="http://localhost:2369/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[Spring Event를 사용하여 도메인 의존성 낮추기]]></title><description><![CDATA[<blockquote>&#xC774; &#xAE00;&#xC740; &#xB2F9;&#xADFC;&#xB9C8;&#xCF13;&#xC744; &#xBAA8;&#xD2F0;&#xBE0C;&#xB85C; &#xD55C; &#xD504;&#xB85C;&#xC81D;&#xD2B8; <a href="https://github.com/masters2023-2nd-project-05/second-hand?ref=localhost">Secondhand</a> &#xAD6C;&#xD604;&#xC2DC; &#xC774;&#xC288; &#xC0AC;&#xD56D;&#xC744; &#xC815;&#xB9AC;&#xD55C; &#xAE00;&#xC785;&#xB2C8;&#xB2E4;.</blockquote>
<p></p>
<h1 id="%EB%B0%9C%EB%8B%A8"><strong>&#xBC1C;&#xB2E8;</strong></h1>
<hr>
<p>Secondhand &#xC5D0;&#xB294; &#xC2E4;&#xC2DC;&#xAC04; &#xCC44;&#xD305; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774;</p>]]></description><link>http://localhost:2369/spring-eventreul-sayonghayeo-domein-yijonseong-najcugi/</link><guid isPermaLink="false">64e42a58749ee079fb78d2a2</guid><category><![CDATA[Posts]]></category><category><![CDATA[Spring]]></category><dc:creator><![CDATA[saehim lee]]></dc:creator><pubDate>Tue, 22 Aug 2023 03:24:19 GMT</pubDate><content:encoded><![CDATA[<blockquote>&#xC774; &#xAE00;&#xC740; &#xB2F9;&#xADFC;&#xB9C8;&#xCF13;&#xC744; &#xBAA8;&#xD2F0;&#xBE0C;&#xB85C; &#xD55C; &#xD504;&#xB85C;&#xC81D;&#xD2B8; <a href="https://github.com/masters2023-2nd-project-05/second-hand?ref=localhost">Secondhand</a> &#xAD6C;&#xD604;&#xC2DC; &#xC774;&#xC288; &#xC0AC;&#xD56D;&#xC744; &#xC815;&#xB9AC;&#xD55C; &#xAE00;&#xC785;&#xB2C8;&#xB2E4;.</blockquote>
<p></p>
<h1 id="%EB%B0%9C%EB%8B%A8"><strong>&#xBC1C;&#xB2E8;</strong></h1>
<hr>
<p>Secondhand &#xC5D0;&#xB294; &#xC2E4;&#xC2DC;&#xAC04; &#xCC44;&#xD305; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC6F9;&#xC18C;&#xCF13; &#xD1B5;&#xC2E0;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD558;&#xBA70; STOMP&#xC640; Redis pub/sub &#xC73C;&#xB85C; &#xAD6C;&#xD604;&#xD558;&#xC600;&#xB294;&#xB370;&#xC694;. &#xC774; &#xCC44;&#xD305;&#xC5D0; &#xB300;&#xD55C; &#xC694;&#xAD6C;&#xC0AC;&#xD56D; &#xC911;&#xC5D0; &#xB2E4;&#xB978; &#xB3C4;&#xBA54;&#xC778;&#xC758; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xCC38;&#xC870;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xB9CE;&#xC544;&#xC838; Facade&#xAC00; &#xBE44;&#xB300;&#xD574;&#xC9C0;&#xACE0; &#xAC01; &#xB3C4;&#xBA54;&#xC778;&#xC758; &#xC11C;&#xBE44;&#xC2A4; &#xB85C;&#xC9C1;&#xC774; &#xBCF5;&#xC7A1;&#xD558;&#xAC8C; &#xAD6C;&#xC131;&#xC774; &#xB418;&#xBA70; &#xC758;&#xC874;&#xC131;&#xC774; &#xB192;&#xC544;&#xC9C0;&#xB294; &#xC6B0;&#xB824;&#xAC00; &#xC0DD;&#xACBC;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="language-java">@Component
@RequiredArgsConstructor
public class ChatroomFacade {
    private final ChatroomService chatRoomService;
    private final ItemService itemService;
    private final MemberService memberService;
    private final ChatroomCacheService chatroomCacheService;

		// &#xAE30;&#xD0C0; &#xB4F1;&#xB4F1; &#xCF54;&#xB4DC;&#xB4E4;
}
</code></pre>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.kakaocdn.net/dn/ZZsvZ/btstMlCDdNR/cSNRFpK1sqKtimKiKNWVK1/img.png" class="kg-image" alt loading="lazy"><figcaption><span style="white-space: pre-wrap;">&#xC774;&#xBBF8;&#xC9C0; &#xCD9C;&#xCC98; : WIKI&#xA0;Facade</span></figcaption></figure>
<p></p>
<p>&#xD30C;&#xC0AC;&#xB4DC; &#xD328;&#xD134;&#xC73C;&#xB85C; &#xC800;&#xC218;&#xC900; &#xBAA8;&#xB4C8;&#xC778; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xCC38;&#xC870;&#xD558;&#xACE0; &#xC788;&#xC5C8;&#xB294;&#xB370;, &#xC774;&#xB7EC;&#xB2E4;&#xAC04; &#xBAA8;&#xB4E0; &#xB3C4;&#xBA54;&#xC778;&#xC758; &#xC11C;&#xBE44;&#xC2A4;&#xB97C; &#xB2E4; &#xCC38;&#xC870;&#xD558;&#xAC8C; &#xC0DD;&#xACBC;&#xC2B5;&#xB2C8;&#xB2E4; &#x1F440;</p>
<p>&#xADF8; &#xC678;&#xC5D0;&#xB3C4; &#xBA87;&#xAC00;&#xC9C0; &#xBB38;&#xC81C;&#xAC00; &#xB300;&#xB450;&#xB418;&#xB294;&#xB370;&#xC694;. &#xCCAB;&#xBC88;&#xC9F8;&#xB85C;&#xB294; &#xD558;&#xB098;&#xC758; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC73C;&#xB85C; &#xC774; &#xC804;&#xCCB4; &#xB85C;&#xC9C1;&#xC774; &#xB2E4;&#xAC19;&#xC774; &#xBB36;&#xC774;&#xB2E4;&#xBCF4;&#xB2C8; &#xBB50; &#xD558;&#xB098;&#xAC00; &#xCDE8;&#xC18C;&#xB418;&#xB354;&#xB77C;&#xB3C4; &#xB864;&#xBC31;&#xC744; &#xC2DC;&#xCF1C;&#xC57C; &#xD558;&#xAC8C;&#xB429;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C;&#xB4E4;&#xC5B4; &#xCC44;&#xD305;&#xC54C;&#xB78C;&#xC744; &#xBCF4;&#xB0B4;&#xB294;&#xB370; &#xC2E4;&#xD328;&#xD55C;&#xB2E4;&#xBA74; &#xCC44;&#xD305; &#xBC1C;&#xC1A1;&#xC774; &#xC2E4;&#xD328;&#xD574;&#xC57C;&#xD560;&#xAE4C;&#xC694;? &#xB2E4;&#xB978; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xC774;&#xB97C; &#xCC98;&#xB9AC;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB450;&#xBC88;&#xC9F8;&#xB294; &#xC774; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC758; &#xB3D9;&#xC791; &#xC131;&#xB2A5;&#xC5D0; &#xB2E4;&#xB978; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC911;&#xAC04;&#xC5D0; &#xC5B4;&#xB5A4; &#xC791;&#xC5C5;&#xC774; &#xC9C0;&#xC5F0;&#xB41C;&#xB2E4;&#xBA74; &#xB4A4;&#xC5D0; &#xBA85;&#xC2DC;&#xB41C; &#xC791;&#xC5C5;&#xB4E4;&#xB3C4; &#xBAA8;&#xB450; &#xC9C0;&#xC5F0;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p></p>
<h2 id="%EA%B5%AC%ED%98%84-%EB%AA%A8%EB%93%88-%EA%B5%AC%EC%A1%B0"><strong>&#xAD6C;&#xD604; &#xBAA8;&#xB4C8; &#xAD6C;&#xC870;</strong></h2>
<p>&#xAD6C;&#xD604; &#xBC30;&#xACBD;&#xC774; &#xB418;&#xB294; &#xD604;&#xC7AC;&#xC758; &#xD328;&#xD0A4;&#xC9C0; &#xAD6C;&#xC870;&#xC785;&#xB2C8;&#xB2E4;. &#xD06C;&#xAC8C; <code>api</code>&#xC640; <code>chat</code>&#xC73C;&#xB85C; &#xB098;&#xB258;&#xC5B4; &#xC788;&#xB294;&#xB370;, &#xCC44;&#xD305;&#xC5D0; &#xB300;&#xD55C; &#xB3C4;&#xBA54;&#xC778;&#xACFC; &#xB85C;&#xC9C1;&#xC774; &#xBCF5;&#xC7A1;&#xD574;&#xC9C0;&#xBA70; &#xB530;&#xB85C; &#xBD84;&#xB9AC;&#xD55C; &#xACB0;&#xACFC;&#xC785;&#xB2C8;&#xB2E4;.</p>
<pre><code>api
&#x23BF; chatroom // &#xCC44;&#xD305;&#xBC29;. &#xC544;&#xC774;&#xD15C;&#xACFC; &#xAD6C;&#xB9E4;&#xC790;(member) &#xC815;&#xBCF4;&#xB97C; &#xAD00;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.
&#x23BF; item // &#xC911;&#xACE0; &#xC0C1;&#xD488;.
&#x23BF; member // &#xD68C;&#xC6D0;.
&#x23BF; oauth // &#xD68C;&#xC6D0; &#xC778;&#xC99D;&#xC778;&#xAC00;.
&#x23BF; region // &#xB3D9;&#xB124; &#xC9C0;&#xC5ED;.
&#x23BF; wishlist // &#xAD00;&#xC2EC; &#xC0C1;&#xD488;.

chat // &#xC2E4;&#xC2DC;&#xAC04; &#xCC44;&#xD305;&#xC5D0; &#xB300;&#xD55C; &#xB3C4;&#xBA54;&#xC778;&#xB4E4;&#xC744; &#xBAA8;&#xC544;&#xB450;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.
&#x23BF; bubble // &#xCC44;&#xD305; &#xBA54;&#xC2DC;&#xC9C0; &#xB3C4;&#xBA54;&#xC778;.
&#x23BF; metainfo // &#xCC44;&#xD305;&#xBC29; metainfo &#xB3C4;&#xBA54;&#xC778;. &#xCC44;&#xD305;&#xBC29; &#xC778;&#xC6D0;, &#xC548;&#xC77D;&#xC740; &#xCC44;&#xD305;&#xC218;, &#xB9C8;&#xC9C0;&#xB9C9; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xAD00;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.
&#x23BF; notification // &#xD604;&#xC7AC; &#xC811;&#xC18D;&#xC911;&#xC778; member&#xC640; &#xC2E4;&#xC2DC;&#xAC04; &#xCC44;&#xD305; &#xC54C;&#xB78C;.

global // &#xC804;&#xC5ED;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; model, exception, config &#xB4F1;&#xC744; &#xC815;&#xC758;&#xD558;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.
</code></pre>
<p>&#xC774;&#xB807;&#xAC8C; &#xD328;&#xD0A4;&#xC9C0; &#xAD6C;&#xC870;&#xAC00; &#xB418;&#xC5B4;&#xC788;&#xC744; &#xB54C; &#xB3C4;&#xBA54;&#xC778;&#xAC04; &#xC758;&#xC874;&#xB3C4;&#xAC00; &#xBCF5;&#xC7A1;&#xD574;&#xC9C8;&#xB9CC;&#xD55C; &#xB85C;&#xC9C1;&#xACFC; &#xC218;&#xB3C4;&#xCF54;&#xB4DC;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul><li>&#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xCC44;&#xD305; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xBC1C;&#xC1A1;&#xD55C;&#xB2E4;.<ul><li>&#xCC44;&#xD305; &#xC54C;&#xB78C;&#xC744; &#xC0C1;&#xB300;&#xBC29;&#xC774; &#xBC1B;&#xC744; &#xC218; &#xC788;&#xB2E4;.</li><li>&#xCC44;&#xD305; &#xBA54;&#xC2DC;&#xC9C0;&#xAC00; &#xC800;&#xC7A5;&#xB418;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;.</li><li>&#xCC44;&#xD305;&#xBC29; MetaInfo&#xB97C; &#x2018;&#xC548; &#xC77D;&#xC740; &#xBA54;&#xC2DC;&#xC9C0;&#x2019; &#xAC1C;&#xC218;&#xC640; &#x2018;&#xCC44;&#xD305;&#xBC29;&#xC5D0; &#xB9C8;&#xC9C0;&#xB9C9;&#xC73C;&#xB85C; &#xBC1C;&#xC1A1;&#xB41C; &#xBA54;&#xC2DC;&#xC9C0;&#x2019;&#xAC00; &#xAC31;&#xC2E0;&#xB418;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;.</li></ul></li></ul>
<p></p>
<pre><code class="language-java">// messagePublishFacade&#xC5D0;&#xC11C;

@Transactional
  public void publish(String topic, ChatBubble message) {
    message.ready();
    redisTemplate.convertAndSend(topic, message); // &#xCC44;&#xD305;&#xBC29; topic&#xC73C;&#xB85C; pub
            
    chatbubbleService.save(message) // db&#xC5D0; &#xC800;&#xC7A5;
    chatNotificationService.push(message) // &#xD68C;&#xC6D0;&#xC5D0;&#xAC8C; &#xC54C;&#xB78C; &#xBC1C;&#xC1A1;
    chatMetainfoService.update(message) // metainfo &#xC218;&#xC815;
  }
</code></pre>
<p>&#xC774; &#xC678;&#xC5D0;&#xB3C4; &#xCF54;&#xB4DC;&#xAC00; &#xBCF5;&#xC7A1;&#xD574;&#xC9C8; &#xC218; &#xC788;&#xB294; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xB85C;&#xC9C1;&#xC774; &#xB9E4;&#xC6B0; &#xB9CE;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB807;&#xB4EF; &#xD558;&#xB098;&#xC758; &#xD2B8;&#xB9AC;&#xAC70;&#xAC00; &#xBC1C;&#xC0DD;&#xD588;&#xC744; &#xB54C; &#xC5F0;&#xC1C4;&#xC801;&#xC73C;&#xB85C; &#xC77C;&#xC5B4;&#xB098;&#xC57C; &#xD558;&#xB294; &#xC11C;&#xBE44;&#xC2A4; &#xB85C;&#xC9C1;&#xC774; &#xC5EC;&#xB7FF; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC2EC;&#xC9C0;&#xC5B4; &#xC774;&#xB7EC;&#xD55C; &#xCF54;&#xB4DC;&#xC758; &#xBB38;&#xC81C;&#xB294; &#xD558;&#xB098;&#xC758; &#xD2B8;&#xB79C;&#xC81D;&#xC158;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xB418;&#xBBC0;&#xB85C; &#xD558;&#xB098;&#xC758; &#xC775;&#xC149;&#xC158;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; &#xBAA8;&#xB450; &#xCDE8;&#xC18C;&#xAC00; &#xB41C;&#xB2E4;&#xAC70;&#xB098; &#xD558;&#xB098;&#xC758; &#xB85C;&#xC9C1;&#xC774; &#xBAA8;&#xB450; &#xC2E4;&#xD589;&#xB420; &#xB54C;&#xAE4C;&#xC9C0; &#xB2E4;&#xB978; &#xB85C;&#xC9C1;&#xB4E4;&#xC758; &#xB300;&#xAE30;&#xC2DC;&#xAC04;&#xC774; &#xAE38;&#xC5B4;&#xC9C4;&#xB2E4;&#xB294; &#xB2E8;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xB9CC;&#xC57D; &#xB85C;&#xC9C1;&#xC774; &#xB354; &#xCD94;&#xAC00;&#xB41C;&#xB2E4;&#xBA74;? &#xC810;&#xC810; &#xD30C;&#xC0AC;&#xB4DC;&#xC640; &#xC11C;&#xBE44;&#xC2A4;&#xAC00; &#xBE44;&#xB300;&#xD574;&#xC9C0;&#xBA70; &#xCF54;&#xB4DC;&#xAC00; &#xB354; &#xBCF5;&#xC7A1;&#xD574;&#xC9C8; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<blockquote><strong>&#x1F4A1; &#xB2E4;&#xB978; &#xC608;&#xC2DC;</strong><br>&#xB9CC;&#xC57D; &#xD68C;&#xC6D0;&#xAC00;&#xC785;&#xC744; &#xD55C; &#xD68C;&#xC6D0;&#xC5D0;&#xAC8C; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC11C;&#xBE44;&#xC2A4; &#xB85C;&#xC9C1;&#xC774; &#xB3D9;&#xC2DC;&#xC5D0; &#xC801;&#xC6A9;&#xB418;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;&#xBA74; &#xC5B4;&#xB5BB;&#xAC8C; &#xD574;&#xC57C;&#xD560;&#xAE4C;&#xC694;?<br><br>- &#xD68C;&#xC6D0;&#xC5D0;&#xAC8C; &#xAC00;&#xC785; &#xD658;&#xC601; &#xC774;&#xBA54;&#xC77C;&#xC744; &#xBC1C;&#xC1A1;&#xD569;&#xB2C8;&#xB2E4;.<br>- &#xD68C;&#xC6D0;&#xC774; &#xC785;&#xB825;&#xD55C; &#xCD94;&#xCC9C;&#xC778;&#xC5D0;&#xAC8C; &#xD3EC;&#xC778;&#xD2B8;&#xB97C; &#xC90D;&#xB2C8;&#xB2E4;.<br>- &#xD68C;&#xC6D0;&#xC5D0;&#xAC8C; &#xAC00;&#xC785; &#xAE30;&#xB150; &#xCFE0;&#xD3F0;&#xC744; &#xBC1C;&#xD589;&#xD569;&#xB2C8;&#xB2E4;.<br>- &#x2026;</blockquote>
<p>&#xC774;&#xB7F0; &#xACBD;&#xC6B0;&#xC5D0; &#xC5B4;&#xB5BB;&#xAC8C; &#xB3C4;&#xBA54;&#xC778;&#xAC04;&#xC758; &#xC758;&#xC874;&#xC131;&#xC744; &#xB0AE;&#xCD94;&#xACE0; &#xCF54;&#xB4DC;&#xB97C; &#xAC04;&#xACB0;&#xD558;&#xAC8C; &#xD560; &#xC218; &#xC788;&#xC744;&#xAE4C; &#xD559;&#xC2B5;&#xD574;&#xBCF4;&#xB2E4; Spring Event &#xB97C; &#xB3C4;&#xC785;&#xD574;&#xBCF4;&#xAE30;&#xB85C; &#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. Spring Event&#xB97C; &#xD1B5;&#xD574; &#xBE44;&#xB3D9;&#xAE30;&#xB85C; &#xC5F0;&#xB3D9;&#xB418;&#xB294; &#xB85C;&#xC9C1;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xAC70;&#xB098; &#xAC19;&#xC740; &#xD2B8;&#xB79C;&#xC81D;&#xC158; &#xC548;&#xC5D0;&#xC11C; &#xCC98;&#xB9AC;&#xD558;&#xAC8C; &#xAD6C;&#xD604;&#xD560; &#xC218;&#xB3C4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xCC98;&#xB9AC;&#xD558;&#xAC8C; &#xB418;&#xB2C8; &#xAE30;&#xB2A5; &#xD655;&#xC7A5;&#xACFC; &#xC5F0;&#xB3D9;&#xC5D0; &#xD070; &#xC790;&#xC720;&#xB97C; &#xC5BB;&#xAC8C; &#xB418;&#xC5B4;&#xC11C; &#xC88B;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p></p>
<p></p>
<h1 id="spring-event"><strong>Spring Event</strong></h1>
<hr>
<p>&#xC5EC;&#xAE30;&#xC11C; event&#xB294; &#xC0AC;&#xC804;&#xC801;&#xC778; &#xC758;&#xBBF8; &#xADF8;&#xB300;&#xB85C; &#x2018;&#xACFC;&#xAC70; &#xC77C;&#xC5B4;&#xB09C; &#xC5B4;&#xB5A4; &#xC77C;&#x2019;&#xC774;&#xB77C;&#xACE0; &#xC774;&#xD574;&#xD558;&#xBA74; &#xC26C;&#xC6B4;&#xB370;&#xC694;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xC704;&#xC758; &#xC0C1;&#xD669;&#xC758; &#xACBD;&#xC6B0;&#xC5D0;&#xC11C;&#xB294; &#x201C;&#xD68C;&#xC6D0;&#xC774; &#xCC44;&#xD305; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xBC1C;&#xC1A1;&#xD55C;&#xB2E4;&#x201D;&#xAC00; &#xD558;&#xB098;&#xC758; &#xC774;&#xBCA4;&#xD2B8;&#xAC00; &#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>Spring Event&#xB97C; &#xD1B5;&#xD574; &#xC774;&#xBCA4;&#xD2B8;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; &#xADF8; &#xC774;&#xBCA4;&#xD2B8;&#xAC00; &#xD2B8;&#xB9AC;&#xAC70;&#xAC00; &#xB418;&#xC5B4; &#xBC18;&#xC751;&#xD558;&#xC5EC; &#xC6D0;&#xD558;&#xB294; &#xB3D9;&#xC791;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294; &#xAE30;&#xB2A5;&#xC744; &#xAD6C;&#xD604;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>SpringEvent&#xB294; ApplicationContext&#xAC00; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xAE30;&#xB2A5; &#xC911; &#xD558;&#xB098;&#xC785;&#xB2C8;&#xB2E4;.</p>
<figure class="kg-card kg-code-card"><pre><code class="language-java">public interface ApplicationContext extends EnvironmentCapable, ListableBeanFactory, HierarchicalBeanFactory,
		MessageSource, ApplicationEventPublisher, ResourcePatternResolver {
</code></pre><figcaption><p><span style="white-space: pre-wrap;">&#xC2E4;&#xC81C; ApplicationContext&#xB294; ApplicationEventPublisher &#xB97C; &#xCC38;&#xC870;&#xD569;&#xB2C8;&#xB2E4;.</span></p></figcaption></figure>
<ul><li>&#xB3D9;&#xC791; &#xBC29;&#xC2DD;&#xC740; &#xB2E4;&#xC74C;&#xC758; &#xBE14;&#xB85C;&#xADF8; &#xAE00;&#xC744; &#xCC38;&#xACE0;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. <a href="https://blog.naver.com/gngh0101/222020512119?ref=localhost">&#xCC38;&#xACE0;&#xB9C1;&#xD06C;</a></li></ul>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.kakaocdn.net/dn/GgQBq/btstRuetizW/kZIVKLO1LZktEzRiLQE92k/img.png" class="kg-image" alt loading="lazy"><figcaption><span style="white-space: pre-wrap;">&#xCD9C;&#xCC98; : &#xB3C4;&#xBA54;&#xC778;&#xA0;&#xC8FC;&#xB3C4; &#xAC1C;&#xBC1C; &#xC2DC;&#xC791;&#xD558;&#xAE30;</span></figcaption></figure>
<p>&#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xB3C4;&#xC785;&#xD558;&#xB824;&#xBA74; &#xB2E4;&#xC74C;&#xC758; &#xAD6C;&#xC131;&#xC744; &#xAD6C;&#xD604;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ol><li>&#xC774;&#xBCA4;&#xD2B8; : &#xC774;&#xBCA4;&#xD2B8; &#xD37C;&#xBE14;&#xB9AC;&#xC154;&#xB97C; &#xD1B5;&#xD574; &#xBC1C;&#xD589;&#xB420; &#xC774;&#xBCA4;&#xD2B8;</li><li>&#xC774;&#xBCA4;&#xD2B8; &#xC0DD;&#xC131; &#xC8FC;&#xCCB4; : &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xC5EC; Event Publisher&#xC5D0; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xC804;&#xB2EC;&#xD569;&#xB2C8;&#xB2E4;.</li><li>&#xC774;&#xBCA4;&#xD2B8; &#xD37C;&#xBE14;&#xB9AC;&#xC154;(&#xC774;&#xBCA4;&#xD2B8; &#xB514;&#xC2A4;&#xD328;&#xCC98;) : &#xD574;&#xB2F9; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xB294; &#xD578;&#xB4E4;&#xB7EC;&#xC5D0; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xC804;&#xD30C;&#xD569;&#xB2C8;&#xB2E4;. (&#xC5B4;&#xB178;&#xD14C;&#xC774;&#xC158;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD558;&#xBA70; &#xD574;&#xB2F9;&#xD558;&#xB294; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; invoke&#xC2DC;&#xD0A4;&#xB294; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.)</li><li>&#xC774;&#xBCA4;&#xD2B8; &#xD578;&#xB4E4;&#xB7EC; (&#xC774;&#xBCA4;&#xD2B8; &#xB9AC;&#xC2A4;&#xB108;) : &#xCD5C;&#xC885;&#xC801;&#xC73C;&#xB85C; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xBC1B;&#xC544; &#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.</li></ol>
<p></p>
<p></p>
<h1 id="springevent%EB%A5%BC-%EC%A0%81%EC%9A%A9%EC%8B%9C%EC%BC%9C%EB%B3%B4%EC%9E%90"><strong>SpringEvent&#xB97C; &#xC801;&#xC6A9;&#xC2DC;&#xCF1C;&#xBCF4;&#xC790;</strong></h1>
<hr>
<p>&#xC704;&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD55C; &#xAD6C;&#xC131;&#xC744; &#xAD6C;&#xD604;&#xD558;&#xC5EC; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xC774;&#xBCA4;&#xD2B8; &#xCC98;&#xB9AC; &#xB85C;&#xC9C1;&#xC744; &#xAD6C;&#xD604;&#xD558;&#xB824;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ol><li><code>BubbleService</code> &#xC5D0;&#xC11C; <strong><code>Events.raise()</code></strong>&#xA0;&#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xD1B5;&#xD574; <code>arrivedEvent</code> &#xC744; &#xBC1C;&#xD589;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;.</li><li>&#xADF8;&#xB7FC; &#xD37C;&#xBE14;&#xB9AC;&#xC154;(&#xB514;&#xC2A4;&#xD328;&#xCC98;)&#xB97C; &#xAC70;&#xCCD0; &#xC774;&#xBCA4;&#xD2B8;&#xAC00; &#xBC1C;&#xD589;&#xB418;&#xC5C8;&#xC744; &#xB54C;</li><li>&#xAC01; &#xB2E4;&#xB978; &#xB3C4;&#xBA54;&#xC778;&#xC758; <code>arrivedEvent</code> &#xD578;&#xB4E4;&#xB7EC;&#xAC00; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</li></ol>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.kakaocdn.net/dn/bowB0n/btstTr9b58F/HDCCUWlot21rPojYnLn4c1/img.png" class="kg-image" alt loading="lazy"><figcaption><span style="white-space: pre-wrap;">Events&#xB294; EventPublisher&#xB97C; &#xAC00;&#xC9C0;&#xACE0;&#xA0;&#xC788;&#xC73C;&#xBBC0;&#xB85C; &#xAC19;&#xC740; &#xB178;&#xB4DC;&#xB85C; &#xD45C;&#xD604;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;.</span></figcaption></figure>
<p></p>
<h2 id="%EA%B5%AC%ED%98%84%EC%82%AC%ED%95%AD"><strong>&#xAD6C;&#xD604;&#xC0AC;&#xD56D;</strong></h2>
<h3 id="baseevent"><strong>BaseEvent</strong></h3>
<ul><ul><li>&#xBA3C;&#xC800; &#xBAA8;&#xB4E0; event&#xC5D0; &#xACF5;&#xD1B5;&#xC73C;&#xB85C; &#xC801;&#xC6A9;&#xD560; &#xD544;&#xB4DC;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; BaseEvent &#xB97C; &#xAD6C;&#xD604;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>Spring Framework 4.2 &#xC774;&#xC804; &#xBC84;&#xC804;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xACBD;&#xC6B0;&#xA0;&#xC774;&#xBCA4;&#xD2B8;&#xB97C;&#xA0;ApplicationEvent&#xB97C; &#xD655;&#xC7A5;&#xD574;&#xC11C; &#xC0AC;&#xC6A9;&#xD574;&#xC57C;&#xD558;&#xC9C0;&#xB9CC;, &#xC774;&#xD6C4; &#xBC84;&#xC804;&#xC5D0;&#xC11C;&#xB294; &#xD074;&#xB798;&#xC2A4;&#xB97C; &#xD655;&#xC7A5;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xAD6C;&#xD604;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>&#xC81C;&#xB124;&#xB9AD;&#xC73C;&#xB85C; &#xC774;&#xBCA4;&#xD2B8; &#xC720;&#xD615;&#xC758; &#xC815;&#xBCF4;&#xB97C; &#xAC19;&#xC774; &#xC804;&#xB2EC;&#xD558;&#xB294; &#xAC83;&#xB3C4; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</li></ul></ul>
<pre><code class="language-java">@Getter
public abstract class BaseEvent ~~extends ApplicationEvent~~ {
    private Instant createdAt;

	    protected BaseEvent() {
        this.createdAt = Instant.now();
    }
}
</code></pre>
<p></p>
<h3 id="event-%EA%B5%AC%ED%98%84"><strong>Event &#xAD6C;&#xD604;</strong></h3>
<ul><ul><li>&#xC774;&#xB97C; &#xD655;&#xC7A5;&#xD558;&#xC5EC; &#xAD6C;&#xCCB4;&#xC801;&#xC778; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xAD6C;&#xD604;&#xD574;&#xC8FC;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>&#xD574;&#xB2F9; &#xC774;&#xBCA4;&#xD2B8;&#xB294; &#xC0AC;&#xC6A9;&#xC790;&#xAC00; &#xBC1C;&#xC1A1;&#xD55C; &#xCC44;&#xD305;&#xC774; &#xB3C4;&#xCC29;&#xD588;&#xC744; &#xB54C; &#xBC1C;&#xD589;&#xB418;&#xB294; &#xC774;&#xBCA4;&#xD2B8;&#xC785;&#xB2C8;&#xB2E4;.</li></ul></ul>
<pre><code class="language-java">@Getter
public class ChatBubbleArrivedEvent extends BaseEvent {
    private final ChatBubble chatBubble;

    public ChatBubbleArrivedEvent(ChatBubble chatBubble) {
        super();
        this.chatBubble = chatBubble;
        log.info(&quot;ChatBubble Arrived Event Occur = {}&quot;, chatBubble.toString());
    }

    public String getChatReceiverId() {
        return chatBubble.getReceiver();
    }
}
</code></pre>
<p></p>
<h3 id="events-%EA%B5%AC%ED%98%84">Events &#xAD6C;&#xD604;</h3>
<ul><li><strong>Event &#xB97C; &#xBC1C;&#xD589;&#xC744; &#xC2DC;&#xD0AC; &#xD074;&#xB798;&#xC2A4; Events &#xB97C; &#xB9CC;&#xB4E4;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;.</strong></li></ul>
<pre><code class="language-java">public class Events {
    private static ApplicationEventPublisher publisher;

    static void setPublisher(ApplicationEventPublisher publisher) {
        Events.publisher = publisher;
    }

    public static void raise(BaseEvent event) {
        if (publisher!=null) {
            publisher.publishEvent(event);
        }
    }
}
</code></pre>
<p></p>
<h3 id="event-%EB%B0%9C%ED%96%89-%EC%A3%BC%EC%B2%B4-%EA%B5%AC%ED%98%84">Event &#xBC1C;&#xD589; &#xC8FC;&#xCCB4; &#xAD6C;&#xD604;</h3>
<ul><li><strong>Service &#xC5D0;&#xC11C; Event&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;.</strong></li></ul>
<pre><code class="language-java">@Transactional
    public void publish(String topic, ChatBubble message) {
        log.debug(&quot;pub log : &quot; +  message.toString() + &quot;/ topic: &quot; + topic);
        message.ready();
        redisTemplate.convertAndSend(topic, message);

        Events.raise(new ChatBubbleArrivedEvent(message)); // &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0B5;&#xB2C8;&#xB2E4;.
    }
</code></pre>
<p></p>
<h3 id="event-handle-%EB%A1%9C%EC%A7%81-%EA%B5%AC%ED%98%84">Event Handle &#xB85C;&#xC9C1; &#xAD6C;&#xD604;</h3>
<ul><li><strong>EventListener&#xB97C; &#xAD6C;&#xD604;&#xD569;&#xB2C8;&#xB2E4;.</strong></li></ul>
<pre><code class="language-java">@EventListener // &#xCC44;&#xD305;&#xBC29; &#xBA54;&#xD0C0; &#xC815;&#xBCF4;&#xB97C; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xD569;&#xB2C8;&#xB2E4;.
public void chatBubbleArrivedEventHandler(**ChatBubbleArrivedEvent** event) throws NotChatroomMemberException {
    ChatBubble chatBubble = event.getChatBubble();
    Chatroom chatroom = getChatroom(chatBubble.getRoomId());
    chatroom.updateLastMessage(chatBubble);
    Chatroom saveChatroom = metaInfoRepository.save(chatroom);
}
</code></pre>
<p>&#xC774;&#xB807;&#xAC8C; &#xAD6C;&#xD604;&#xD560; &#xACBD;&#xC6B0; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xD0C0;&#xC784;&#xB77C;&#xC778;&#xC73C;&#xB85C; &#xB3D9;&#xC791;&#xD569;&#xB2C8;&#xB2E4;.</p>
<figure class="kg-card kg-image-card"><img src="https://blog.kakaocdn.net/dn/0lgcK/btstX3fpDfk/Pw4WDKIbTyJ6r7CiEtgKG1/img.png" class="kg-image" alt loading="lazy"></figure>
<p></p>
<h2 id="%EB%B9%84%EB%8F%99%EA%B8%B0-%EC%9D%B4%EB%B2%A4%ED%8A%B8-%EC%B2%98%EB%A6%AC"><strong>&#xBE44;&#xB3D9;&#xAE30; &#xC774;&#xBCA4;&#xD2B8; &#xCC98;&#xB9AC;</strong></h2>
<p>&#xBAA8;&#xB4E0; &#xC774;&#xBCA4;&#xD2B8;&#xAC00; &#xC21C;&#xC11C;&#xB300;&#xB85C; &#xC5F0;&#xC1C4;&#xC801;&#xC73C;&#xB85C; &#xBC1C;&#xC0DD;&#xD558;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xB418;&#xBBC0;&#xB85C; &#xBE44;&#xB3D9;&#xAE30; &#xC774;&#xBCA4;&#xD2B8; &#xCC98;&#xB9AC;&#xB97C; &#xD558;&#xB294; &#xD3B8;&#xC774; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xD6A8;&#xC728;&#xC131;&#xC5D0; &#xC720;&#xB9AC;&#xD558;&#xB2E4;&#xACE0; &#xD310;&#xB2E8;&#xD588;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xC0C1;&#xB300;&#xBC29;&#xC774; &#xCC44;&#xD305; &#xBA54;&#xC2DC;&#xC9C0;&#xB97C; &#xBCF4;&#xB0C8;&#xC744; &#xB54C; &#xCC44;&#xD305; metainfo &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xAC00; &#xBA87; &#xCD08; &#xD6C4;&#xC5D0; &#xB3D9;&#xC791;&#xD574;&#xB3C4; &#xC0C1;&#xAD00;&#xC774; &#xC5C6;&#xB294; &#xAC83;&#xC774;&#xC9C0;&#xC694;.</p>
<p>&#xBE44;&#xB3D9;&#xAE30; &#xC774;&#xBCA4;&#xD2B8;&#xB85C; &#xD574;&#xB2F9; &#xCF54;&#xB4DC;&#xB97C; &#xBC14;&#xAFB8;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xB294; &#xAC04;&#xB2E8;&#xD788; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC774; &#xC5B4;&#xB178;&#xD14C;&#xC774;&#xC158;&#xC744; &#xBD99;&#xC5EC;&#xC8FC;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC774; &#xD578;&#xB4E4;&#xB9C1; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC5EC;&#xB7EC;&#xAC1C; &#xAD6C;&#xD604;&#xD558;&#xBA74; &#xC774;&#xBCA4;&#xD2B8;&#xAC00; &#xBC1C;&#xD589;&#xB420; &#xB54C; &#xBAA8;&#xB450; &#xC2E4;&#xD589;&#xB429;&#xB2C8;&#xB2E4;.</p>
<pre><code class="language-java">@Async // &#xBE44;&#xB3D9;&#xAE30; &#xC774;&#xBCA4;&#xD2B8;&#xCC98;&#xB9AC;&#xD569;&#xB2C8;&#xB2E4;.
@EventListener
public void chatBubbleArrivedEventHandler(ChatBubbleArrivedEvent event) throws NotChatroomMemberException {
    ChatBubble chatBubble = event.getChatBubble();
    Chatroom chatroom = getChatroom(chatBubble.getRoomId());
    chatroom.updateLastMessage(chatBubble);
    Chatroom saveChatroom = metaInfoRepository.save(chatroom);
    Events.raise(ChatNotificationEvent.of(saveChatroom, chatBubble));
}
</code></pre>
<pre><code class="language-java">@EnableAsync // &#xC774;&#xAC83;&#xB3C4; &#xBD99;&#xC5EC;&#xC8FC;&#xC5B4;&#xC57C; &#xC801;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.
@SpringBootApplication
public class BackendApplication {

	public static void main(String[] args) {
		SpringApplication.run(BackendApplication.class, args);
	}

}
</code></pre>
<p></p>
<h2 id="%EC%9D%B4%EB%B2%A4%ED%8A%B8-%EB%B0%9C%ED%96%89-%EC%A3%BC%EC%B2%B4%EC%9D%98-%ED%8A%B8%EB%9E%9C%EC%9E%AD%EC%85%98-%EB%8B%A8%EA%B3%84%EC%99%80-%EB%B0%94%EC%9D%B8%EB%94%A9-transactionaleventlistener"><strong>&#xC774;&#xBCA4;&#xD2B8; &#xBC1C;&#xD589; &#xC8FC;&#xCCB4;&#xC758; &#xD2B8;&#xB79C;&#xC7AD;&#xC158; &#xB2E8;&#xACC4;&#xC640; &#xBC14;&#xC778;&#xB529; <code>@TransactionalEventListener</code></strong></h2>
<p>&#xC774; &#xC5B4;&#xB178;&#xD14C;&#xC774;&#xC158;&#xC744; &#xC0AC;&#xC6A9;&#xD574; &#xC774;&#xBCA4;&#xD2B8; &#xB9AC;&#xC2A4;&#xB108; &#xC2E4;&#xD589;&#xACFC; &#xD2B8;&#xB79C;&#xC81D;&#xC158; &#xB2E8;&#xACC4;&#xB97C; &#xBC14;&#xC778;&#xB529;&#xD558;&#xC5EC; &#xC2E4;&#xD589;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>phase &#xC815;&#xC758;&#xB97C; &#xC798; &#xD65C;&#xC6A9;&#xD558;&#xBA74; &#xCC44;&#xD305; &#xBA54;&#xC2DC;&#xC9C0; &#xBC1C;&#xC1A1;&#xC774; &#xC2E4;&#xD328;&#xD588;&#xC744; &#xB54C;&#xC758; &#xB85C;&#xC9C1;&#xC744; &#xAD6C;&#xD604;&#xD560; &#xC218; &#xC788;&#xC744; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul><li><code>AFTER_COMMIT</code> : (&#xAE30;&#xBCF8;&#xAC12;)&#xC740; &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC774; <strong>&#xC131;&#xACF5;&#xC801;&#xC73C;&#xB85C; &#xC644;&#xB8CC;&#xB41C; &#xACBD;&#xC6B0; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xBC1C;&#xC0DD;&#xC2DC;&#xD0A4;&#xB294; &#xB370; &#xC0AC;&#xC6A9;&#xB429;&#xB2C8;&#xB2E4;.</strong></li><li><code>AFTER_ROLLBACK</code> : &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC774; <strong>&#xB864;&#xBC31;&#xB41C; &#xACBD;&#xC6B0;</strong></li><li><code>AFTER_COMPLETION</code> : &#xD2B8;&#xB79C;&#xC7AD;&#xC158;&#xC774; <strong>&#xC644;&#xB8CC;&#xB41C; &#xACBD;&#xC6B0;</strong></li><li><code>BEFORE_COMMIT</code> : &#xD2B8;&#xB79C;&#xC7AD;&#xC158; &#xCEE4;&#xBC0B; &#xC9C1;&#xC804;&#xC5D0; &#xC2E4;&#xD589;</li></ul>
<pre><code class="language-java">@TransactionalEventListener(phase = TransactionPhase.BEFORE_COMMIT) // &#xC774;&#xB7F0;&#xC2DD;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.
public void handleCustom(CustomSpringEvent event) {
    log.info(&quot;Handling event inside a transaction BEFORE COMMIT.&quot;);
}
</code></pre>
<p></p>
<h2 id="%EC%A1%B0%EA%B1%B4%EB%B6%80-%EC%9D%B4%EB%B2%A4%ED%8A%B8-%EA%B5%AC%ED%98%84"><strong>&#xC870;&#xAC74;&#xBD80; &#xC774;&#xBCA4;&#xD2B8; &#xAD6C;&#xD604;</strong></h2>
<p>&#xC774;&#xBCA4;&#xD2B8; &#xB0B4;&#xBD80; &#xC815;&#xBCF4;&#xB85C; &#xD50C;&#xB798;&#xADF8;&#xB97C; &#xAD6C;&#xD604;&#xD558;&#xACE0; &#xC774;&#xB97C; <code>condition</code> &#xC5D0; &#xC791;&#xC131;&#xD574;&#xC8FC;&#xBA74; &#xC870;&#xAC74;&#xBD80;&#xB85C; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="language-java">public GenericSpringEvent T {
	private boolean notificationAgree; // &#xD50C;&#xB798;&#xADF8;&#xB97C; &#xAD6C;&#xD604;&#xD569;&#xB2C8;&#xB2E4;.
}
</code></pre>
<pre><code class="language-java">@EventListener(condition = &quot;#event.notificationAgree&quot;) // &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xC870;&#xAC74;&#xBD80;&#xB85C; &#xB9CC;&#xB4DC;&#xB294; &#xAC83;&#xB3C4; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.
public void handleSuccessful(GenericSpringEvent&lt;String&gt; event) {
    log.info(&quot;Handling generic event (conditional).&quot;);
}
</code></pre>
<p></p>
<p></p>
<h1 id="%EA%B5%AC%ED%98%84%EC%9D%98-%ED%95%9C%EA%B3%84%EC%99%80-%EA%B0%9C%EC%84%A0%ED%95%A0-%EC%A0%90"><strong>&#xAD6C;&#xD604;&#xC758; &#xD55C;&#xACC4;&#xC640; &#xAC1C;&#xC120;&#xD560; &#xC810;</strong></h1>
<hr>
<h2 id="%EC%BD%94%EB%93%9C-%EA%B0%80%EB%8F%85%EC%84%B1%EA%B3%BC-%EB%94%94%EB%B2%84%EA%B9%85-%EB%AC%B8%EC%A0%9C"><strong>&#xCF54;&#xB4DC; &#xAC00;&#xB3C5;&#xC131;&#xACFC; &#xB514;&#xBC84;&#xAE45; &#xBB38;&#xC81C;</strong></h2>
<p>&#xC774;&#xC640; &#xAC19;&#xC774; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xAD6C;&#xD604;&#xD558;&#xC5EC; &#xC11C;&#xBE44;&#xC2A4; &#xB85C;&#xC9C1;&#xC744; &#xC5F0;&#xB3D9;&#xD558;&#xC600;&#xC744; &#xB54C;, &#xB3C4;&#xBA54;&#xC778; &#xC758;&#xC874;&#xC131;&#xC744; &#xB0AE;&#xCD94;&#xB824;&#xB294; &#xBAA9;&#xD45C;&#xB294; &#xD6CC;&#xB96D;&#xD788; &#xB2EC;&#xC131;&#xD558;&#xC600;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC774;&#xBCA4;&#xD2B8; &#xBC1C;&#xD589;&#xC774; &#xC5B4;&#xB5A4; &#xC601;&#xD5A5;&#xC744; &#xBBF8;&#xCE58;&#xB294; &#xC9C0; &#xCF54;&#xB4DC;&#xB97C; &#xC77D;&#xAE30; &#xC5B4;&#xB824;&#xC6CC;&#xC84C;&#xB2E4;&#xB294; &#xB2E8;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xBC1C;&#xD589;&#xD588;&#xC744; &#xB54C; &#xC5B4;&#xB5A4; &#xB85C;&#xC9C1;&#xC774; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xC9C0; &#xD14C;&#xC2A4;&#xD2B8;&#xC640; &#xB514;&#xBC84;&#xAE45;&#xC744; &#xD558;&#xAE30; &#xD798;&#xB4E4;&#xC5B4;&#xC84C;&#xB2E4;&#xB294; &#xC810; &#xB610;&#xD55C; &#xC544;&#xC26C;&#xC6B4; &#xC810;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p></p>
<h2 id="%EB%A1%9C%EC%BB%AC-%ED%95%B8%EB%93%A4%EB%9F%AC%EC%9D%98-%ED%95%9C%EA%B3%84"><strong>&#xB85C;&#xCEEC; &#xD578;&#xB4E4;&#xB7EC;&#xC758; &#xD55C;&#xACC4;</strong></h2>
<p>Spring Event&#xB294; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xB85C;&#xCEEC; &#xD578;&#xB4E4;&#xB7EC;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xBBC0;&#xB85C; &#xD558;&#xB098;&#xC758; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0;&#xC11C; &#xC2E4;&#xD589;&#xD55C;&#xB2E4;&#xB294; &#xD55C;&#xACC4;&#xC810;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD2B9;&#xD788; &#xB2E4;&#xC74C;&#xC758; &#xC8FC;&#xC758;&#xC0AC;&#xD56D;&#xC744; &#xACE0;&#xB824;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ul><li>&#xB85C;&#xCEEC; &#xD578;&#xB4E4;&#xB7EC;&#xC758; &#xACBD;&#xC6B0; &#xC774;&#xBCA4;&#xD2B8; &#xC720;&#xC2E4; &#xC8FC;&#xC758;<ul><li>&#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xD578;&#xB4E4;&#xB9C1;&#xD558;&#xB2E4; &#xC608;&#xC678; &#xBC1C;&#xC0DD; &#xB4F1;&#xC73C;&#xB85C; &#xC2E4;&#xD328;&#xD558;&#xBA74; &#xD574;&#xB2F9; &#xC774;&#xBCA4;&#xD2B8;&#xB294; &#xC720;&#xC2E4;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li><li>&#xC774;&#xBCA4;&#xD2B8; &#xC7AC;&#xCC98;&#xB9AC;&#xD558;&#xBA70; &#xBA71;&#xB4F1;&#xC131; &#xC8FC;&#xC758;<ul><li>&#xB9CC;&#xC57D; &#xC774;&#xBCA4;&#xD2B8; &#xC7AC;&#xCC98;&#xB9AC;&#xB97C; &#xC704;&#xD55C; &#xB85C;&#xC9C1;&#xC744; &#xAD6C;&#xD604;&#xD55C;&#xB2E4;&#xBA74;, &#xC7AC;&#xCC98;&#xB9AC;&#xB97C; &#xD1B5;&#xD574; &#xB370;&#xC774;&#xD130;&#xAC00; &#xBCC0;&#xACBD;&#xB418;&#xAC70;&#xB098; &#xC758;&#xB3C4;&#xC640; &#xB2E4;&#xB974;&#xAC8C; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xB3D9;&#xC791;&#xD558;&#xC9C0;&#xB294; &#xC54A;&#xB294;&#xC9C0; &#xC8FC;&#xC758;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</li></ul></li></ul>
<p>MSA&#xB97C; &#xAD6C;&#xD604;&#xD55C;&#xB2E4;&#xBA74; &#xC11C;&#xBE44;&#xC2A4;&#xAC04; &#xC774;&#xBCA4;&#xD2B8; &#xD578;&#xB4E4;&#xB9C1;&#xC744; &#xD558;&#xB294; &#xAC83;&#xC774; &#xD798;&#xB4ED;&#xB2C8;&#xB2E4;. &#xC774;&#xB7F4;&#xACBD;&#xC6B0; &#xB2E4;&#xC74C;&#xC758; &#xB300;&#xC548;&#xB4E4;&#xC774; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul><li>&#xBA54;&#xC2DC;&#xC9C0; &#xD050;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;. -&gt; &#xC774; &#xBC29;&#xBC95;&#xC744; &#xAC00;&#xC7A5; &#xB9CE;&#xC774; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.<ul><li>&#xCE74;&#xD504;&#xCE74;, &#xB808;&#xBE57;MQ &#xB4F1; &#xBA54;&#xC2DC;&#xC9D5; &#xC2DC;&#xC2A4;&#xD15C;</li></ul></li><li>&#xC774;&#xBCA4;&#xD2B8; &#xC800;&#xC7A5;&#xC18C;&#xC640; &#xC774;&#xBCA4;&#xD2B8; &#xD3EC;&#xC6CC;&#xB354;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.<ul><li>&#xC774;&#xBCA4;&#xD2B8; &#xC800;&#xC7A5;&#xC18C; DB&#xC640; &#xD3EC;&#xC6CC;&#xB354;&#xB97C; &#xAD6C;&#xD604;&#xD558;&#xC5EC; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</li><li>&#xC774;&#xBCA4;&#xD2B8; &#xC720;&#xC2E4; &#xAC00;&#xB2A5;&#xC131;&#xC744; &#xC904;&#xC77C; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul></li><li>&#xC774;&#xBCA4;&#xD2B8; &#xC800;&#xC7A5;&#xC18C;&#xC640; &#xC774;&#xBCA4;&#xD2B8; &#xC81C;&#xACF5; API&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.<ul><li>&#xC774;&#xBCA4;&#xD2B8; &#xC800;&#xC7A5;&#xC18C; DB&#xC640; &#xC678;&#xBD80; API&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</li></ul></li></ul>
<p>&#xC774;&#xC5D0; &#xB300;&#xD55C; &#xC790;&#xC138;&#xD55C; &#xC815;&#xBCF4;&#xB294; `&#xB3C4;&#xBA54;&#xC778; &#xAC1C;&#xBC1C; &#xC2DC;&#xC791;&#xD558;&#xAE30;` &#xCC45;&#xC5D0;&#xC11C; &#xCC38;&#xACE0;&#xD560; &#xC218; &#xC788;&#xC73C;&#xBA70; &#xD604;&#xC7AC; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xADDC;&#xBAA8;&#xC5D0;&#xC11C;&#xB294; &#xB2E4;&#xB8E8;&#xC9C0; &#xC54A;&#xC558;&#xC2B5;&#xB2C8;&#xB2E4;&#xB9CC; &#xC911;&#xC694;&#xD55C; &#xC774;&#xBCA4;&#xD2B8;&#xB77C;&#xAC70;&#xB098; &#xC880; &#xB354; &#xBCF5;&#xC7A1;&#xD55C; &#xAD6C;&#xC870;&#xC758; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;, &#xD639;&#xC740; MSA&#xC5D0;&#xC11C;&#xB294; &#xC801;&#xADF9; &#xBA54;&#xC2DC;&#xC9C0; &#xD050;, &#xC774;&#xBCA4;&#xD2B8; &#xC800;&#xC7A5;&#xC18C; &#xB3C4;&#xC785;&#xC744; &#xACE0;&#xB824;&#xD560; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p></p>
<p></p>
<h1 id="%EC%8B%A4%EB%AC%B4%EC%97%90%EC%84%9C%EC%9D%98-%EC%9D%B4%EB%B2%A4%ED%8A%B8-%EC%82%AC%EC%9A%A9"><strong>&#xC2E4;&#xBB34;&#xC5D0;&#xC11C;&#xC758; &#xC774;&#xBCA4;&#xD2B8; &#xC0AC;&#xC6A9;</strong></h1>
<hr>
<p>&#xC2E4;&#xBB34; &#xC0AC;&#xB840;&#xC5D0;&#xC11C; &#xCE74;&#xD504;&#xCE74;, &#xB808;&#xBE57;MQ &#xB4F1; &#xBA54;&#xC2DC;&#xC9D5; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xD544;&#xB450;&#xB85C; &#xC774;&#xBCA4;&#xD2B8;&#xB97C; &#xAE30;&#xBC18;&#xD55C; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xC190;&#xC27D;&#xAC8C; &#xCC3E;&#xC544;&#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; &#xC2E4;&#xBB34;&#xC5D0;&#xC11C;&#xB294; &#xB85C;&#xCEEC; &#xD578;&#xB4E4;&#xB9C1;&#xB9CC;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#xACC4;&#xCE35;&#xC801;&#xC73C;&#xB85C; &#xC774;&#xB97C; &#xAD6C;&#xC870;&#xD654;&#xD558;&#xACE0; &#xC774;&#xBCA4;&#xD2B8; &#xC800;&#xC7A5;&#xC18C;&#xB97C; &#xB3C4;&#xC785;&#xD55C; &#xC774;&#xBCA4;&#xD2B8; &#xAE30;&#xBC18; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xAD6C;&#xD604;&#xD55C; &#xBAA8;&#xC2B5;&#xC785;&#xB2C8;&#xB2E4;.</p>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.kakaocdn.net/dn/461GC/btstVixsvg4/6nqNRxdy6RfwKmAhZfhYh0/img.png" class="kg-image" alt loading="lazy"><figcaption><span style="white-space: pre-wrap;">&#xC774;&#xB7F0; &#xC2DD;&#xC73C;&#xB85C; &#xC774;&#xBCA4;&#xD2B8;&#xC758; &#xBC1C;&#xD589;&#xACFC; &#xAD6C;&#xB3C5;&#xC73C;&#xB85C; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158; &#xAD6C;&#xB3D9;&#xC774; &#xC5F0;&#xB3D9;&#xB420; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xCD9C;&#xCC98; : https://techblog.woowahan.com/7835/</span></figcaption></figure>
<p></p>
<p>Spring Event &#xAD6C;&#xD604;&#xD558;&#xACE0; &#xC774;&#xBCA4;&#xD2B8; &#xAE30;&#xBC18; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xACF5;&#xBD80;&#xD558;&#xBA74;&#xC11C; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xC5C8;&#xB358; &#xAE00;&#xACFC; &#xC601;&#xC0C1;&#xC744; &#xB0A8;&#xAE41;&#xB2C8;&#xB2E4;.</p>
<ul><li><a href="https://techblog.woowahan.com/13101/?ref=localhost">&#xBC30;&#xBBFC;&#xC2A4;&#xD1A0;&#xC5B4;&#xC5D0; &#xC774;&#xBCA4;&#xD2B8; &#xAE30;&#xBC18; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xACC1;&#xB4E4;&#xC778;...</a></li><li><a href="https://techblog.woowahan.com/7835/?ref=localhost">&#xD68C;&#xC6D0;&#xC2DC;&#xC2A4;&#xD15C; &#xC774;&#xBCA4;&#xD2B8;&#xAE30;&#xBC18; &#xC544;&#xD0A4;&#xD14D;&#xCC98; &#xAD6C;&#xCD95;&#xD558;&#xAE30;</a></li><li><a href="https://www.youtube.com/watch?v=lCxgddyxDyg&amp;ref=localhost">2200&#xB9CC; &#xC0AC;&#xC6A9;&#xC790;&#xB97C; &#xC704;&#xD55C; &#xCC44;&#xD305; &#xC2DC;&#xC2A4;&#xD15C; &#xC544;&#xD0A4;&#xD14D;&#xCC98;</a></li></ul>
<p></p>
<hr>
<h1 id="refs">Refs.</h1>
<ul><li><a href="https://www.baeldung.com/spring-events?ref=localhost">https://www.baeldung.com/spring-events</a></li><li><a href="https://ivvve.github.io/2019/06/04/java/Spring/event-listener-3/?ref=localhost">https://ivvve.github.io/2019/06/04/java/Spring/event-listener-3/</a></li><li><a href="https://www.linkedin.com/pulse/thoughts-event-driven-architectures-mark-mishaev?ref=localhost"><strong>Thoughts About Event-Driven Architectures</strong></a></li><li>&#xB3C4;&#xBA54;&#xC778; &#xAC1C;&#xBC1C; &#xC2DC;&#xC791;&#xD558;&#xAE30; (&#xCD5C;&#xBC94;&#xADE0;)</li></ul>]]></content:encoded></item><item><title><![CDATA[해시테이블(Hash Table) 자바코드로 구현하기]]></title><description><![CDATA[<p></p>
<h1 id="%ED%95%B4%EC%8B%9C%ED%85%8C%EC%9D%B4%EB%B8%94%EC%9D%B4%EB%9E%80">&#xD574;&#xC2DC;&#xD14C;&#xC774;&#xBE14;&#xC774;&#xB780;?</h1>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Hash_table_3_1_1_0_1_0_0_SP.svg/1024px-Hash_table_3_1_1_0_1_0_0_SP.svg.png" class="kg-image" alt="&#xD55C;&#xC815;&#xB418;&#xC9C0; &#xC54A;&#xC740;" loading="lazy"><figcaption><a href="https://en.wikipedia.org/wiki/Hash_table?ref=localhost"><span>https://en.wikipedia.org/wiki/Hash_table</span></a></figcaption></figure>
<p>HashMap&#xC774;&#xB77C;&#xACE0;&#xB3C4; &#xC54C;&#xB824;&#xC9C4; &#xD574;&#xC2DC; &#xD14C;&#xC774;&#xBE14;(HashTable)&#xC740; &#xD0A4;(Key)&#xB97C; &#xAC12;(Value)&#xB85C; &#xB9E4;&#xD551;&#xD558;&#xB294; &#xCD94;&#xC0C1; &#xB370;&#xC774;&#xD130; &#xC720;&#xD615;&#xC785;&#xB2C8;&#xB2E4;. &#xB0B4;</p>]]></description><link>http://localhost:2369/hashtable-java/</link><guid isPermaLink="false">64e40f8c749ee079fb78d291</guid><category><![CDATA[datastructure]]></category><category><![CDATA[Java]]></category><category><![CDATA[Posts]]></category><dc:creator><![CDATA[saehim lee]]></dc:creator><pubDate>Sun, 20 Aug 2023 01:29:00 GMT</pubDate><content:encoded><![CDATA[<p></p>
<h1 id="%ED%95%B4%EC%8B%9C%ED%85%8C%EC%9D%B4%EB%B8%94%EC%9D%B4%EB%9E%80">&#xD574;&#xC2DC;&#xD14C;&#xC774;&#xBE14;&#xC774;&#xB780;?</h1>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Hash_table_3_1_1_0_1_0_0_SP.svg/1024px-Hash_table_3_1_1_0_1_0_0_SP.svg.png" class="kg-image" alt="&#xD55C;&#xC815;&#xB418;&#xC9C0; &#xC54A;&#xC740;" loading="lazy"><figcaption><a href="https://en.wikipedia.org/wiki/Hash_table?ref=localhost"><span>https://en.wikipedia.org/wiki/Hash_table</span></a></figcaption></figure>
<p>HashMap&#xC774;&#xB77C;&#xACE0;&#xB3C4; &#xC54C;&#xB824;&#xC9C4; &#xD574;&#xC2DC; &#xD14C;&#xC774;&#xBE14;(HashTable)&#xC740; &#xD0A4;(Key)&#xB97C; &#xAC12;(Value)&#xB85C; &#xB9E4;&#xD551;&#xD558;&#xB294; &#xCD94;&#xC0C1; &#xB370;&#xC774;&#xD130; &#xC720;&#xD615;&#xC785;&#xB2C8;&#xB2E4;. &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; &#xC5F0;&#xAD00; &#xBC30;&#xC5F4;(associative array)&#xB098; &#xB515;&#xC154;&#xB108;&#xB9AC;(dictionary)&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xAC01; &#xD0A4;Key&#xC5D0; &#xD574;&#xC2DC; &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xD574;&#xC2DC;&#xCF54;&#xB4DC;&#xB77C;&#xACE0;&#xB3C4; &#xD558;&#xB294; &#xC778;&#xB371;&#xC2A4;(index)&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xACE0; &#xC774; index &#xC704;&#xCE58;&#xC5D0; &#xAC12;(Value)&#xAC00; &#xC800;&#xC7A5;&#xB429;&#xB2C8;&#xB2E4;.</p>
<p></p>
<pre><code class="language-JavaScript">colors = {
    &quot;Red&quot;    : &quot;#FF0000&quot;,
    &quot;Green&quot;  : &quot;#00FF00&quot;,
    &quot;Blue&quot;   : &quot;#0000FF&quot;,
    &quot;White&quot;  : &quot;#FFFFFF&quot;,
    &quot;Black&quot;  : &quot;#000000&quot;,
    &quot;Yellow&quot; : &quot;#FFFF00&quot;,
    &quot;Cyan&quot;   : &quot;#00FFFF&quot;,
    &quot;Magenta&quot;: &quot;#FF00FF&quot;,
    &quot;Gray&quot;   : &quot;#808080&quot;,
    &quot;Orange&quot; : &quot;#FFA500&quot;
}</code></pre>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xC704;&#xC758; &#xAD6C;&#xC870;&#xC5D0;&#xC11C; &#xD0A4;&#xB294; &quot;Gray&quot;, &#xAC12;&#xC740; &quot;#808080&quot; &#xB97C; &#xC800;&#xC7A5;&#xD574;&#xB450;&#xBA74; &#xD0A4;&#xC778; Gray&#xB85C; &#xBC14;&#xB85C; &#xAC12;&#xC744; &#xCC3E;&#xC744; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xD574;&#xC2DC; &#xD568;&#xC218;&#xB97C; &#xD1B5;&#xD574; &#xD0A4;&#xC778; &quot;Gray&quot;&#xB97C; &#xC778;&#xB371;&#xC2A4;&#xB85C; &#xB9CC;&#xB4E0; &#xD6C4; &#xBC30;&#xC5F4;&#xC758; &#xC778;&#xB371;&#xC2A4; &#xC790;&#xB9AC;&#xC5D0;  <code>{ &#x201C;Gray&#x201D; : &quot;#808080&#x201D; }</code> &#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC5EC;&#xAE30;&#xC11C; &#xC778;&#xB371;&#xC2A4;&#xC758; &#xBC94;&#xC704;&#xB294; &#xD574;&#xC2DC; &#xD14C;&#xC774;&#xBE14;&#xC758; &#xD06C;&#xAE30;&#xC5D0; &#xC758;&#xC874;&#xC801;&#xC785;&#xB2C8;&#xB2E4;. &#xC608;&#xB97C; &#xB4E4;&#xC5B4; &#xD574;&#xC2DC;&#xD14C;&#xC774;&#xBE14; &#xD06C;&#xAE30;&#xAC00; 100&#xC774;&#xBA74; &#xD574;&#xC2DC; &#xD568;&#xC218;&#xB85C; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xB294; &#xC778;&#xB371;&#xC2A4;&#xC758; &#xBC94;&#xC704;&#xB294; 0&#xBD80;&#xD130; 99&#xAE4C;&#xC9C0;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xD574;&#xC2DC; &#xD14C;&#xC774;&#xBE14;&#xC5D0;&#xC11C; &#xB97C; &#xD560; &#xB54C; &#xD3C9;&#xADE0; &#xC2DC;&#xAC04; &#xBCF5;&#xC7A1;&#xB3C4;&#xB294; &#xD14C;&#xC774;&#xBE14;&#xC5D0; &#xC800;&#xC7A5;&#xB41C; &#xC694;&#xC18C;&#xC758; &#xAC1C;&#xC218;&#xC640;&#xB294; &#xBB34;&#xAD00;&#xD558;&#xAC8C; O(1)&#xC785;&#xB2C8;&#xB2E4;.</p>
<table>
  <thead>
    <tr><td>Algorithm</td><td>Average</td><td>Worse</td></tr>
  </thead>
  <tbody>
  <tr><td>Search</td><td>O(1)</td><td>O(n)</td></tr>
  <tr><td>Insert</td><td>O(1)</td><td>O(n)</td></tr>
  <tr><td>Delete</td><td>O(1)</td><td>O(n)</td></tr>
</tbody></table>
<p>&#xC800;&#xC7A5;/&#xC0AD;&#xC81C;&#xD560; &#xB54C; &#xD0A4;Key&#xB97C; &#xAE30;&#xC900;&#xC73C;&#xB85C; &#xD14C;&#xC774;&#xBE14;&#xC5D0; &#xC800;&#xC7A5;/&#xC0AD;&#xC81C;&#xD560; &#xC704;&#xCE58;&#xB97C; &#xACC4;&#xC0B0;&#xD558;&#xC5EC; &#xC2DC;&#xD589;&#xD569;&#xB2C8;&#xB2E4;. (&#xC2DC;&#xAC04;&#xBCF5;&#xC7A1;&#xB3C4; <code>O(1)</code>) &#xC870;&#xD68C;&#xB97C; &#xD560; &#xB54C;&#xB3C4; &#xC704;&#xCE58; &#xACC4;&#xC0B0;&#xD558;&#xC5EC; <code>O(1)</code> &#xC2DC;&#xAC04;&#xC5D0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC870;&#xD68C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p></p>
<h2 id="%EC%96%B4%EB%96%BB%EA%B2%8C-%EC%82%AC%EC%9A%A9%ED%95%98%EB%A9%B4-%EC%A2%8B%EC%9D%84%EA%B9%8C">&#xC5B4;&#xB5BB;&#xAC8C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC88B;&#xC744;&#xAE4C;?</h2>
<h3 id="%EC%9E%A5%EC%A0%90">&#xC7A5;&#xC810;</h3>
<ul><li>&#xD3C9;&#xADE0;&#xC801;&#xC73C;&#xB85C; O(1)&#xC758; &#xC2DC;&#xAC04; &#xBCF5;&#xC7A1;&#xB3C4;&#xB85C; &#xC870;&#xD68C;,&#xC0BD;&#xC785;, &#xC0AD;&#xC81C;&#xB97C; &#xC218;&#xD589;&#xD560; &#xC218; &#xC788;&#xC5B4; &#xB370;&#xC774;&#xD130; &#xC811;&#xADFC;&#xC744; &#xBE60;&#xB974;&#xAC8C; &#xD569;&#xB2C8;&#xB2E4;.</li><li>&#xD0A4;&#xB97C; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xAC12;&#xC744; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xAC80;&#xC0C9;&#xD558;&#xB294; &#xAD6C;&#xC870;&#xB85C; &#xB370;&#xC774;&#xD130; &#xAD00;&#xACC4;&#xB97C; &#xBCF4;&#xB2E4; &#xC27D;&#xACE0; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xAD00;&#xB9AC;&#xAC00; &#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.</li><li>&#xD0A4;Key&#xB294; &#xC720;&#xC77C;&#xD55C; &#xAC12;&#xC73C;&#xB85C; &#xC800;&#xC7A5;&#xD574;&#xC57C;&#xD558;&#xBBC0;&#xB85C; &#xC911;&#xBCF5;&#xC744; &#xBC29;&#xC9C0;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul>
<h3 id="%EB%8B%A8%EC%A0%90">&#xB2E8;&#xC810;</h3>
<ul><li>&#xD574;&#xC2DC; &#xD568;&#xC218;&#xC758; &#xACB0;&#xACFC;&#xAC12;&#xC73C;&#xB85C; &#xB098;&#xC624;&#xB294; Index&#xC758; &#xAC12;&#xC774; &#xC911;&#xBCF5;&#xB418;&#xBA74; &#xD574;&#xC2DC;&#xCDA9;&#xB3CC;&#xC774; &#xC77C;&#xC5B4;&#xB0A0; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li><li>&#xC21C;&#xC11C;&#xB300;&#xB85C; &#xBC30;&#xC5F4;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xBBC0;&#xB85C; &#xC21C;&#xC11C;&#xAC00; &#xD544;&#xC694;&#xD55C; &#xB85C;&#xC9C1;&#xC5D0;&#xB294; &#xC0AC;&#xC6A9;&#xD558;&#xAE30; &#xD798;&#xB4ED;&#xB2C8;&#xB2E4;.</li></ul>
<h3 id="%EC%82%AC%EC%9A%A9-%EC%98%88%EC%8B%9C">&#xC0AC;&#xC6A9; &#xC608;&#xC2DC;</h3>
<ul><li>&#xB370;&#xC774;&#xD130; &#xC911;&#xBCF5; &#xAC80;&#xC0AC;&#xAC00; &#xD544;&#xC694;&#xD55C; &#xACBD;&#xC6B0;</li><li>&#xB370;&#xC774;&#xD130; &#xC811;&#xADFC;&#xC744; &#xBE60;&#xB974;&#xAC8C; &#xD574;&#xC57C;&#xD558;&#xB294; &#xACBD;&#xC6B0;</li><li>&#xCE90;&#xC2F1; Caching<ul><li>Redis&#xC5D0; Key-Value&#xB97C; &#xC800;&#xC7A5;&#xD560; &#xB54C; &#xB0B4;&#xBD80;&#xC801;&#xC73C;&#xB85C; &#xD574;&#xC2DC;&#xD14C;&#xC774;&#xBE14; &#xAD6C;&#xC870;&#xB97C; &#xC0AC;&#xC6A9;&#xD569;&#xB2C8;&#xB2E4;.</li><li>&#xC774; &#xACBD;&#xC6B0; &#xCDA9;&#xB3CC;&#xD558;&#xB294; &#xD56D;&#xBAA9; &#xC911; &#xD558;&#xB098;&#xB97C; &#xC0AD;&#xC81C;&#xD558;&#xC5EC; &#xD574;&#xC2DC; &#xCDA9;&#xB3CC;&#xC744; &#xCC98;&#xB9AC;&#xD558;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;.</li></ul></li><li>Key-Value &#xAD6C;&#xC870;&#xB85C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAD00;&#xB9AC;&#xD574;&#xC57C; &#xD558;&#xB294; &#xACBD;&#xC6B0;</li></ul>
<p></p>
<h2 id="%ED%95%B4%EC%8B%9C-%EC%B6%A9%EB%8F%8C-hash-collision">&#xD574;&#xC2DC; &#xCDA9;&#xB3CC; Hash Collision</h2>
<p>&#xD0A4;Key&#xC5D0; &#xD574;&#xC2DC; &#xD568;&#xC218;&#xB97C; &#xC801;&#xC6A9;&#xD588;&#xC744; &#xB54C; &#xACB0;&#xACFC; &#xAC12;&#xC774; &#xB3D9;&#xC77C;&#xD55C; &#xB370;&#xC774;&#xD130; 2&#xAC1C;&#xAC00; &#xC788;&#xB2E4;&#xACE0; &#xD588;&#xC744; &#xB54C; &#xC5B4;&#xB5A4; &#xAC83;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xC800;&#xC7A5;&#xD574;&#xC57C; &#xD560;&#xAE4C;&#xC694;? &#xC774;&#xB807;&#xAC8C; &#xD574;&#xC2DC; &#xD14C;&#xC774;&#xBE14; &#xB0B4;&#xC5D0; &#xC0BD;&#xC785;&#xD558;&#xACE0;&#xC790; &#xD558;&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC704;&#xCE58;&#xC5D0; &#xB2E4;&#xB978; &#xB370;&#xC774;&#xD130;&#xAC00; &#xC800;&#xC7A5;&#xC744; &#xC2DC;&#xB3C4;&#xD558;&#xB294; &#xACBD;&#xC6B0; &#xD574;&#xC2DC; &#xCDA9;&#xB3CC;&#xC774; &#xBC1C;&#xC0DD;&#xD55C;&#xB2E4;&#xACE0; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9CC;&#xC57D; &#xD574;&#xC2DC; &#xD568;&#xC218;&#xC758; &#xACB0;&#xACFC;&#xAC12; &#xBC94;&#xC704;&#xAC00; &#xBB34;&#xD55C;&#xD558;&#xB2E4;&#xBA74; &#xC774;&#xB7F0; &#xC77C;&#xC774; &#xC77C;&#xC5B4;&#xB098;&#xC9C0; &#xC54A;&#xACA0;&#xC9C0;&#xB9CC;, &#xD574;&#xC2DC; &#xD568;&#xC218;&#xC758; &#xACB0;&#xACFC;&#xAC00; &#xD574;&#xC2DC; &#xD14C;&#xC774;&#xBE14; &#xD06C;&#xAE30; &#xBC94;&#xC704; &#xC774;&#xB0B4;&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC774;&#xB7EC;&#xD55C; &#xBB38;&#xC81C;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xC5D0; &#xB300;&#xD55C; &#xB300;&#xD45C;&#xC801;&#xC778; &#xD574;&#xACB0;&#xBC95; 2&#xAC1C;&#xB97C; &#xC801;&#xC6A9;&#xD55C; &#xAD6C;&#xD604; &#xC0AC;&#xB840;&#xB97C; &#xACF5;&#xC720;&#xD558;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p></p>
<h2 id="separate-chaning">Separate Chaning</h2>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Hash_table_5_0_1_1_1_1_0_LL.svg/1024px-Hash_table_5_0_1_1_1_1_0_LL.svg.png" class="kg-image" alt="undefined" loading="lazy"><figcaption><a href="https://en.wikipedia.org/wiki/Hash_table?ref=localhost"><span>https://en.wikipedia.org/wiki/Hash_table</span></a></figcaption></figure>
<p></p>
<ul><li>&#xD574;&#xC2DC; &#xCDA9;&#xB3CC;&#xC774; &#xC77C;&#xC5B4;&#xB098;&#xB294; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC5F0;&#xACB0; &#xB9AC;&#xC2A4;&#xD2B8; LinkedList &#xC758; &#xB9C8;&#xC9C0;&#xB9C9; &#xD639;&#xC740; &#xCC98;&#xC74C; &#xB178;&#xB4DC;&#xB85C; &#xC5F0;&#xACB0;&#xD574;&#xC11C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</li><li>&#xD574;&#xC2DC; &#xD14C;&#xC774;&#xBE14; &#xAD6C;&#xD604;&#xC758; &#xC77C;&#xBC18;&#xC801;&#xC778; &#xBC29;&#xC2DD;&#xC785;&#xB2C8;&#xB2E4;.</li></ul>
<pre><code class="language-java">import java.util.*;

public class SeparateChaningHashTable&lt;K, V&gt; implements HashTable{

    private static final float LOAD_FACTOR = 0.75f;
    private LinkedList&lt;Entry&lt;K, V&gt;&gt;[] tables;
    private int size;

    @Override
    public void put(Object key, Object value) {
        if (isResizingRequired()) {
            resize();
        }

        Entry&lt;K, V&gt; objectObjectEntry = new Entry&lt;&gt;((K)key, (V)value);
        tables[hashCode(key)].add(objectObjectEntry);
        numberOfItems ++;
    }
</code></pre>
<p>&#xC9C1;&#xC811; &#xAD6C;&#xD604;&#xD560; &#xB54C; &#xB0B4;&#xBD80; &#xC790;&#xB8CC;&#xAD6C;&#xC870;&#xB97C; LinkedList&#xC758; &#xBC30;&#xC5F4;&#xB85C; &#xAD6C;&#xD604;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="language-java">    @Override
    public Object get(Object key) {
        if (isEmpty()) {
            throw new EmptyStackException();
        }
        return tables[hashCode(key)].stream()
                .filter(e -&gt; e.getKey().equals(key))
                .map(Entry::getValue).findAny()
                .orElseThrow(() -&gt; new NoSuchElementException(&quot;&#xD574;&#xB2F9;&#xD558;&#xB294; &#xC694;&#xC18C;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;.&quot;));
    }

    public int hashCode(Object key) {
        return Math.abs(key.hashCode()) % tables.length;
    }
}</code></pre>
<p>&#xC870;&#xD68C;&#xB97C; &#xD560; &#xB54C;&#xB294; LinkedList&#xB97C; &#xD0D0;&#xC0C9;&#xD558;&#xC5EC; Key&#xAC00; &#xC77C;&#xCE58;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBC18;&#xD658;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p></p>
<h2 id="open-addressing">Open Addressing</h2>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Hash_table_5_0_1_1_1_1_0_SP.svg/1024px-Hash_table_5_0_1_1_1_1_0_SP.svg.png" class="kg-image" alt="&#xD55C;&#xC815;&#xB418;&#xC9C0; &#xC54A;&#xC740;" loading="lazy"><figcaption><a href="https://en.wikipedia.org/wiki/Hash_table?ref=localhost"><span>https://en.wikipedia.org/wiki/Hash_table</span></a></figcaption></figure>
<ul><li>&#xBAA8;&#xB4E0; &#xD56D;&#xBAA9; &#xB370;&#xC774;&#xD130;&#xAC00; &#xBC30;&#xC5F4;&#xC5D0; &#xC800;&#xC7A5;&#xB418;&#xB294; &#xD615;&#xD0DC;&#xC785;&#xB2C8;&#xB2E4;.</li><li>&#xC0C8; &#xD56D;&#xBAA9;&#xC744; &#xC0BD;&#xC785;&#xD574;&#xC57C;&#xD558;&#xB294;&#xB370; &#xD574;&#xC2DC; &#xCDA9;&#xB3CC;&#xC774; &#xC77C;&#xC5B4;&#xB098;&#xBA74; &#xD574;&#xC2DC;&#xB41C; &#xC2AC;&#xB86F;&#xBD80;&#xD130; &#xC2DC;&#xC791;&#xD558;&#xC5EC; &#xBE44;&#xC5B4;&#xC788;&#xB294; &#xC2AC;&#xB86F;&#xC744; &#xCC3E;&#xC744; &#xB54C;&#xAE4C;&#xC9C0; &#xD504;&#xB85C;&#xBE0C; &#xC11C;&#xC5F4;probe sequences &#xC21C;&#xC11C;&#xB85C; &#xC9C4;&#xD589;&#xD558;&#xBA74;&#xC11C; &#xBC30;&#xC5F4;&#xC744; &#xAC80;&#xC0AC;&#xD558;&#xC5EC; &#xBA3C;&#xC800; &#xCC3E;&#xB294; &#xBE48; &#xC2AC;&#xB86F;&#xC5D0; &#xB808;&#xCF54;&#xB4DC;&#xB97C; &#xC800;&#xC7A5;&#xD569;&#xB2C8;&#xB2E4;.</li><li>&#xC8FC;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; probe sequences &#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.<ul><li>&#xC120;&#xD615; &#xD0D0;&#xC0C9; <a href="https://en.wikipedia.org/wiki/Linear_probing?ref=localhost">Linear probing</a><ul><li>&#xD504;&#xB85C;&#xBE0C; &#xC0AC;&#xC774; &#xAC04;&#xACA9;&#xC774; &#xACE0;&#xC815;&#xB418;&#xC5B4; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBCF4;&#xD1B5; 1&#xC785;&#xB2C8;&#xB2E4;.</li></ul></li><li>&#xC774;&#xCC28;&#xC6D0; &#xD504;&#xB85C;&#xBE59; <a href="https://en.wikipedia.org/wiki/Quadratic_probing?ref=localhost">Quadratic probing</a><ul><li>&#xC6D0;&#xB798; &#xACC4;&#xC0B0; &#xACB0;&#xACFC;&#xAC12;&#xC5D0; 2&#xCC28; &#xB2E4;&#xD56D;&#xC2DD;&#xC758; &#xC5F0;&#xC18D; &#xCD9C;&#xB825;&#xC744; &#xCD94;&#xAC00;&#xD558;&#xC5EC; &#xD504;&#xB85C;&#xBE0C; &#xC0AC;&#xC774;&#xC758; &#xAC04;&#xACA9;&#xC744; &#xB298;&#xB9BD;&#xB2C8;&#xB2E4;.</li></ul></li><li>&#xB354;&#xBE14; &#xD574;&#xC2F1; <a href="https://en.wikipedia.org/wiki/Double_hashing?ref=localhost">Double hashing</a><ul><li>&#xD504;&#xB85C;&#xBE0C; &#xAC04;&#xC758; &#xAC04;&#xACA9;&#xC744; &#xBCF4;&#xC870; &#xD574;&#xC2DC; &#xD568;&#xC218;&#xB85C; &#xACC4;&#xC0B0;&#xD569;&#xB2C8;&#xB2E4;.</li></ul></li></ul></li></ul>
<p></p>
<p>&#xB2E4;&#xC74C;&#xC740; &#xC120;&#xD615; &#xD0D0;&#xC0C9; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xAD6C;&#xD604;&#xD55C; &#xC0AC;&#xB840;&#xC785;&#xB2C8;&#xB2E4;. (&#xAE30;&#xBCF8;&#xAC12; 1)</p>
<pre><code class="language-java">import java.util.*;

public class LinearProbingHashTable&lt;K, V&gt; implements HashTable {

    private static final float LOAD_FACTOR = 0.6f;
    private Entry&lt;K,V&gt;[] tables;
    private int size;

    public LinearProbingHashTable(int capacity) {
        this.tables = new Entry[capacity];
        this.size = 0;
    }

}</code></pre>
<p>Entry &#xBC30;&#xC5F4;&#xC744; &#xB0B4;&#xBD80; &#xAD6C;&#xC870;&#xB85C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<pre><code class="language-java">    @Override
    public void put(Object key, Object value) {
        if (isResizingRequired()) {
            resize();
        }

        Entry&lt;K, V&gt; objectEntry = new Entry&lt;&gt;((K) key, (V) value);
        int index = hashCode((K) key);

        // &#xAC19;&#xC740; Key&#xAC00; &#xC788;&#xB294;&#xC9C0;&#xB3C4; &#xD655;&#xC778;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.. &#xAC19;&#xC740; Key&#xAC00; &#xC788;&#xC744; &#xACBD;&#xC6B0; &#xC0BD;&#xC785;&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD569;&#xB2C8;&#xB2E4;.

        while (tables[index] != null) {
            index = (index + 1) % tables.length;
        }

        tables[index] = objectEntry;
        numberOfItems++;
    }

    @Override
    public void remove(Object key) {
        int index = hashCode((K) key);

        for (int i=0; i&lt;tables.length; i++) {
            if (tables[index].getKey().equals(key)) {
                tables[index] = null;
                numberOfItems --;
                return;
            }
            index = (index+1)% tables.length;
        }
    }

    @Override
    public Object get(Object key) {
        int index = hashCode((K) key);

        for (int i=0; i&lt;tables.length; i++) {
            if (tables[index] != null &amp;&amp; tables[index].getKey().equals(key)) {
                return tables[index].getValue();
            }
            index = (index+1)% tables.length;
        }

        throw new NoSuchElementException();
    }
}
</code></pre>
<p>&#xC774;&#xB807;&#xAC8C; &#xAD6C;&#xD604;&#xD560; &#xB54C;&#xC758; &#xAC00;&#xC7A5; &#xC78A;&#xAE30; &#xC26C;&#xC6B4; &#xC810;&#xC740; &#xACB0;&#xAD6D; &#xC790;&#xB8CC;&#xAD6C;&#xC870;&#xB97C; &#xC21C;&#xD68C;&#xD558;&#xBA70; &#xD0A4;Key&#xAC00; &#xAC19;&#xC740; &#xAC83;&#xC744; &#xCC3E;&#xC544;&#xC57C; &#xD55C;&#xB2E4;&#xB294; &#xC810;&#xC785;&#xB2C8;&#xB2E4;. &#xC870;&#xD68C;&#xB97C; &#xD560;&#xB54C;&#xB098; &#xC0AD;&#xC81C;&#xB97C; &#xD560; &#xB54C;&#xB3C4; &#xD574;&#xB2F9; &#xC704;&#xCE58;&#xC5D0; &#xC788;&#xB294; &#xD0A4;Key&#xAC00; &#xC77C;&#xCE58;&#xD558;&#xB294;&#xC9C0; &#xAC80;&#xC99D;&#xD558;&#xACE0; &#xC77C;&#xCE58;&#xD558;&#xC9C0; &#xC54A;&#xB2E4;&#xBA74; index&#xB97C; +1&#xC529; &#xD558;&#xBA70; &#xC21C;&#xD68C;&#xD558;&#xBA70; &#xD0D0;&#xC0C9;&#xD574;&#xC90D;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774;&#xB7F0; &#xACBD;&#xC6B0; &#xC2DC;&#xAC04;&#xBCF5;&#xC7A1;&#xB3C4;&#xAC00; &#xCD5C;&#xC545;&#xC758; &#xACBD;&#xC6B0; O(n)&#xC774; &#xB429;&#xB2C8;&#xB2E4;.</p>
<p></p>
<hr>
<ul><li>&#xCF54;&#xB4DC; &#xC804;&#xCCB4;&#xB294; <a href="https://github.com/new-pow/playground/tree/main/data-structure/src/main/java/com/example/datastructure?ref=localhost">github</a>&#xC5D0;&#xC11C; &#xD655;&#xC778;&#xD558;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li></ul>
<h2 id="%EC%B0%B8%EA%B3%A0%EC%9E%90%EB%A3%8C">&#xCC38;&#xACE0;&#xC790;&#xB8CC;</h2>
<ul><li>&#xC6D0;&#xD2F0;&#xB4DC; &#xD504;&#xB9AC;&#xC628;&#xBCF4;&#xB529; &#xC778;&#xD134;&#xC2ED; &#xBC31;&#xC5D4;&#xB4DC; 2&#xC8FC;&#xCC28; &#xC790;&#xB8CC;</li><li><a href="https://en.wikipedia.org/wiki/Hash_table?ref=localhost">Hash table wiki</a></li><li><a href="https://mangkyu.tistory.com/102?ref=localhost">[&#xC790;&#xB8CC;&#xAD6C;&#xC870;] &#xD574;&#xC2DC;&#xD14C;&#xC774;&#xBE14;(HashTable)&#xC774;&#xB780;?</a> (&#xB9DD;&#xB098;&#xB2C8; &#xAC1C;&#xBC1C;&#xC790;)</li></ul>]]></content:encoded></item><item><title><![CDATA[2022년 회고 (3) 백엔드 개발자가 되겠어 ✊]]></title><description><![CDATA[<blockquote>&#xB09C;&#xC0DD;&#xCC98;&#xC74C; CS&#xC2A4;&#xD130;&#xB514;<br>&#xC6B0;&#xC544;&#xD55C;&#xD14C;&#xD06C;&#xCF54;&#xC2A4; &#xD504;&#xB9AC;&#xCF54;&#xC2A4; 3&#xAE30;, &#xCF54;&#xB4DC;&#xC2A4;&#xCFFC;&#xB4DC; &#xD504;&#xB9AC;&#xCF54;&#xC2A4; &#xD6C4;&#xAE30;</blockquote>
<ul><li>&#xCF00;&#xCF00;&#xBB35;&#xC740; &#xC9C0;&#xB09C;&#xAE00; &#x1F447;<ul><li><a href="https://new-pow.github.io/2022-log-1/?ref=localhost" rel="noreferrer">2022&#xB144; &#xD68C;&#xACE0; (1) &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xAE30;</a></li></ul></li></ul>]]></description><link>http://localhost:2369/2022-log-3/</link><guid isPermaLink="false">64e418f8749ee079fb78d29a</guid><category><![CDATA[2022]]></category><category><![CDATA[Log]]></category><category><![CDATA[Posts]]></category><dc:creator><![CDATA[saehim lee]]></dc:creator><pubDate>Sun, 22 Jan 2023 02:10:00 GMT</pubDate><content:encoded><![CDATA[<blockquote>&#xB09C;&#xC0DD;&#xCC98;&#xC74C; CS&#xC2A4;&#xD130;&#xB514;<br>&#xC6B0;&#xC544;&#xD55C;&#xD14C;&#xD06C;&#xCF54;&#xC2A4; &#xD504;&#xB9AC;&#xCF54;&#xC2A4; 3&#xAE30;, &#xCF54;&#xB4DC;&#xC2A4;&#xCFFC;&#xB4DC; &#xD504;&#xB9AC;&#xCF54;&#xC2A4; &#xD6C4;&#xAE30;</blockquote>
<ul><li>&#xCF00;&#xCF00;&#xBB35;&#xC740; &#xC9C0;&#xB09C;&#xAE00; &#x1F447;<ul><li><a href="https://new-pow.github.io/2022-log-1/?ref=localhost" rel="noreferrer">2022&#xB144; &#xD68C;&#xACE0; (1) &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xAE30;&#xD68D;&#xC790;&#xAC00; &#xAC1C;&#xBC1C;&#xC790;&#xB97C; &#xAFC8;&#xAFB8;&#xAC8C;&#xB41C; &#xC774;&#xC57C;&#xAE30;</a></li><li><a href="https://new-pow.github.io/2022-log-2/?ref=localhost" rel="noreferrer">2022&#xB144; &#xD68C;&#xACE0; (2) &#xD480;&#xC2A4;&#xD0DD; &#xAD6D;&#xBE44;&#xAD50;&#xC721; &#xC218;&#xAC15;&#xAE30;</a></li></ul></li></ul>
<p>&#xC544;&#xC9C1;&#xB3C4; 2022&#xB144; &#xC774;&#xB77C;&#xB2C8; &#xC9C8;&#xB9B4;&#xB9CC;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;&#xB9CC;... &#xC0B4;&#xBA74;&#xC11C; &#xAC00;&#xC7A5; &#xBC14;&#xBE74;&#xB358; &#xC2DC;&#xAE30;&#xC774;&#xC790; &#xAC00;&#xC7A5; &#xC5F4;&#xC815;&#xC801;&#xC778; &#xC2DC;&#xAE30;&#xB97C; &#xBCF4;&#xB0B4;&#xACE0; &#xC788;&#xB294;&#xB9CC;&#xD07C; &#xC880; &#xB354; &#xC798; &#xAE30;&#xB85D;&#xD558;&#xACE0; &#xC2F6;&#xC740; &#xC695;&#xC2EC;&#xC5D0; &#xAE00;&#xC774; &#xAE38;&#xC5B4;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. 1&#xB144;&#xC744; 3&#xB144;&#xCC98;&#xB7FC; &#xC0B4;&#xC558;&#xC73C;&#xB2C8; 3&#xD3B8;&#xC815;&#xB3C4;&#xB294; &#xC368;&#xC57C;&#xB418;&#xC9C0; &#xC54A;&#xACA0;&#xC2B5;&#xB2C8;&#xAE4C;? &#xD5C8;&#xD5C8;</p>
<p>&#xB098;&#xC911;&#xC5D0; &#xAC1C;&#xBC1C;&#xC790; &#xACBD;&#xB825;&#xC774; &#xB354; &#xC313;&#xC600;&#xC744; &#xB54C;&#xB3C4; &#xACFC;&#xAC70; &#xCD08;&#xC2EC;&#xC790;&#xC758; &#xC5ED;&#xC0AC;&#xB97C; &#xC990;&#xAC70;&#xC6B4; &#xB9C8;&#xC74C;&#xC73C;&#xB85C; &#xB2E4;&#xC2DC; &#xC77D;&#xC5B4;&#xBCF4;&#xBA74; &#xC88B;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p></p>
<hr>
<p></p>
<h1 id="%EB%B0%B1%EC%97%94%EB%93%9C-%EA%B0%9C%EB%B0%9C%EC%9E%90%EA%B0%80-%EB%90%98%EA%B3%A0-%EC%8B%B6%EC%96%B4%EC%9A%94">&#xBC31;&#xC5D4;&#xB4DC; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xB418;&#xACE0; &#xC2F6;&#xC5B4;&#xC694;</h1>
<hr>
<figure class="kg-card kg-image-card"><img src="http://www.jjal.today/data/file/gallery/thumb-1028612757_0ukCawyA_9b6ca54203a9a4b45b63fa3a23bf18f2935a07c2_640x457.jpg" class="kg-image" alt loading="lazy"></figure>
<p></p>
<p>&#xC774;&#xB54C; &#xC988;&#xC74C;&#xBD80;&#xD130; &#xBC31;&#xC5D4;&#xB4DC; &#xAC1C;&#xBC1C;&#xC790;&#xAC00; &#xB418;&#xC5B4;&#xC57C;&#xACA0;&#xB2E4;&#xB294; &#xACB0;&#xC2EC;&#xC744; &#xD588;&#xB2E4;. &#xC65C; &#xBC31;&#xC5D4;&#xB4DC;&#xC778;&#xAC00; &#xD558;&#xBA74;.</p>
<p>&#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xB098;&#xB294; &#xD504;&#xB860;&#xD2B8;&#xC5D4;&#xB4DC;&#xAC00; &#xB354; &#xC798; &#xB9DE;&#xB294;&#xB2E4;&#xACE0; &#xB290;&#xB07C;&#xAE30;&#xB3C4; &#xD588;&#xB2E4;. &#xC774;&#xC804;&#xC5D0; &#xAE30;&#xD68D;&#xC790;&#xB85C;&#xC11C; &#xD588;&#xB358; &#xC77C;&#xB3C4; &#xC774;&#xC6A9;&#xC790;&#xC640; &#xC9C1;&#xC811; &#xC811;&#xD558;&#xBA70; &#xC0DD;&#xAE30;&#xB294; &#xC778;&#xD130;&#xC561;&#xC158;&#xC5D0; &#xB300;&#xD55C; &#xD48D;&#xBD80;&#xD55C; &#xC0C1;&#xC0C1;&#xC774; &#xD544;&#xC694;&#xD588;&#xC5C8;&#xB2E4;. &#xD504;&#xB860;&#xD2B8;&#xC5D4;&#xB4DC;&#xAC00; &#xB2E4;&#xB8E8;&#xB294; &#xBD80;&#xBD84;&#xC774; &#xC5F0;&#xC7A5;&#xC120;&#xC73C;&#xB85C; &#xC5EC;&#xACA8;&#xC838;&#xC11C; &#xC775;&#xC219;&#xD588;&#xC5C8;&#xB2E4;. &#xC544;&#xBB34;&#xB798;&#xB3C4; &#xCC98;&#xC74C; &#xC6F9; &#xAC1C;&#xBC1C;&#xC744; &#xC811;&#xD558;&#xB2E4;&#xBCF4;&#xB2C8; &#xAC00;&#xC7A5; &#xC790;&#xC8FC; &#xB9C8;&#xC8FC;&#xD558;&#xB294; &#xC6F9;&#xD398;&#xC774;&#xC9C0;&#xAC00; &#xD3B8;&#xD55C; &#xC774;&#xC720;&#xB3C4; &#xC788;&#xC5C8;&#xB2E4;.</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xACF5;&#xBD80;&#xB97C; &#xAC70;&#xB4ED;&#xD560;&#xC218;&#xB85D; &#xBCF4;&#xC5EC;&#xC9C0;&#xB294; &#xAC83;&#xC5D0; &#xAD6C;&#xC560;&#xBC1B;&#xC9C0; &#xC54A;&#xACE0; &#xC628;&#xC804;&#xD788; &#xBE44;&#xC988;&#xB2C8;&#xC2A4; &#xB85C;&#xC9C1;&#xC5D0; &#xC9D1;&#xC911;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC31;&#xC5D4;&#xB4DC;&#xC758; &#xB9E4;&#xB825;&#xC5D0; &#xD479; &#xBE60;&#xC84C;&#xB2E4;. &#xBCF5;&#xC7A1;&#xD55C; &#xBB38;&#xC81C;&#xB97C; &#xC798; &#xB098;&#xB204;&#xC5B4;&#xC11C; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xCC98;&#xB9AC;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC810;. &#xAD6C;&#xD604;&#xC744; &#xD558;&#xB294; &#xBC29;&#xBC95;&#xC774; &#xB9E4;&#xC6B0; &#xB2E4;&#xC591;&#xD55C;&#xB370; &#xADF8; &#xC911;&#xC5D0;&#xC11C; &#xC801;&#xC808;&#xD55C; &#xBC29;&#xBC95;&#xC744; &#xCC3E;&#xB294; &#xAC83;&#xC774; &#xD37C;&#xC990;&#xC744; &#xD478;&#xB294; &#xAC83;&#xCC98;&#xB7FC; &#xC990;&#xAC81;&#xAC8C; &#xB290;&#xAEF4;&#xC84C;&#xB2E4;. &#xBB34;&#xC5C7;&#xBCF4;&#xB2E4; &#xAD11;&#xBC94;&#xC704;&#xD55C; &#xBD80;&#xBD84;&#xC744; &#xC774;&#xD574;&#xD558;&#xACE0; &#xCEE8;&#xD2B8;&#xB864; &#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xC810;&#xB3C4; &#xC131;&#xACA9;&#xC5D0; &#xC798; &#xB9DE;&#xC558;&#xB2E4;.</p>
<p>&#xC9C0;&#xAE08;&#xB3C4; &#xC774; &#xACB0;&#xC815;&#xC740; &#xB0B4;&#xAC8C; &#xC798; &#xB9DE;&#xB294; &#xC120;&#xD0DD;&#xC744; &#xD588;&#xB2E4;&#xB294; &#xC0DD;&#xAC01;&#xC774; &#xB4E0;&#xB2E4;.</p>
<p></p>
<h1 id="%EA%B7%B8%EB%9F%B0%EB%8D%B0-%EC%99%9C-%EC%9D%B4%EB%A0%87%EA%B2%8C-%EC%95%8C%EC%95%84%EC%95%BC-%ED%95%98%EB%8A%94-%EA%B2%83%EC%9D%B4-%EB%A7%8E%EC%A3%A0">&#xADF8;&#xB7F0;&#xB370; &#xC65C; &#xC774;&#xB807;&#xAC8C; &#xC54C;&#xC544;&#xC57C; &#xD558;&#xB294; &#xAC83;&#xC774; &#xB9CE;&#xC8E0;?</h1>
<hr>
<blockquote>2022&#xB144; 8&#xC6D4;~12&#xC6D4; : CS &#xC2A4;&#xD130;&#xB514; : &#xD658;&#xBA78;&#xC758; &#xACC4;&#xACE1;</blockquote>
<p>&#xD55C;&#xD3B8; 8&#xC6D4;&#xBD80;&#xD130; &#xAD50;&#xC721;&#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xB9CC;&#xB09C; &#xB3D9;&#xB8CC;&#xC640; &#xD568;&#xAED8; &#xC2A4;&#xD130;&#xB514;&#xB97C; &#xC2DC;&#xC791;&#xD588;&#xB2E4;. &#xC9E7;&#xC740; &#xAD6D;&#xBE44;&#xAD50;&#xC721;&#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xB2E4;&#xB8E8;&#xC9C0; &#xC54A;&#xB294; &#xAC83;&#xB4E4;&#xC774; &#xB9CE;&#xB2E4;&#xBCF4;&#xB2C8; &#xADF8; &#xBD80;&#xC871;&#xD568;&#xC744; &#xCC44;&#xC6B0;&#xAE30; &#xC704;&#xD568;&#xC774;&#xC5C8;&#xB2E4;.</p>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Gartner_Hype_Cycle.svg/1920px-Gartner_Hype_Cycle.svg.png" class="kg-image" alt="undefined" loading="lazy"><figcaption><span style="white-space: pre-wrap;">&#xC2A4;&#xD130;&#xB514; &#xC774;&#xB984;&#xC774; &#xD658;&#xBA78;&#xC758; &#xACC4;&#xACE1;&#xC778; &#xC774;&#xC720;... &#x2B50;&#xFE0F; &#xD658;&#xBA78;&#xC758; &#xACC4;&#xACE1;&#xC5D0;&#xB77C;&#xB3C4; &#xBE60;&#xC84C;&#xC73C;&#xBA74; &#xC88B;&#xACA0;&#xB2E4;&#xB294; &#xC758;&#xBBF8;&#xC600;&#xB2E4;. &#xAC00;&#xD2B8;&#xB108;&#xC758; &#xD558;&#xC774;&#xD504; &#xC0AC;&#xC774;&#xD074;&#xC5D0;&#xC11C; Trough of Disillusionment &#xB2E8;&#xACC4;&#xB294; &quot;&#xD658;&#xBA78;&#xC758; &#xACC4;&#xACE1;&quot; &#xC774;&#xB77C;&#xACE0;&#xB3C4; &#xBD88;&#xB9B0;&#xB2E4;.</span> <span style="white-space: pre-wrap;">&#xC774;&#xBBF8;&#xC9C0; &#xCD9C;&#xCC98;&#xB294; &#xC704;&#xD0A4;&#xBC31;&#xACFC; </span><a href="https://ko.wikipedia.org/wiki/%ED%95%98%EC%9D%B4%ED%94%84_%EC%82%AC%EC%9D%B4%ED%81%B4?ref=localhost"><span style="white-space: pre-wrap;">https://ko.wikipedia.org/wiki/&#xD558;&#xC774;&#xD504;_&#xC0AC;&#xC774;&#xD074;</span></a></figcaption></figure>
<p></p>
<p>&#xCC98;&#xC74C;&#xC5D0;&#xB294; &#xC790;&#xB8CC;&#xAD6C;&#xC870;&#xC640; &#xC54C;&#xACE0;&#xB9AC;&#xC998;&#xC744; &#xACF5;&#xBD80;&#xD558;&#xBA70; &#xCF54;&#xB529;&#xD14C;&#xC2A4;&#xD2B8;&#xB97C; &#xB300;&#xBE44;&#xD574;&#xBCF4;&#xC790;&#xACE0; &#xC2DC;&#xC791;&#xD588;&#xC9C0;&#xB9CC; &#xCEF4;&#xD4E8;&#xD130; &#xACF5;&#xD559;&#xC744; &#xC804;&#xACF5;&#xD558;&#xC600;&#xB358; &#xB3D9;&#xB8CC;&#xC758; &#xB9AC;&#xB4DC;&#xC5D0; &#xB9DE;&#xCD94;&#xC5B4; &#xC601;&#xC5ED;&#xC744; CS&#xB85C; &#xB113;&#xD600; &#xACF5;&#xBD80;&#xD588;&#xACE0; 2&#xBA85;&#xC774;&#xB77C;&#xB294; &#xC801;&#xC740; &#xC778;&#xC6D0;&#xC5D0;&#xB3C4; &#xC8FC; 2&#xD68C;&#xC529; &#xCD1D; 45&#xD68C;&#xCC28;&#xB098; &#xC9C4;&#xD589;&#xD588;&#xC73C;&#xB2C8; &#xAF64; &#xAE38;&#xAC8C; &#xC774;&#xC5B4;&#xB098;&#xAC04; &#xAC83;&#xC774;&#xB2E4;. (<a href="https://github.com/new-pow/cs-study?ref=localhost" rel="noreferrer">repository</a>) &#xB9E4;&#xC8FC; &#xAC01;&#xAC01; 2~4&#xAC1C; &#xC8FC;&#xC81C;&#xB97C; &#xACF5;&#xBD80;&#xD574;&#xC640;&#xC11C; &#xD558;&#xB098;&#xC529; &#xC313;&#xC544;&#xAC14;&#xB2E4;.</p>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="http://localhost:2369/content/images/2023/09/image-2.png" class="kg-image" alt loading="lazy" width="2000" height="1065" srcset="http://localhost:2369/content/images/size/w600/2023/09/image-2.png 600w, http://localhost:2369/content/images/size/w1000/2023/09/image-2.png 1000w, http://localhost:2369/content/images/size/w1600/2023/09/image-2.png 1600w, http://localhost:2369/content/images/size/w2400/2023/09/image-2.png 2400w" sizes="(min-width: 720px) 720px"><figcaption><span style="white-space: pre-wrap;">&#xBAA8;&#xC784;&#xC77C;&#xC9C0; &#xACB8; &#xC790;&#xB8CC;&#xCC3D;&#xACE0;&#xC778; Notion &#xD398;&#xC774;&#xC9C0;</span></figcaption></figure>
<p>&#xC0AC;&#xC2E4; &#xC2A4;&#xC2A4;&#xB85C; &#xB290;&#xAF08;&#xB358; &#xD55C;&#xACC4;&#xB294; &#xBD84;&#xBA85;&#xD588;&#xB2E4;. &#xC6CC;&#xB099; &#xBE60;&#xB978; &#xC2DC;&#xAC04; &#xB0B4;&#xC5D0; &#xD558;&#xB358; &#xC2A4;&#xD130;&#xB514;&#xC774;&#xB2E4;&#xBCF4;&#xB2C8; &#xACF5;&#xBD80; &#xBC29;&#xC2DD;&#xB3C4; &#xB2E4;&#xB978; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xC815;&#xB9AC;&#xD574;&#xB454; &#xBE14;&#xB85C;&#xADF8;&#xC5D0; &#xB9CE;&#xC774; &#xC758;&#xC874;&#xD588;&#xACE0; &#xBF08;&#xBB38;&#xACFC; &#xCD9C;&#xC2E0;&#xC778; &#xB098;&#xC5D0;&#xAC8C;&#xB294; &#xAE30;&#xBCF8; &#xC9C0;&#xC2DD;&#xC774; &#xC5C6;&#xB294; &#xC0C1;&#xD0DC;&#xC5D0;&#xC11C; &#xACF5;&#xBD80;&#xD558;&#xB2E4;&#xBCF4;&#xB2C8; &#xC0AC;&#xC0C1;&#xB204;&#xAC01;&#xACFC; &#xAC19;&#xC740; &#xD55C;&#xACC4;&#xAC00; &#xC788;&#xC5C8;&#xB2E4;. &#xC2E4;&#xC81C;&#xB85C; &#xC774; &#xC9C0;&#xC2DD;&#xC774; &#xC5B4;&#xB514;&#xC5D0; &#xC801;&#xC6A9;&#xB418;&#xC5B4;&#xC788;&#xB294;&#xC9C0; &#xBAA8;&#xB974;&#xB2E4;&#xBCF4;&#xB2C8; &#xC804;&#xCCB4;&#xC801;&#xC778; &#xADF8;&#xB9BC;&#xBCF4;&#xB2E4;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xD0A4;&#xC6CC;&#xB4DC;&#xB97C; &#xC785;&#xC218;&#xD558;&#xACE0; &#xCD94;&#xC0C1;&#xC801;&#xC73C;&#xB85C; &#xC774;&#xD574;&#xD560; &#xC218; &#xBC16;&#xC5D0; &#xC5C6;&#xC5C8;&#xB358; &#xAC83;&#xC774;&#xB2E4;.</p>
<p>&#xADF8;&#xB7FC;&#xC5D0;&#xB3C4; &#xC774;&#xB7F0; &#xC804;&#xBB38; &#xC9C0;&#xC2DD;&#xC744; &#xC798; &#xC124;&#xBA85;&#xD574;&#xC904; &#xC218; &#xC788;&#xB294; &#xB204;&#xAD70;&#xAC00;&#xC640; &#xD568;&#xAED8; &#xACF5;&#xBD80;&#xD55C;&#xB2E4;&#xB294; &#xADF8; &#xC790;&#xCCB4;&#xB9CC;&#xC73C;&#xB85C; &#xB9CE;&#xC740; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xC5C8;&#xACE0;, &#xC758;&#xC9C0;&#xAC00; &#xB418;&#xC5C8;&#xB358; &#xC2A4;&#xD130;&#xB514;&#xC600;&#xB2E4;. &#xC774; &#xB54C; &#xCC98;&#xC74C; &#xBC30;&#xC6E0;&#xB358; &#xAC1C;&#xB150;&#xB4E4;&#xC774; &#xC774;&#xD6C4;&#xC5D0;&#xB3C4; &#xBC18;&#xBCF5;&#xC801;&#xC73C;&#xB85C; &#xB4F1;&#xC7A5;&#xD558;&#xBA74;&#xC11C; &#xC810;&#xC810; &#xC774;&#xD574;&#xB3C4;&#xAC00; &#xB192;&#xC544;&#xC838;&#xAC00;&#xB294; &#xAE30;&#xBC18;&#xC774; &#xB418;&#xC5C8;&#xB2E4;.</p>
<p></p>
<p></p>
<h1 id="%EC%BD%94%EB%93%9C%EC%8A%A4%EC%BF%BC%EB%93%9C-%ED%94%84%EB%A6%AC%EC%BD%94%EC%8A%A4">&#xCF54;&#xB4DC;&#xC2A4;&#xCFFC;&#xB4DC; &#xD504;&#xB9AC;&#xCF54;&#xC2A4;</h1>
<hr>
<blockquote>2022&#xB144; 11&#xC6D4; : &#xCF54;&#xB4DC;&#xC2A4;&#xCFFC;&#xB4DC; &#xB9C8;&#xC2A4;&#xD130;&#xC988; BE &#xD504;&#xB9AC;&#xCF54;&#xC2A4;</blockquote>
<p>&#xC0AC;&#xC2E4; &#xC774;&#xB54C;&#xB9CC;&#xD574;&#xB3C4; &#xBC14;&#xB85C; &#xCDE8;&#xC5C5;&#xC744; &#xD558;&#xACE0; &#xC2F6;&#xC5C8;&#xB2E4;. 5.5&#xAC1C;&#xC6D4;&#xB3D9;&#xC548; &#xC5F4;&#xC2EC;&#xD788; &#xD588;&#xC73C;&#xB2C8; &#xBC14;&#xB85C; &#xCDE8;&#xC5C5;&#xD560; &#xC218; &#xC788;&#xC9C0;&#xC54A;&#xC744;&#xAE4C;? &#xC0DD;&#xAC01;&#xC744; &#xD588;&#xB294;&#xB370;. &#xACF5;&#xBD80;&#xB97C; &#xD558;&#xBA74; &#xD560; &#xC218;&#xB85D; &#xB098;&#xC758; &#xBD80;&#xC871;&#xD55C; &#xC810;&#xB9CC; &#xD06C;&#xAC8C; &#xB290;&#xAEF4;&#xC84C;&#xB2E4;.</p>
<p>&#xADFC;&#xB370; &#xC774;&#xB54C;&#xCBE4; &#xCF54;&#xB4DC;&#xC2A4;&#xCFFC;&#xB4DC; &#xD504;&#xB9AC;&#xCF54;&#xC2A4;&#x200B;&#xB97C; &#xBAA8;&#xC9D1;&#xD55C;&#xB2E4;&#xB294; &#xC815;&#xBCF4;&#xB97C; &#xC785;&#xC218;&#xD588;&#xB2E4;. &#xC5B4;&#xCC28;&#xD53C; &#xCDE8;&#xC900;&#xD558;&#xB290;&#xB77C; &#xACF5;&#xBC31;&#xC77C; &#xD55C; &#xB2EC;. &#xAC00;&#xC774;&#xB4DC;&#xB77C;&#xC778;&#xC744; &#xBC1B;&#xC544; &#xB2E4;&#xC2DC; &#xBC29;&#xD5A5;&#xC131;&#xB3C4; &#xC7A1;&#xACE0; &#xB8E8;&#xD2F4;&#xD558;&#xAC8C; &#xACF5;&#xBD80;&#xC2DC;&#xAC04;&#xB3C4; &#xAC00;&#xC9C8;&#xACB8; &#xC2E0;&#xCCAD;&#xD588;&#xB2E4;. (&#xC5B4;&#xC9F8; &#xAD6D;&#xBE44;&#xAD50;&#xC721;&#xC744; &#xC2E0;&#xCCAD;&#xD588;&#xC744; &#xB54C;&#xB791; &#xAC19;&#xC740; &#xC758;&#xC2DD;&#xC758; &#xD750;&#xB984;..&#x1F914;?) &#xC774;&#xB54C;&#xB294; &#xBAB0;&#xB790;&#xB2E4; &#xC774; &#xACFC;&#xC815;&#xC774; &#xC5BC;&#xB9C8;&#xB098; &#xB9CE;&#xC740; &#xC5D0;&#xB108;&#xC9C0;&#xB97C; &#xD544;&#xC694;&#xB85C; &#xD558;&#xB294;&#xC9C0;...</p>
<p></p>
<ul><li>&#xB2F9;&#xC2DC; &#xC120;&#xD0DD;&#xC5D0; &#xD070; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xC5C8;&#xB358; &#xBE14;&#xB85C;&#xADF8; &#xAE00;</li></ul>
<figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://blogshine.tistory.com/459?ref=localhost"><div class="kg-bookmark-content"><div class="kg-bookmark-title">[&#xD6C4;&#xAE30;] &#xCF54;&#xB4DC;&#xC2A4;&#xCFFC;&#xB4DC; 2022 &#xB9C8;&#xC2A4;&#xD130;&#xC988; &#xCF54;&#xC2A4; &#xC218;&#xB8CC; (&#xC6F9; &#xBC31;&#xC5D4;&#xB4DC;)</div><div class="kg-bookmark-description">&#xD6C4; &#xAE38;&#xB2E4;&#xBA74; &#xAE38;&#xC5C8;&#xACE0;, &#xC9E7;&#xB2E4;&#xBA74; &#xC9E7;&#xC740; 6&#xAC1C;&#xC6D4;&#xC774; &#xAE08;&#xBC29; &#xC9C0;&#xB098;&#xAC00; &#xBC84;&#xB838;&#xB2E4;~ (&#xC704; &#xB2CC;&#xC790; &#xB85C;&#xACE0;&#xC758; &#xB9C8;&#xC9C0;&#xB9C9; &#xAE30;&#xC218; &#x314E;&#x314E; 2022 &#xACFC;&#xC815; &#xC911;&#xAC04;&#xC5D0; &#xB9E4;&#xB4ED;? &#xAC19;&#xC740; &#xAC78;&#xB85C; &#xBCC0;&#xACBD;&#xB410;&#xB294;&#xB370;... &#xAC1C;&#xC778;&#xC801;&#xC73C;&#xB85C; &#xBCC4;&#xB85C;.... &#xBB50;&#xB784;&#xAE4C;... &#xCF54;&#xB4DC;&#xC2A4;&#xCFFC;&#xB4DC; &#xBA64;&#xBC84;&#xB4E4;&#xC758; &#xC5B8;&#xB354;&#xB3C5;? &#xAC19;&#xC740; &#xB290;&#xB08C;&#xC774; &#xC0AC;&#xB77C;&#xC84C;&#xB2EC;&#xAE4C;?.... &#xB2CC;&#xC790; &#xB85C;&#xACE0; &#xC9F1;!!) 2022&#xB144; 1&#xC6D4; 1&#xC77C;. &#xBD80;&#xD2B8;&#xCEA0;&#xD504; &#xCF54;&#xB4DC;&#xC2A4;&#xCFFC;&#xB4DC;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xC5EC; &#xACF5;&#xBD80;&#xD558;&#xB358; &#xAC8C; &#xC5CA;&#xADF8;&#xC81C; &#xAC19;&#xC740;&#xB370;... &#xC5B4;&#xB290;&#xB367; 6&#xAC1C;&#xC6D4;&#xC774; &#xC9C0;&#xB098; &#xCF54;&#xB4DC;&#xC2A4;&#xCFFC;&#xB4DC; &#xACFC;&#xC815;&#xC740; 7&#xC6D4; 1&#xC77C;&#xBD80;&#xB85C; &#xB9C8;&#xBB34;&#xB9AC;&#xD588;&#xACE0; &#xC218;&#xB8CC;&#xC2DD;&#xB3C4; &#xD588;&#xB2E4;. &#xAC19;&#xC740; &#xBAA9;&#xD45C;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xD568;&#xAED8; &#xACF5;&#xBD80;&#xD560;&#xC218; &#xC788;&#xB294; &#xD300;&#xC6D0;&#xB4E4;&#xC744; &#xC5BB;&#xAC8C; &#xB418;&#xC5B4; &#xB108;&#xBB34; &#xD589;&#xBCF5;&#xD558;&#xB2E4; &#x314E;&#x314E;!! 1. &#xACFC;&#xC815; &#xC2DC;&#xC791; &#xC804;&#x2026;</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://t1.daumcdn.net/tistory_admin/top_v2/bi-tistory-favicon.svg" alt><span class="kg-bookmark-author">TISTORY</span><span class="kg-bookmark-publisher">&#xC0E4;&#xC544;&#xC774;&#xC778;</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://img1.daumcdn.net/thumb/R800x0/?scode=mtistory2&amp;fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FCsR3K%2FbtrGzYPo74U%2F894y9ZK47edBGcVi9TTzt1%2Fimg.png" alt></div></a></figure>
<figure class="kg-card kg-bookmark-card"><a class="kg-bookmark-container" href="https://jojoldu.tistory.com/505?ref=localhost"><div class="kg-bookmark-content"><div class="kg-bookmark-title">(2021) 1. &#xBE44;&#xC804;&#xACF5;&#xC790;&#xB85C; &#xC790;&#xBC14; &#xBC31;&#xC5D4;&#xB4DC; &#xAC1C;&#xBC1C;&#xC790; &#xC2DC;&#xC791;&#xD558;&#xAE30;</div><div class="kg-bookmark-description">&#xC800;&#xB294; &#xAC1C;&#xC778;&#xC801;&#xC73C;&#xB85C; &#xC774;&#xB7F0; &#xC774;&#xC57C;&#xAE30;&#xB97C; &#xD558;&#xB294; &#xAC83;&#xC744; &#xC369; &#xC88B;&#xC544;&#xD558;&#xC9C4; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC5B4;&#xB5A4; &#xC0AC;&#xB78C;&#xC758; &#xCEE4;&#xB9AC;&#xC5B4;&#xB098;, &#xADF8; &#xC0AC;&#xB78C;&#xC758; &#xD604;&#xC7AC; &#xC704;&#xCE58;&#xB294; &#xC6B4;&#xC774; &#xAD49;&#xC7A5;&#xD788; &#xD070; &#xC601;&#xD5A5;&#xC744; &#xB07C;&#xCCE4;&#xB2E4;&#xACE0; &#xBBFF;&#xAE30; &#xB54C;&#xBB38;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8; &#xC0AC;&#xB78C;&#xC774; &#xD588;&#xB358; &#xBC29;&#xC2DD;, &#xD588;&#xB358; &#xC120;&#xD0DD;&#xB4E4;&#xC744; &#xADF8;&#xB300;&#xB85C; &#xD55C;&#xB2E4;&#xACE0; &#xD574;&#xC11C; &#xB611;&#xAC19;&#xC740; &#xACB0;&#xACFC;&#xBB3C;&#xC774; &#xB098;&#xC628;&#xB2E4;&#xB294; &#xBCF4;&#xC7A5;&#xC774; &#xC5C6;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xB204;&#xAD70;&#xAC00;&#xC758; &#xC0C1;&#xD669;&#xC744; &#xB4E3;&#xACE0;, &#x201D;&#xC544;! &#xADF8;&#xB7F0; &#xC0C1;&#xD669;&#xC740; &#xC774;&#xB807;&#xAC8C; &#xC774;&#xB807;&#xAC8C; &#xD574;&#xBCF4;&#xC138;&#xC694;&#x201D; &#xB77C;&#xACE0; &#xC870;&#xC5B8;&#xD560; &#xC218;&#xAC00; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC77C;&#xB2E8;, &#xC800;&#xB3C4; &#xBAA8;&#xB4E0; &#xC120;&#xD0DD;&#xC774; &#xB2E4; &#xCC98;&#xC74C;&#xC774;&#xC5EC;&#xC11C;&#xC694;. &#xB9AC;&#xC14B;&#xBC84;&#xD2BC; &#xB204;&#xB974;&#xBA74;&#xC11C; 2~3&#xD68C;&#xCC28; &#xC0B4;&#xC544;&#xC628;&#xAC8C; &#xC544;&#xB2C8;&#xB77C;&#xB294;&#xAC70;&#xC8E0;. &#xAF43;&#xBCF4;&#xB2E4; &#xB204;&#xB098;&#xC5D0;&#xC11C; &#xC724;&#xC5EC;&#xC815; &#xC120;&#xC0DD;&#xB2D8;&#xACFC; &#xC774;&#xC2B9;&#xAE30;&#xB2D8;&#xC758; &#xC774;&#xC57C;&#xAE30;&#xB294; &#xAF2D; &#xD55C;&#xBC88; &#xBCF4;&#xC2DC;&#xBA74;&#x2026;</div><div class="kg-bookmark-metadata"><img class="kg-bookmark-icon" src="https://jojoldu.tistory.com/favicon.ico" alt><span class="kg-bookmark-author">TISTORY</span><span class="kg-bookmark-publisher">&#xD5A5;&#xB85C;</span></div></div><div class="kg-bookmark-thumbnail"><img src="https://img1.daumcdn.net/thumb/R800x0/?scode=mtistory2&amp;fname=https%3A%2F%2Ft1.daumcdn.net%2Fcfile%2Ftistory%2F997C214B5FFAFB131F" alt></div></a></figure>
<p></p>
<h2 id="%ED%94%84%EB%A6%AC%EC%BD%94%EC%8A%A4%EC%97%90%EC%84%9C-%EB%B0%B0%EC%9B%A0%EB%8D%98-%EA%B2%83%EB%93%A4">&#xD504;&#xB9AC;&#xCF54;&#xC2A4;&#xC5D0;&#xC11C; &#xBC30;&#xC6E0;&#xB358; &#xAC83;&#xB4E4;</h2>
<p>&#xD55C;&#xCC38; &#xCF54;&#xB85C;&#xB098;&#xB85C; &#xC778;&#xD55C; &#xAC70;&#xB9AC;&#xB450;&#xAE30; &#xC911;&#xC77C; &#xB54C;&#xB77C; &#xD504;&#xB9AC;&#xCF54;&#xC2A4;&#xB294; &#xC628;&#xB77C;&#xC778;&#xC73C;&#xB85C; &#xC9C4;&#xD589;&#xB418;&#xC5C8;&#xB2E4;. &#xD074;&#xB798;&#xC2A4;&#xC758; &#xAC1C;&#xB150;, JVM&#xC758; &#xBA54;&#xBAA8;&#xB9AC; &#xAD6C;&#xC870;, &#xD799; &#xBA54;&#xBAA8;&#xB9AC;&#xC640; &#xC2A4;&#xD0DD; &#xBA54;&#xBAA8;&#xB9AC;&#xBD80;&#xD130; &#xCC28;&#xADFC;&#xCC28;&#xADFC; &#xBC30;&#xC6B0;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xB294;&#xB370; &#xADF8;&#xB3D9;&#xC548; &#xAE30;&#xB2A5; &#xAD6C;&#xD604;&#xC744; &#xC911;&#xC2EC;&#xC73C;&#xB85C; &#xD559;&#xC2B5;&#xD574;&#xC654;&#xB358; &#xB098;&#xC5D0;&#xAC8C;&#xB294; &#xC2E0;&#xC138;&#xACC4;&#xC774;&#xC790; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC5B4;&#xB824;&#xC6B4; &#xB0B4;&#xC6A9;&#xB4E4;&#xC774;&#xC5C8;&#xB2E4;. &#xC774;&#xB7F0; &#xAC1C;&#xB150;&#xB4E4;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xD559;&#xC2B5;&#xD574;&#xC57C; &#xD560; &#xC9C0; &#xD559;&#xC2B5; &#xBC29;&#xBC95;&#xBD80;&#xD130; &#xC0C8;&#xB85C; &#xBC30;&#xC6CC;&#xC57C; &#xD558;&#xB294; &#xAC83;&#xB4E4;&#xC774; &#xB9CE;&#xC558;&#xB2E4; &#x1F979;</p>
<p>&#xB2E4;&#xC74C;&#xC774; &#xD504;&#xB9AC;&#xCF54;&#xC2A4; 4&#xC8FC; &#xACFC;&#xC815;&#xB3D9;&#xC548; &#xC5D0;&#xC11C; &#xC8FC;&#xB85C; &#xBC30;&#xC6E0;&#xB358; &#xAC83;&#xB4E4;&#xC774;&#xB2E4;.</p>
<ul><li>&#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5;&#xC758; &#xC8FC;&#xC694; &#xAC1C;&#xB150;&#xACFC; &#xAD6C;&#xD604;</li><li>&#xC8FC;&#xC694; &#xC790;&#xB8CC;&#xAD6C;&#xC870;&#xC758; &#xAC1C;&#xB150;&#xACFC; &#xAD6C;&#xD604;</li><li>&#xC790;&#xBC14;&#xC758; &#xCEEC;&#xB809;&#xC158; &#xD504;&#xB808;&#xC784;&#xC6CC;&#xD06C;</li></ul>
<p></p>
<p>&#xD2B9;&#xD788; &#xC9C0;&#xAE08;&#xB3C4; &#xC2EC;&#xCDE8;&#xD574;&#xC788;&#xB294; &#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5;&#xC5D0; &#xB300;&#xD55C; &#xC9DD;&#xC0AC;&#xB791;&#xC774; &#xC774;&#xB54C;&#xBD80;&#xD130; &#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xB418;&#xC5C8;&#xB358; &#xAC83; &#xAC19;&#xB2E4; ... &#xD558;&#xD558;</p>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="http://localhost:2369/content/images/2023/09/image-3.png" class="kg-image" alt loading="lazy" width="1224" height="1136" srcset="http://localhost:2369/content/images/size/w600/2023/09/image-3.png 600w, http://localhost:2369/content/images/size/w1000/2023/09/image-3.png 1000w, http://localhost:2369/content/images/2023/09/image-3.png 1224w" sizes="(min-width: 720px) 720px"><figcaption><span style="white-space: pre-wrap;">&#xCF54;&#xB4DC;&#xC2A4;&#xCFFC;&#xB4DC; &#xD504;&#xB9AC;&#xCF54;&#xC2A4; 1&#xC8FC;&#xCC28; &#xD68C;&#xACE0;</span></figcaption></figure>
<p></p>
<p>&#xB3D9;&#xC2DC;&#xC5D0; &#xC704;&#xC758; &#xB0B4;&#xC6A9;&#xACFC; &#xD568;&#xAED8; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xC5C8;&#xB358; &#xAC83;&#xC740; &#xD559;&#xC2B5;&#xD558;&#xB294; &#xBC29;&#xD5A5;&#xACFC; &#xC2B5;&#xAD00;&#xC774;&#xB2E4;. &#xC5B4;&#xB5A4; &#xAC83;&#xC744; &#xB354; &#xC798; &#xC54C;&#xC544;&#xC57C;&#xD558;&#xB294;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xD559;&#xC2B5; &#xBC29;&#xD5A5; &#xAC00;&#xC774;&#xB4DC;&#xB77C;&#xC778;&#xC774; &#xC788;&#xC5C8;&#xACE0; &#xC624;&#xD6C4;&#xBD80;&#xD130; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xCF54;&#xC5B4;&#xD0C0;&#xC784;&#xC5D0; &#xB3D9;&#xB8CC;&#xB4E4;&#xACFC; &#xD559;&#xC2B5;&#xD55C; &#xB0B4;&#xC6A9;&#xC744; &#xACF5;&#xC720;&#xD558;&#xB294; &#xAC83;&#xB3C4; &#xBC29;&#xD5A5;&#xC744; &#xC7A1;&#xB294;&#xB370; &#xD070; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xC5C8;&#xB2E4;.</p>
<p></p>
<p>&#xCF54;&#xB4DC;&#xC2A4;&#xCFFC;&#xB4DC;&#xB294; &#xC218;&#xAC15;&#xC0DD;&#xB4E4;&#xC740; &#xC790;&#xC720;&#xB86D;&#xAC8C; &#xBC29;&#xBAA9;&#xD55C; &#xCC44;&#xB85C; &#xC2A4;&#xC2A4;&#xB85C; &#xC131;&#xC7A5;&#xD558;&#xAC8C; &#xD55C;&#xB2E4;.</p>
<p>&#xC774;&#xAC8C; &#xC774;&#xC804; &#xAD6D;&#xBE44;&#xAD50;&#xC721;&#xC744; &#xB4E4;&#xC5C8;&#xC744; &#xB54C;&#xC640; &#xAC00;&#xC7A5; &#xD070; &#xCC28;&#xC774;&#xC810;&#xC774;&#xC5C8;&#xB2E4;. &#xD558;&#xB8E8; &#xCF54;&#xC5B4;&#xD0C0;&#xC784;&#xC774; 8&#xC2DC;&#xAC04;&#xC774;&#xB77C;&#xACE0; &#xD574;&#xB3C4; &#xC9DC;&#xC5EC;&#xC9C4; &#xC2A4;&#xCF00;&#xC904;&#xC740; &#xBCC4;&#xB85C; &#xC5C6;&#xACE0; &#xCF54;&#xC5B4;&#xD0C0;&#xC784;&#xB3D9;&#xC548; &#xC790;&#xC720;&#xB86D;&#xAC8C; &#xACF5;&#xBD80;&#xD558;&#xACE0;, &#xD544;&#xC694;&#xD560; &#xB54C; &#xB3D9;&#xB8CC;&#xB4E4;&#xACFC; &#xB300;&#xD654;&#xD558;&#xBA70; &#xBD80;&#xC871;&#xD55C; &#xBD80;&#xBD84;&#xC744; &#xCC44;&#xC6CC;&#xB098;&#xAC14;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774; &#xC2A4;&#xD0C0;&#xC77C;&#xC774; &#xB098;&#xC5D0;&#xAC8C; &#xAF64; &#xC798;&#xB9DE;&#xC558;&#xB2E4;.</p>
<p></p>
<h2 id="%EA%B7%B8%EB%A6%AC%EA%B3%A0-%EB%8D%94-%EA%B3%B5%EB%B6%80%EB%A5%BC-%ED%95%98%EA%B8%B0%EB%A1%9C-%ED%96%88%EB%8B%A4">&#xADF8;&#xB9AC;&#xACE0; &#xB354; &#xACF5;&#xBD80;&#xB97C; &#xD558;&#xAE30;&#xB85C; &#xD588;&#xB2E4;.</h2>
<p>&#xC5B4;&#xB5A4; &#xC601;&#xC5ED;&#xC774;&#xB4E0; &#xC774;&#xB7F0; &#xC5B4;&#xB824;&#xC6C0;&#xC774; &#xB530;&#xB97C;&#xD14C;&#xC9C0;&#xB9CC;, &#xAC1C;&#xBC1C;&#xC744; &#xBC30;&#xC6B0;&#xBA74;&#xC11C; &#xAC00;&#xC7A5; &#xAD34;&#xB85C;&#xC6B4; &#xC810;&#xC740; &#xBD84;&#xBA85;&#xD788; &#xB098;&#xB294; &#xACF5;&#xBD80;&#xB97C; &#xD558;&#xACE0; &#xC788;&#xB2E4;&#xACE0;&#xB294; &#xD558;&#xB294;&#xB370; &#xBAA8;&#xB974;&#xB294; &#xAC83;&#xC774; &#xC9C0;&#xC218;&#xC801;&#xC73C;&#xB85C; &#xC99D;&#xAC00;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xC2EC;&#xC9C0;&#xC5B4; &#xC774;&#xBBF8; &#xACF5;&#xBD80;&#xB97C; &#xD55C; &#xB0B4;&#xC6A9;&#xB3C4; &#xC0AC;&#xC2E4; &#xC815;&#xD655;&#xD558;&#xAC8C; &#xC54C;&#xACE0; &#xAE30;&#xC5B5;&#xD558;&#xAE30;&#xB780; &#xC5B4;&#xB824;&#xC6E0;&#xB2E4;.</p>
<p>&#xADF8;&#xB7F0;&#xB370; &#xC544;&#xC774;&#xB7EC;&#xB2C8;&#xD558;&#xAC8C;&#xB3C4; &#xB3D9;&#xC2DC;&#xC5D0; &#xC774;&#xAC83;&#xC774; &#xAC00;&#xC7A5; &#xC990;&#xAC70;&#xC6B4; &#xC810;&#xC774;&#xAE30;&#xB3C4; &#xD558;&#xB2E4;. &#xB0B4;&#xAC00; &#xBAA8;&#xB974;&#xB294; &#xAC83;&#xC774; &#xACC4;&#xC18D; &#xC874;&#xC7AC;&#xD558;&#xACE0; &#xAC1C;&#xB150;&#xACFC; &#xAE30;&#xC220;&#xC758; &#xAF2C;&#xB9AC;&#xB97C; &#xBB3C;&#xBA70; &#xD559;&#xC2B5;&#xD558;&#xACE0;, &#xC774;&#xC804;&#xC5D0; &#xD559;&#xC2B5;&#xD588;&#xB358; &#xAC83;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC9C1;&#xC811; &#xAD6C;&#xD604;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC774; &#xC0C8;&#xB85C;&#xC6B4; &#xC138;&#xACC4;&#xB97C; &#xD0D0;&#xD5D8;&#xD558;&#xB294; &#xAC83; &#xAC19;&#xC558;&#xB2E4;.</p>
<p></p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xB0B4;&#xAC8C; &#xD544;&#xC694;&#xD588;&#xB358; &#xAC83;&#xC740; &#xC774; &#xD0D0;&#xD5D8;&#xC744; &#xC5B4;&#xB5BB;&#xAC8C; &#xC2A4;&#xC2A4;&#xB85C; &#xD560; &#xC218; &#xC788;&#xB290;&#xB0D0;&#xC5D0; &#xB300;&#xD55C; &#xC5F0;&#xC2B5;&#xC774;&#xC5C8;&#xB358; &#xAC83; &#xAC19;&#xB2E4;. &#xB0B4;&#xAC8C;&#xB294; &#xADF8; &#xC5F0;&#xC2B5;&#xC2DC;&#xAC04;&#xC774; &#xB354; &#xB9CE;&#xC774; &#xD544;&#xC694;&#xD588;&#xACE0; &#xB2F9;&#xC2DC;&#xC5D0; &#xBC14;&#xB85C; &#xCDE8;&#xC5C5;&#xD558;&#xAE30;&#xBCF4;&#xB2E4;&#xB294; &#xB354; &#xACF5;&#xBD80;&#xD558;&#xACE0; &#xC2F6;&#xC5C8;&#xB2E4;. &#xC2A4;&#xC2A4;&#xB85C; &#xBD80;&#xC871;&#xD568;&#xC744; &#xB9CE;&#xC774; &#xB290;&#xAF08;&#xB2E4;.</p>
<p>&#xADF8;&#xB798;&#xC11C; &#xACE0;&#xBBFC;&#xACE0;&#xBBFC;&#xD558;&#xB2E4; &#xCF54;&#xB4DC;&#xC2A4;&#xCFFC;&#xB4DC; &#xB9C8;&#xC2A4;&#xD130;&#xC988; &#xBCF8;&#xACFC;&#xC815;&#xAE4C;&#xC9C0; &#xB4E3;&#xAE30;&#xB85C; &#xACB0;&#xC815;&#xD558;&#xACE0; &#xC785;&#xACFC;&#xC2DC;&#xD5D8;&#xC744; &#xBCF4;&#xC558;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC6B4;&#xC774; &#xC88B;&#xAC8C; &#xB9C8;&#xC2A4;&#xD130;&#xC988; &#xCF54;&#xC2A4;(&#xC624;&#xD504;&#xB77C;&#xC778; &#xACFC;&#xC815;)&#xC5D0; &#xD569;&#xACA9;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB2E4;.</p>
<p></p>
<figure class="kg-card kg-code-card"><pre><code>Sun, Earth, Moon
&#xB0A0;&#xC9DC;&#xB97C; &#xC785;&#xB825;&#xD558;&#xC138;&#xC694;.
1991&#xB144; 7&#xC6D4; 8&#xC77C;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFE61;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0B;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#x3164;&#xFF0E;&#xFF0E;&#x3164;&#x3164;&#xFF0B;&#xFF0E;&#xFF0E;&#x3164;&#x3164;&#xFF0B;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0A;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#x3164;&#x3164;&#xFF0A;&#x3164;&#xFF0B;&#x3164;&#xFF0E;&#x3164;&#xFF0B;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0B;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#xFF0B;&#x3164;&#xFF0E;&#xFF0E;&#x3164;&#xFF0B;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#xFF0E;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0B;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#xFF0B;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#xFF0E;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0B;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0B;&#xFF0E;&#x3164;&#xFF0B;&#x3164;&#x3164;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#xFF0B;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0B;&#xFF0E;&#xFF0E;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&quot;You Are Here!&quot;&#xFF0E;&#x3164;&#xFF0E;&#xFF0A;&#xFF0E;&#x3164;&#x3164;&#xFF0B;&#x3164;&#x3164;&#xFF0B;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164; |&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0B;&#x3164;&#xFF0E;&#xFF0B;&#x3164;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x309C;&#x3164;\|/&#x3164;&#xFF0B;&#x3164;&#xFF0E;&#xFF0B;&#xFF0E;&#xFF0A;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x1F31E;&#x3164;&#x3164;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#x3164;&#x3164;&#x3164;V&#x3164;&#x3164;&#xFF0B;&#x3164;&#xFF0E;&#x3164;&#xFF0B;&#x3164;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#xFF0A;&#x3164;&#x3164;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0B;&#x3164;&#x3164;&#x3164;&#x1F30D;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0B;&#xFF0B;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0A;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0B;&#x3164;&#x3164;&#x3164;&#xFF0B;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#xFF0E;&#xFF0E;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0B;&#x3164;&#xFF0B;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#x3164;&#xFF0E;&#xFF0B;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0B;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0B;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0B;&#xFF0B;&#xFF0E;&#x3164;&#xFF0E;&#xFF0E;&#xFF0A;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;
&#x3164;&#xFF0B;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0B;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#x1F313;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0A;&#x3164;&#x3164;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#xFF0B;&#xFF0E;&#xFF0E;&#xFF0B;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#xFF0E;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#xFF0B;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0B;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;
&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0B;&#xFF0B;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#xFF0E;&#xFF0A;&#x3164;&#x3164;&#x3164;&#xFF0A;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;
&#xFF0B;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#xFF0E;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#xFF0B;&#xFF0E;&#x3164;&#xFF0E;&#x3164;&#x3164;&#xFF0B;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#xFF0E;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;&#x3164;
</code></pre><figcaption><p><span style="white-space: pre-wrap;">&#xC785;&#xACFC;&#xC2DC;&#xD5D8;&#xC774;&#xC5C8;&#xB358; &apos;&#xBA4B;&#xC788;&#xAC8C;&apos; &#xCD9C;&#xB825;&#xD55C; &#xC6B0;&#xC8FC;. &#xC785;&#xACFC;&#xC2DC;&#xD5D8;&#xC774; &#xB0B4; &#xCDE8;&#xD5A5; &#xC800;&#xACA9;&#xC774;&#xC5B4;&#xC11C; &#xC5C4;&#xCCAD;&#xC5C4;&#xCCAD; &#xC990;&#xAC70;&#xC6E0;&#xB358; &#xAE30;&#xC5B5;&#xC774; &#xB09C;&#xB2E4;. &#xD654;&#xBA74;&#xC5D0;&#xB294; &#xC5C6;&#xC9C0;&#xB9CC; &#xD589;&#xC131;&#xACFC; &#xB85C;&#xCF13; &#xB4F1; &#xC694;&#xC18C;&#xAC00; &#xBA87; &#xAC1C; &#xB354; &#xC788;&#xB2E4;.</span></p></figcaption></figure>
<figure class="kg-card kg-code-card"><pre><code>private void putMoon(String[][] space, int x, int y, double angle){
    double radian=Math.toRadians(angle);
    float nx = Math.round(x+(space.length/10*Math.cos(radian)));
    float ny = Math.round(y+(space.length/10*Math.sin(radian)));
    
    if(space.length/2&lt;nx &amp;&amp; nx&lt;x){       // &#xB2EC;&#xC774; &#xC9C0;&#xAD6C;&#xC640; &#xD0DC;&#xC591; &#xC0AC;&#xC774;&#xC5D0; &#xC788;&#xB2E4;&#xBA74; &#xBC18;&#xB2EC;&#xB85C; &#xC800;&#xC7A5;
        space[ny][nx]=&quot;&#x1F317;&quot;;
    }else if(x&lt;nx &amp;&amp;nx&lt;space.length/2){
        space[ny][nx]=&quot;&#x1F313;&quot;;
    }else{
        space[ny][nx]=&quot;&#x1F31D;&quot;;
    }
}</code></pre><figcaption><p><span style="white-space: pre-wrap;">&#xC785;&#xACFC;&#xC2DC;&#xD5D8;&#xC5D0;&#xC11C; &#xC37C;&#xB358; &#xCF54;&#xB4DC; &#xC911; &#xAC00;&#xC7A5; &#xB9D8;&#xC5D0; &#xB4DC;&#xB294; &#xCF54;&#xB4DC;. &#xB2EC; &#xC704;&#xCE58;&#xB97C; &#xD45C;&#xC2DC;&#xD560; &#xB54C; &#xD0DC;&#xC591;&#xACFC; &#xC9C0;&#xAD6C;&#xC640;&#xC758; &#xAC70;&#xB9AC;&#xB97C; &#xACE0;&#xBBFC;&#xD574;&#xC11C; &#xBC18;&#xB2EC;&#xC744; &#xCD9C;&#xB825;&#xD558;&#xB294; &#xAC83;&#xB3C4; &#xB123;&#xC5C8;&#xB2E4;.</span></p></figcaption></figure>
<p></p>
<p></p>]]></content:encoded></item><item><title><![CDATA[2022년 회고 (2) 풀스택 국비교육 수강기]]></title><description><![CDATA[<ul><li>&#xCF00;&#xCF00;&#xBB35;&#xC740; &#xC9C0;&#xB09C;&#xAE00; &#x1F447;<ul><li><a href="https://new-pow.tistory.com/23?ref=localhost">2023.02.01 - [&#x1F4AC;/&#xD68C;&#xACE0;] - 2022&#xB144; &#xD68C;&#xACE0; (1) &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xAE30;&#xD68D;&#xC790;&#xAC00; &#xAC1C;&#xBC1C;&#xC790;&#xB97C; &#xAFC8;&#xAFB8;&#xAC8C;&#xB41C; &#xC774;&#xC57C;&#xAE30;</a></li></ul></li></ul>
<h1 id="%EA%B5%AD%EB%B9%84-%EA%B5%90%EC%9C%A1-%EA%B3%BC%EC%A0%95%EC%9D%84-%EB%93%A3%EA%B8%B0%EB%A1%9C-%ED%95%9C%EB%8B%A4">&#xAD6D;&#xBE44; &#xAD50;&#xC721; &#xACFC;&#xC815;&#xC744; &#xB4E3;&#xAE30;&#xB85C;</h1>]]></description><link>http://localhost:2369/2022-log-2/</link><guid isPermaLink="false">64e5516b749ee079fb78d2ab</guid><category><![CDATA[Log]]></category><category><![CDATA[Posts]]></category><category><![CDATA[2022]]></category><dc:creator><![CDATA[saehim lee]]></dc:creator><pubDate>Sun, 15 Jan 2023 00:23:00 GMT</pubDate><content:encoded><![CDATA[<ul><li>&#xCF00;&#xCF00;&#xBB35;&#xC740; &#xC9C0;&#xB09C;&#xAE00; &#x1F447;<ul><li><a href="https://new-pow.tistory.com/23?ref=localhost">2023.02.01 - [&#x1F4AC;/&#xD68C;&#xACE0;] - 2022&#xB144; &#xD68C;&#xACE0; (1) &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xAE30;&#xD68D;&#xC790;&#xAC00; &#xAC1C;&#xBC1C;&#xC790;&#xB97C; &#xAFC8;&#xAFB8;&#xAC8C;&#xB41C; &#xC774;&#xC57C;&#xAE30;</a></li></ul></li></ul>
<h1 id="%EA%B5%AD%EB%B9%84-%EA%B5%90%EC%9C%A1-%EA%B3%BC%EC%A0%95%EC%9D%84-%EB%93%A3%EA%B8%B0%EB%A1%9C-%ED%95%9C%EB%8B%A4">&#xAD6D;&#xBE44; &#xAD50;&#xC721; &#xACFC;&#xC815;&#xC744; &#xB4E3;&#xAE30;&#xB85C; &#xD55C;&#xB2E4;.</h1>
<blockquote>2022&#xB144; 6&#xC6D4;~10&#xC6D4; : &#xAD6D;&#xBE44;&#xAD50;&#xC721; &#xC218;&#xAC15;</blockquote>
<p>&#xC0AC;&#xC2E4; &#xC9C0;&#xAE08; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xBA74; &#xD55C;&#xC5C6;&#xC774; &#xAC00;&#xBCBC;&#xC6B4; &#xC120;&#xD0DD;&#xC774;&#xC5C8;&#xB2E4;.</p>
<p>&#xC5B4;&#xCC28;&#xD53C; 1&#xB144;&#xC815;&#xB3C4; &#xC26C;&#xAE30;&#xB85C; &#xD55C;&#xAC70;, &#xB3C8;&#xB3C4; &#xB354; &#xB4E4;&#xC9C0; &#xC54A;&#xACA0;&#xB2E4; &#xC8FC;&#xB9D0;&#xC5D0;&#xB294; &#xC9C0;&#xC778;&#xC758; &#xCE74;&#xD398;&#xC5D0;&#xC11C; &#xACC4;&#xC18D; &#xC54C;&#xBC14;&#xB97C; &#xD558;&#xACE0; &#xD3C9;&#xC77C;&#xC5D0;&#xB294; 9&#xC2DC;&#xBD80;&#xD130; 6&#xC2DC;&#xAE4C;&#xC9C0; &#xD480;&#xC2A4;&#xD0DD; &#xAD6D;&#xBE44;&#xAD50;&#xC721;&#xACFC;&#xC815;&#xC744; &#xB4E3;&#xAE30;&#xB85C; &#xD55C; &#xC120;&#xD0DD;&#xB9D0;&#xC774;&#xB2E4;.</p>
<p>&#xC120;&#xD0DD;&#xC758; &#xAE30;&#xC900;&#xC740; &#xC544;&#xC8FC; &#xAC04;&#xB2E8;&#xD588;&#xB2E4;.</p>
<ol><li>&#xC2DC;&#xC791;&#xD558;&#xAE30;&#xC5D0; &#xBD80;&#xB2F4;&#xC774; &#xC5C6;&#xC744; &#xAC83;, &#xACE7; &#xC5B8;&#xC81C;&#xB4E0; &#xB2E4;&#xC2DC; &#xB3CC;&#xC544;&#xAC08; &#xC218; &#xC788;&#xC744; &#xAC83;</li><li>&#xAD50;&#xC721;&#xACFC;&#xC815;&#xC740; &#xCDE8;&#xC5C5;&#xC744; &#xD558;&#xAE30; &#xC720;&#xB9AC;&#xD560; &#xAC83; (&#xBC94;&#xC6A9;&#xC801;&#xC77C; &#xAC83;)</li></ol>
<p>&#xC5EC;&#xAE30;&#xB2E4;&#xAC00; &#xAC1C;&#xBC1C;&#xC790;&#xC778; &#xCE5C;&#xAD6C;&#xAC00; &#x201C;&#xB108;&#xB294; &#xD504;&#xB860;&#xD2B8;&#xC5D4;&#xB4DC;, &#xBC31;&#xC5D4;&#xB4DC; &#xAC1C;&#xB150;&#xB3C4; &#xBAA8;&#xB974;&#xB2C8;&#xAE4C; &#xC77C;&#xB2E8; &#xB2E4; &#xB4E4;&#xC5B4;&#xBCF4;&#xACE0; &#xB098;&#xC911;&#xC5D0; &#xC2EC;&#xD654;&#xD574;&#xC11C; &#xACF5;&#xBD80;&#xD574;&#xBD10;&#x201D; &#xB77C;&#xACE0; &#xC870;&#xC5B8;&#xD574;&#xC900; &#xAC83;&#xC744; &#xD1A0;&#xB300;&#xB85C; &#xACB0;&#xC815;&#xD55C; &#xAC83;&#xC774; &#xBA40;&#xD2F0;&#xCEA0;&#xD37C;&#xC2A4;&#xC5D0;&#xC11C; &#xC9C4;&#xD589;&#xD558;&#xB294; <code>AI &#xD50C;&#xB7AB;&#xD3FC;&#xC744; &#xD65C;&#xC6A9;&#xD55C; &#xC6F9; &#xC11C;&#xBE44;&#xC2A4; &#xAC1C;&#xBC1C;</code> &#xACFC;&#xC815;&#xC744; &#xB4E4;&#xC5C8;&#xB2E4;. (&#xC9C0;&#xAE08; &#xBE44;&#xC2B7;&#xD55C; &#xACFC;&#xC815;&#xC740; &#xC774;&#xAC74;&#xAC70; &#xAC19;&#xB2E4;. <a href="https://boottent.sayun.studio/camps/multicampus-aiweb_20230106233956?ref=localhost">&#xB9C1;&#xD06C;</a>)</p>
<p>&#xC2E4;&#xC81C;&#xB85C; &#xBC30;&#xC6E0;&#xB358; &#xAC83;&#xC740; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xB2E4;.</p>
<h3 id="%EC%BB%A4%EB%A6%AC%ED%81%98%EB%9F%BC">&#xCEE4;&#xB9AC;&#xD058;&#xB7FC;</h3>
<ul><li>Java 3&#xC8FC;</li><li>MySQL &#xAE30;&#xBCF8; &#xCFFC;&#xB9AC; &#xBB38;&#xBC95;&#xACFC; Java&#xC640; &#xC5F0;&#xB3D9; 1&#xC8FC;</li><li>HTML5, CSS, JavaScript, jQuery 2&#xC8FC;</li><li>Sevlet &amp; JSP, Spring, Sptring boot &#xC640; MyBatis 3&#xC8FC;</li><li>Jenkins, Naver Cloud Platform&#xC744; &#xC774;&#xC6A9;&#xD55C; &#xBC30;&#xD3EC;</li></ul>
<h3 id="%ED%94%84%EB%A1%9C%EC%A0%9D%ED%8A%B8">&#xD504;&#xB85C;&#xC81D;&#xD2B8;</h3>
<ul><li>&#xC790;&#xC728; &#xAE30;&#xD68D; &#xD504;&#xB85C;&#xC81D;&#xD2B8; 2&#xC8FC;<ul><li>&#xBC30;&#xD3EC;&#xD558;&#xC9C0; &#xC54A;&#xC74C;.</li></ul></li><li>&#xC790;&#xC728; &#xAE30;&#xD68D; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xBC0F; &#xBC30;&#xD3EC; &#xC57D; 8&#xC8FC;<ul><li>&#xBC30;&#xD3EC; &#xD50C;&#xB7AB;&#xD3FC; : Naver cloud platform</li></ul></li></ul>
<h3 id="%EA%B8%B0%ED%83%80-%ED%8A%B9%EA%B0%95">&#xAE30;&#xD0C0; &#xD2B9;&#xAC15;</h3>
<ul><ul><li>Git, Github &#xC0AC;&#xC6A9; 1&#xD68C;</li><li>Notion &#xC0AC;&#xC6A9; 1&#xD68C;</li><li>React &#xCCB4;&#xD5D8; 3&#xD68C;</li><li>Oracle DB &#xC0AC;&#xC6A9;&#xD574;&#xBCF4;&#xAE30; 1&#xD68C;</li><li>&#xAE30;&#xD0C0; &#xCDE8;&#xC5C5; &#xAD00;&#xB828; &#xD2B9;&#xAC15;&#x2026;.</li></ul></ul>
<p></p>
<p>AI &#xC11C;&#xBE44;&#xC2A4;&#xC774;&#xACE0; &#xD50C;&#xB7AB;&#xD3FC;&#xC774;&#xACE0; &#xBB50;&#xACE0; &#xC0AC;&#xC2E4; &#xADF8;&#xB54C; &#xC81C;&#xB300;&#xB85C; &#xC54C;&#xC9C0; &#xBABB;&#xD588;&#xACE0;, &#xB098;&#xC911;&#xC5D0; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xB2C8; Open API &#xC911;&#xC5D0;&#xC11C; AI &#xAE30;&#xC220;&#xC744; &#xC811;&#xBAA9;&#xD55C; API&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xBCF8;&#xB2E4;&#xB294; &#xB73B;&#xC774;&#xC5C8;&#xB2E4; &#x1F440;&#xA0;&#xC774;&#xB54C; API&#xB77C;&#xB294; &#xAC1C;&#xB150;&#xC774; &#xC5C6;&#xC5C8;&#xB294;&#xB370;..&#x1F623; &#xC9C0;&#xAE08; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xB2C8; &#xAD6C;&#xD604;&#xC744; &#xD55C; &#xAC83; &#xC790;&#xCCB4;&#xAC00; &#xC815;&#xB9D0; &#xB300;&#xB2E8;&#xD588;&#xB2E4;.</p>
<p>&#xC218;&#xC5C5;&#xC740; &#xD55C;&#xCC38; &#xCF54;&#xB85C;&#xB098;&#xAC00; &#xC9C4;&#xD589;&#xC911;&#xC774;&#xB358; &#xB54C;&#xB77C; &#xB300;&#xBD80;&#xBD84; &#xBE44;&#xB300;&#xBA74;&#xC73C;&#xB85C; &#xC774;&#xB8E8;&#xC5B4;&#xC84C;&#xB2E4;.</p>
<p>&#xC815;&#xADDC; &#xC218;&#xC5C5;&#xC2DC;&#xAC04;&#xC740; 8&#xC2DC;&#xAC04;&#xB3D9;&#xC548; &#xACC4;&#xC18D; &#xC218;&#xC5C5;&#xACFC; &#xC2E4;&#xC2B5; &#xCF54;&#xB4DC; &#xC791;&#xC131;&#xC744; &#xD588;&#xACE0;, &#xBAB0;&#xC785;&#xD574;&#xC11C; &#xC774; &#xC2DC;&#xAC04;&#xC744; &#xBCF4;&#xB0B4;&#xACE0; &#xB098;&#xBA74; &#xB098;&#xBA38;&#xC9C0; &#xC2DC;&#xAC04;&#xC740; &#xC9C0;&#xCCD0;&#xC11C; &#xC4F0;&#xB7EC;&#xC838; &#xC790;&#xAE30; &#xC77C;&#xC464;&#xC600;&#xB2E4;.</p>
<p>&#xC774;&#xB807;&#xAC8C; &#xC57D; 3&#xAC1C;&#xC6D4;&#xB3D9;&#xC548; &#xC704;&#xC758; &#xAE30;&#xC220;&#xC744; &#xBAA8;&#xB450; &#xBC30;&#xC6B0;&#xACE0; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; 2.5&#xAC1C;&#xC6D4;&#xAC04; &#xD558;&#xB824;&#xB2E4;&#xBCF4;&#xB2C8; &#xC815;&#xB9D0; &#xD544;&#xC218;&#xC801;&#xC778; &#xAC83;&#xB9CC; &#xC18D;&#xC131;&#xC73C;&#xB85C; &#xBC30;&#xC6B8; &#xC218; &#xC788;&#xC5C8;&#xB2E4;. &#xC774;&#xB54C; &#xB2F9;&#xC2DC;&#xC758; &#xAE30;&#xB85D;&#xB4E4;&#xC744; &#xC880; &#xB4E4;&#xCD94;&#xC5B4; &#xAC01; &#xAE30;&#xC220;&#xC5D0; &#xB300;&#xD55C; &#xC774;&#xD574;&#xB3C4;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xB2C8; &#xAF64; &#xC7AC;&#xBC0C;&#xB2E4;.</p>
<ul><li>&#xC790;&#xBC14; &#xAD50;&#xC721;&#xACFC;&#xC815; &#xC911;, &#xBCC0;&#xC218;&#xB098; &#xC5F0;&#xC0B0;&#xC790;, &#xC870;&#xAC74;&#xBB38;&#xACFC; &#xBC18;&#xBCF5;&#xBB38;&#xC740; &#xC0AC;&#xC2E4; &#xD568;&#xC218;&#xB098; &#xB2E4;&#xB984;&#xC5C6;&#xC5B4;&#xC11C; &#xD070; &#xB180;&#xB77C;&#xC6C0;&#xC740; &#xC5C6;&#xC5C8;&#xB2E4;. &#xADF8;&#xC800; &#xCF58;&#xC194;&#xC5D0;&#xC11C; &#xC785;&#xB825;&#xACFC; &#xCD9C;&#xB825;&#xC73C;&#xB85C; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC774; &#xB3CC;&#xC544;&#xAC04;&#xB2E4;&#xB294; &#xC790;&#xCCB4;&#xAC00; &#xAC00;&#xC7A5; &#xC2E0;&#xAE30;&#xD588;&#xB2E4;.</li><li>&#xAD50;&#xC721; &#xB0B4;&#xC6A9;&#xC740; &#xD655;&#xC2E4;&#xD788; &#xC790;&#xBC14; &#xAE30;&#xCD08;&#xC5D0; &#xBD80;&#xD569;&#xD558;&#xB294; &#xC815;&#xD655;&#xD55C; &#xB0B4;&#xC6A9;&#xB4E4;&#xC774;&#xC5C8;&#xC73C;&#xB098; &#xD559;&#xC2B5;&#xD558;&#xACE0; &#xACF5;&#xBD80;&#xD558;&#xB294; &#xC785;&#xC7A5;&#xC5D0;&#xC11C; &#xB108;&#xBB34; &#xBE60;&#xB978; input &#xC73C;&#xB85C; &#x2018;&#xADF8;&#xB807;&#xAD6C;&#xB098;&#x2019; &#xD558;&#xBA74;&#xC11C; &#xB118;&#xC5B4;&#xAC00;&#xB294; &#xC9C0;&#xC2DD;&#xC774; &#xAD49;&#xC7A5;&#xD788; &#xB9CE;&#xC558;&#xB2E4;. &#xC5B8;&#xC5B4; &#xC790;&#xCCB4;&#xB97C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC9C0;&#xC5D0; &#xC9D1;&#xC911;&#xD558;&#xC5EC;&#xC11C; &#xD559;&#xC2B5;&#xD558;&#xC600;&#xB358; &#xAC83; &#xAC19;&#xB2E4;.</li><li>&#xD559;&#xC2B5; &#xB0B4;&#xC6A9; &#xC911; &#xAC00;&#xC7A5; &#xCDA9;&#xACA9;&#xC801;&#xC774;&#xACE0; &#xBC14;&#xB85C; &#xBC1B;&#xC544;&#xB4E4;&#xC774;&#xAE30; &#xD798;&#xB4E4;&#xC5C8;&#xB358; &#xAC1C;&#xB150;&#xC740; <code>&#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5;&#xC5B8;&#xC5B4;</code> &#xB77C;&#xB294; &#xD2B9;&#xC131;&#xC774;&#xC5C8;&#xB2E4;. &#xD328;&#xD0A4;&#xC9C0;&#xC640; &#xD074;&#xB798;&#xC2A4;&#xB97C; &#xBD84;&#xB9AC;&#xD558;&#xACE0; &#xC774;&#xB97C; import &#xD558;&#xAC70;&#xB098; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC11C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xBC30;&#xC6E0;&#xC744; &#xB54C; &#xD55C;&#xB3D9;&#xC548; &#xBA58;&#xBD95;&#xC744; &#xB290;&#xAF08;&#xC5C8;&#xB2E4;.</li><li>&#xBC14;&#xB85C; &#xB2E4;&#xC74C;&#xC8FC; &#xC5F0;&#xB2EC;&#xC544; Java &#xBA54;&#xBAA8;&#xB9AC; &#xC0AC;&#xC6A9;&#xACFC; &#xCC38;&#xC870;&#xD0C0;&#xC785;&#xC744; &#xACF5;&#xBD80;&#xD558;&#xBA70; &#xB450;&#xBC88;&#xC9F8; &#xCDA9;&#xACA9;&#xC744; &#xBC1B;&#xAC8C;&#xB41C;&#xB2E4; &#x1FAE0;</li><li>&#xCC98;&#xC74C; &#xBC30;&#xC6B4; &#xADF8; &#xC21C;&#xAC04;&#xBD80;&#xD130; DB&#xB97C; &#xBCC4;&#xB85C; &#xC88B;&#xC544;&#xD558;&#xC9C0; &#xC54A;&#xC558;&#xB098;&#xBCF4;&#xB2E4;. &#xCD94;&#xD6C4; JDBC &#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA70; &#xC790;&#xBC14; &#xAD50;&#xC721;&#xAE30;&#xAC04;&#xB3D9;&#xC548; 3&#xCC28; &#xBA58;&#xBD95;&#xC744; &#xB9DE;&#xAC8C; &#xB41C;&#xB2E4;.</li><li>HTML, CSS, JavaScript &#xB97C; &#xC88B;&#xC544;&#xD588;&#xB2E4;. &#xB2E4;&#xB9CC; &#xCF54;&#xB4DC;&#xAC00; &#xB298;&#xC5B4;&#xB0A0; &#xC218;&#xB85D; &#xCF54;&#xB4DC;&#xB97C; &#xC8FC;&#xCCB4;&#xD558;&#xC9C0; &#xBABB;&#xD574; &#xACE0;&#xBBFC;&#xD588;&#xB2E4;.</li><li>&#xC790;&#xBC14;&#xC2A4;&#xD06C;&#xB9BD;&#xD2B8;&#xB294; jQuery&#xBCF4;&#xB2E4;&#xB294; &#xBC14;&#xB2D0;&#xB77C;&#xB85C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC744; &#xD6E8;&#xC52C; &#xC88B;&#xC544;&#xD588;&#xB294;&#xB370;, &#xBE44;&#xB3D9;&#xAE30; &#xC694;&#xCCAD;&#xC744; &#xD558;&#xACE0; &#xBC1B;&#xB294; &#xAC83;&#xC744; &#xD558;&#xBA74;&#xC11C;&#xB3C4; &#xBE44;&#xB3D9;&#xAE30;&#xC5D0; &#xB300;&#xD55C; &#xC774;&#xD574;&#xAC00; &#xBD80;&#xC871;&#xD588;&#xB358; &#xAC83; &#xAC19;&#xB2E4;.</li><li>&#xBC30;&#xD3EC;&#xB294; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0; &#xB300;&#xD55C; &#xC9C0;&#xC2DD;&#xC774; &#xC804;&#xBB34;&#xD558;&#xC600;&#xC9C0;&#xB9CC;, &#xC218;&#xC5C5;&#xC790;&#xB8CC;&#xAC00; &#xAF64; &#xC798;&#xB418;&#xC5B4;&#xC788;&#xC5B4;&#xC11C; &#xD560; &#xC218; &#xC788;&#xC5C8;&#xB2E4;.</li><li><code>controller</code> -&gt; <code>service</code> -&gt; <code>repository</code> &#xB85C; &#xC774;&#xC5B4;&#xC9C0;&#xB294; &#xACC4;&#xCE35;&#xD615; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xC774;&#xD574;&#xD558;&#xB294; &#xB370; &#xD798;&#xB4E4;&#xC5C8;&#xB2E4;. &#xC774;&#xAC83;&#xC740; &#xD568;&#xAED8;&#xD55C; &#xC218;&#xAC15;&#xC0DD; &#xC911; &#xB300;&#xBD80;&#xBD84;&#xC774; &#xBE44;&#xC2B7;&#xD588;&#xB294;&#xB370; &#xADF8;&#xB0E5; &apos;&#xC775;&#xC219;&#xD574;&#xC9C4;&#xB2E4;&apos;&#xC5D0; &#xB354; &#xAC00;&#xAE4C;&#xC6B4; &#xD559;&#xC2B5;&#xC774;&#xC5C8;&#xB358; &#xAC83; &#xAC19;&#xB2E4;. &#xC774;&#xB7F0; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC5D0; &#xB300;&#xD55C; &#xC774;&#xD574;&#xB294; &#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xC2DC;&#xC791;&#xD558;&#xACE0; &#xAD6C;&#xD604;&#xC744; &#xBC18;&#xBCF5;&#xD558;&#xBA74;&#xC11C; &#xC810;&#xC810; &#xB354; &#xC775;&#xD600;&#xAC14;&#xB2E4;.</li><li>&#xAC1C;&#xBC1C; &#xACF5;&#xBD80;&#xB97C; &#xC2DC;&#xC791;&#xD55C; &#xAC83;&#xC5D0; &#xC990;&#xAC70;&#xC6CC;&#xD558;&#xACE0; &#xB9CC;&#xC871;&#xD588;&#xB2E4;.</li></ul>
<p></p>
<h2 id="%ED%94%84%EB%A1%9C%EC%A0%9D%ED%8A%B8%EC%97%90-%EB%8C%80%ED%95%98%EC%97%AC">&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xB300;&#xD558;&#xC5EC;</h2>
<figure class="kg-card kg-image-card"><img src="https://user-images.githubusercontent.com/101630615/201294104-515c4901-95b8-46fc-9bb9-a7ecacc96188.gif" class="kg-image" alt="ezgif com-gif-maker" loading="lazy"></figure>
<ul><li>&#xC0AC;&#xC6A9; &#xAE30;&#xC220; &#xC2A4;&#xD0DD; : Java11, SpringBoot 2.7, MySQL, MyBatis, JavaScript, jQuery(&#xBE44;&#xB3D9;&#xAE30; &#xC694;&#xCCAD;&#xC2DC;&#xC5D0; &#xC0AC;&#xC6A9;)</li></ul>
<p>&#xAC70;&#xC758; 2&#xB2EC;&#xC815;&#xB3C4;&#xB97C; &#xC7A1;&#xACE0; &#xC788;&#xC5C8;&#xB358; &#xC774; &#xD504;&#xB85C;&#xC81D;&#xD2B8; Artchive. &#xCC38; &#xBB34;&#xC5D0;&#xC11C; &#xC720;&#xB85C; &#xAC04;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xBE44;&#xC804;&#xACF5;&#xC790; 5&#xBA85;&#xC774;&#xC11C; &#xD55C;&#xB540;&#xD55C;&#xB540; &#xB9CC;&#xB4E4;&#xC5C8;&#xB2E4;. HTML &#xC2DC;&#xBA58;&#xD2F1; &#xD0DC;&#xADF8;&#xB97C; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xB9CC;&#xB4DC;&#xB290;&#xB77C; &#xAD6C;&#xD604;&#xC790;&#xB9C8;&#xB2E4; &#xBBF8;&#xBB18;&#xD558;&#xAC8C; &#xD398;&#xC774;&#xC9C0;&#xAC00; &#xB2EC;&#xB77C;&#xC838;&#xC11C; &#xB098;&#xC911;&#xC5D0; &#xD1B5;&#xC77C;&#xC2DC;&#xD0A4;&#xB290;&#xB77C; &#xACE0;&#xC0DD;&#xD588;&#xB358; &#xAE30;&#xC5B5;&#xC774;&#xB09C;&#xB2E4;.</p>
<p> &#xC9C0;&#xAE08; &#xBCF4;&#xBA74; AWS&#xC5D0; &#xBC30;&#xD3EC;&#xD558;&#xAE34; &#xD588;&#xC9C0;&#xB9CC; &#xC778;&#xD504;&#xB77C;&#xB098; &#xC124;&#xACC4;&#xBA74;&#xC5D0;&#xC11C; &#xBD80;&#xC871;&#xD55C;&#xC810;&#xC774; &#xB9CE;&#xB2E4;.</p>
<p> &#xC624;&#xD788;&#xB824; HTML, CSS &#xCABD;&#xC774;&#xB098; &#xBC14;&#xB2D0;&#xB77C; JS&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC5EC; &#xC9C0;&#xB3C4; API&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xACE0;, &#xBE44;&#xB3D9;&#xAE30; &#xC694;&#xCCAD;&#xC744; &#xD558;&#xB294; &#xB4F1; &#xD504;&#xB860;&#xD2B8; &#xC5ED;&#xB7C9;&#xC744; &#xB354; &#xB9CE;&#xC774; &#xBC1C;&#xD718;&#xD588;&#xC5C8;&#xB2E4;. &#xD654;&#xBA74;&#xC5D0; &#xBCF4;&#xC774;&#xB294; &#xB85C;&#xC9C1; &#xC911; &#xC5EC;&#xD589; &#xCF54;&#xC2A4;&#xB97C; &#xAE30;&#xD68D;&#xD558;&#xACE0; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xD398;&#xC774;&#xC9C0; view&#xBD80;&#xD130; crud&#xAE4C;&#xC9C0; &#xB9E1;&#xC544;&#xC11C; &#xD588;&#xB2E4;. &#xC544;&#xB798; ERD &#xC5D0;&#xC11C;&#xB294; &#xB178;&#xB780;&#xC0C9;&#xC73C;&#xB85C; &#xD45C;&#xC2DC;&#xB41C; &#xCF54;&#xC2A4;&#xC5D0; &#xD574;&#xB2F9;&#xD55C;&#xB2E4;.</p>
<figure class="kg-card kg-image-card"><img src="https://user-images.githubusercontent.com/101630615/196031066-ba558000-1157-40db-9b92-3c73f4e17219.png" class="kg-image" alt="Entity2" loading="lazy"></figure>
<p>&#xC774;&#xB54C;&#xC758; &#xAC00;&#xC7A5; &#xD070; &#xC774;&#xC288;&#xB294; &#xB450;&#xAC00;&#xC9C0;&#xC600;&#xB2E4;.</p>
<p>&#xCCAB;&#xBC88;&#xC9F8;,  &quot;&#xAC01; &#xCF54;&#xC2A4;&#xC758; &#xC21C;&#xC11C;&#xB97C; view&#xC5D0;&#xC11C; &#xC5B4;&#xB5BB;&#xAC8C; &#xC218;&#xC815;&#xD560; &#xAC83;&#xC778;&#xAC00;, &#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xAC83;&#xC774; DB&#xC5D0; &#xC5B4;&#xB5BB;&#xAC8C; &#xC800;&#xC7A5;&#xD574;&#xC57C; &#xC88B;&#xC744;&#xAE4C;&quot; &#xC600;&#xB2E4;. &#xD504;&#xB860;&#xD2B8;&#xC5D0;&#xC11C; order&#xC640; &#xB0B4;&#xC6A9;&#xC744; JSON&#xD615;&#xD0DC;&#xB85C; &#xB118;&#xACA8; DB&#xC5D0; String &#xD615;&#xD0DC;&#xB85C; &#xC9C1;&#xB82C;&#xD654;&#xD558;&#xC5EC; &#xC2A4;&#xB0C5;&#xC0F7;&#xCC98;&#xB7FC; &#xC800;&#xC7A5;&#xD588;&#xB2E4;. &#x1F979; &#xB9C1;&#xD06C;&#xB4DC; &#xB9AC;&#xC2A4;&#xD2B8;&#xB098; &#xC6B0;&#xC120;&#xC21C;&#xC704;&#xB97C; &#xC8FC;&#xB294; &#xB4F1;&#xC758; &#xB2E4;&#xC591;&#xD55C; &#xBC29;&#xBC95;&#xC774;&#xB098; &#xD14C;&#xC774;&#xBE14;&#xC744; &#xC5B4;&#xB290;&#xC815;&#xB3C4; &#xC815;&#xADDC;&#xD654;+&#xBE44;&#xC815;&#xADDC;&#xD654;&#xD558;&#xACE0; &#xC778;&#xB371;&#xC2A4;&#xB97C; &#xC0DD;&#xC131;&#xD558;&#xC5EC; &#xCD5C;&#xC801;&#xD654;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC29;&#xBC95;&#xB4E4;&#xC774; &#xC788;&#xC5C8;&#xB294;&#xB370;.. &#xB2F9;&#xC2DC; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xBA74; &#xAC8C;&#xC2DC;&#xD310; &#xD398;&#xC774;&#xC9C0; &#xB85C;&#xB529;&#xBD80;&#xD130; &#xB290;&#xB838;&#xB358; &#xC774;&#xC720;&#xAC00; &#xB2E4; &#xC788;&#xC5C8;&#xB2E4;.</p>
<p>&#xB450;&#xBC88;&#xC9F8;, AI&#xD559;&#xC2B5;&#xC744; &#xC704;&#xD55C; &#xB370;&#xC774;&#xD130; &#xC218;&#xC9D1;&#xACFC; &#xD559;&#xC2B5;&#xC758; &#xC790;&#xB3D9;&#xD654;&#xC600;&#xB2E4;. &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC774;&#xC6A9;&#xD328;&#xD134;&#xC744; DB&#xC5D0; &#xC800;&#xC7A5;&#xD558;&#xACE0; &#xC774;&#xB97C; &#xB370;&#xC774;&#xD130;&#xB85C; &#xCD94;&#xCC9C;&#xD574;&#xC8FC;&#xB294; Aitems&#xB97C; &#xC801;&#xC6A9;&#xD588;&#xC5C8;&#xB294;&#xB370;. (&#xB2F4;&#xB2F9;&#xC740; &#xB0B4;&#xAC00; &#xC544;&#xB2C8;&#xC5C8;&#xB2E4;.) &#xC774;&#xBD80;&#xBD84;&#xC740; &#xC2A4;&#xC2A4;&#xB85C; &#xC774;&#xD574;&#xB3C4;&#xAC00; &#xB108;&#xBB34; &#xB0AE;&#xC558;&#xACE0;, &#xB354;&#xBBF8; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB300;&#xB7C9;&#xC73C;&#xB85C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC744;&#xB9CC;&#xD55C; &#xC5EC;&#xC720;&#xB3C4; &#xAE30;&#xC220;&#xB3C4; &#xC5C6;&#xC5C8;&#xB2E4;. &#xC774; Ai &#xD559;&#xC2B5; &#xD328;&#xD134; &#xC5C5;&#xB370;&#xC774;&#xD2B8;&#xB97C; &#xC790;&#xB3D9;&#xD654;&#xD558;&#xC9C0; &#xBABB;&#xD588;&#xB358; &#xAC83;&#xB3C4; &#xC544;&#xC27D;&#xB2E4;.</p>
<p>&#xC9C0;&#xAE08; &#xBCF4;&#xBA74; &#xC544;&#xC774;&#xB514;&#xC5B4; &#xC790;&#xCCB4;&#xB294; &#xC5EC;&#xB7EC;&#xAC00;&#xC9C0; &#xC2DC;&#xB3C4;&#xD558;&#xAE30; &#xC88B;&#xC558;&#xB294;&#xB370; &#xC544;&#xC26C;&#xC6C0;&#xC774; &#xB9CE;&#xC774; &#xB0A8;&#xB294; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC774;&#xB2E4;.</p>
<hr>
<h2 id="%EA%B5%90%EC%9C%A1%EA%B3%BC%EC%A0%95%EC%9D%98-%EC%A2%8B%EC%95%98%EB%8D%98-%EC%A0%90">&#xAD50;&#xC721;&#xACFC;&#xC815;&#xC758; &#xC88B;&#xC558;&#xB358; &#xC810;</h2>
<ul><li>&#xBD80;&#xB2F4;&#xC5C6;&#xC774; view&#xBD80;&#xD130; &#xC5B4;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;, DB, &#xC778;&#xD504;&#xB77C;&#xAE4C;&#xC9C0; &#xC804;&#xCCB4;&#xB97C; &#xD6D1;&#xB294; &#xACBD;&#xD5D8;&#xD574; &#xBCFC; &#xC218; &#xC788;&#xC5C8;&#xB2E4;. &#xADF8;&#xB798;&#xC11C; &#xB0B4;&#xAC00; &#xC5B4;&#xB514;&#xC5D0; &#xB354; &#xD765;&#xBBF8;&#xC788;&#xB294;&#xC9C0; &#xACE0;&#xBBFC;&#xD558;&#xAE30;&#xC5D0; &#xC88B;&#xC740; &#xD658;&#xACBD;&#xC774;&#xC5C8;&#xB2E4;.</li><li>&#xC77C;&#xB2E8; &#xBD80;&#xB2F4;&#xC774; &#xC5C6;&#xC5C8;&#xB2E4;. &#xC2DC;&#xB3C4;&#xD574;&#xBCF4;&#xB294; &#xAC00;&#xBCBC;&#xC6B4; &#xB9C8;&#xC74C;&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB2E4;.</li><li>&#xAC15;&#xC0AC;&#xB2D8;&#xC774; &#xC218;&#xAC15;&#xC0DD; &#xD55C; &#xC0AC;&#xB78C; &#xD55C; &#xC0AC;&#xB78C; &#xBC84;&#xB9AC;&#xC9C0; &#xC54A;&#xC73C;&#xB824;&#xB294; &#xBD84;&#xC774;&#xC5B4;&#xC11C; &#xC9C4;&#xB3C4;&#xB97C; &#xCAD3;&#xC544;&#xAC08; &#xC218; &#xC788;&#xC5C8;&#xB2E4;.</li></ul>
<p></p>
<h2 id="%EA%B5%90%EC%9C%A1%EA%B3%BC%EC%A0%95%EC%9D%98-%EC%95%84%EC%89%AC%EC%9B%A0%EB%8D%98-%EC%A0%90">&#xAD50;&#xC721;&#xACFC;&#xC815;&#xC758; &#xC544;&#xC26C;&#xC6E0;&#xB358; &#xC810;</h2>
<ul><li>&#xB108;&#xBB34; &#xAE09;&#xD558;&#xAC8C; &#xBC30;&#xC6B0;&#xB824;&#xB2E4;&#xBCF4;&#xB2C8; &#xBB34;&#xC5C7;&#xD558;&#xB098; &#xC5B4;&#xB5BB;&#xAC8C; &#xD559;&#xC2B5;&#xD574;&#xC57C;&#xD558;&#xB294;&#xC9C0; &#xC54C;&#xC9C0; &#xBABB;&#xD55C;&#xCC44;&#xB85C; 5.5&#xAC1C;&#xC6D4;&#xC774; &#xB05D;&#xB098;&#xBC84;&#xB838;&#xB2E4;.</li><li>&#xC774;&#xAC74; &#xC6B0;&#xB9AC;&#xBC18;&#xC758; &#xD2B9;&#xC131;&#xC778; &#xAC83; &#xAC19;&#xC740;&#xB370; &#xBA3C;&#xC800; &#xACF5;&#xBD80;&#xD574;&#xBD24;&#xAC70;&#xB098; &#xC804;&#xACF5;&#xC744; &#xD588;&#xAC70;&#xB098; &#xD504;&#xB85C;&#xC81D;&#xD2B8; &#xBC29;&#xBC95;&#xC744; &#xC544;&#xB294; &#xC0AC;&#xB78C;&#xC774; &#xADF9; &#xC18C;&#xC218;&#xC778;&#xB370;&#xB2E4; &#xCD08;&#xBC18;&#xC5D0; &#xC790;&#xC728; &#xC870;&#xAD6C;&#xC131;&#xC744; &#xD560; &#xB54C; 1~2&#xAC1C; &#xADF8;&#xB8F9;&#xC5D0; &#xD3B8;&#xC131;&#xB418;&#xC5B4;&#xC11C; &#xC5B4;&#xB5BB;&#xAC8C; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xD574;&#xC57C;&#xD558;&#xB294;&#xC9C0; &#xBAA8;&#xB974;&#xB294;&#xCC44;&#xB85C; &#xC2DC;&#xC791;&#xD574;&#xC57C; &#xD588;&#xB2E4;.</li><li>&#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC5D0; &#xB300;&#xD55C; &#xD3C9;&#xAC00;&#xAC00; &#xAE30;&#xD68D;&#xACFC; &#xBC1C;&#xD45C; &#xC2A4;&#xD0AC;&#xC5D0; &#xC9D1;&#xC911;&#xB418;&#xC5B4; &#xC788;&#xC5C8;&#xB2E4;.</li></ul>
<p></p>]]></content:encoded></item><item><title><![CDATA[2022년 회고 (1) 커뮤니티 기획자가 개발자를 꿈꾸게된 이야기]]></title><description><![CDATA[<h2 id="%EA%B0%9C%EC%9A%94"><strong>&#xAC1C;&#xC694;</strong></h2>
<p>&#xC5C4;&#xCCAD; &#xB2A6;&#xC5C8;&#xC9C0;&#xB9CC; 2022&#xB144; &#xD68C;&#xACE0;.<br>1&#xD3B8;&#xC740; &#xC0AC;&#xD68C;&#xACFC;&#xD559;&#xACC4;&#xC5F4; &#xC804;&#xACF5; &#xAE30;&#xD68D;&#xC790;&#xAC00; &#xAC1C;&#xBC1C;&#xC790;&#xB85C; &#xC774;&#xC9C1;&#xC744; &#xACB0;&#xC2EC;&#xD55C; &#xC774;&#xC57C;&#xAE30;.</p>
<p><em>&#xC8FC;&#xC758;, &#xCCA0;&#xC800;&#xD788; &#xB098;&#xC758; &#xC598;&#xAE30; &#xAE30;</em></p>]]></description><link>http://localhost:2369/2022-log-1/</link><guid isPermaLink="false">64e12a8b749ee079fb78d1f2</guid><category><![CDATA[Log]]></category><category><![CDATA[Posts]]></category><category><![CDATA[2022]]></category><dc:creator><![CDATA[saehim lee]]></dc:creator><pubDate>Sat, 07 Jan 2023 20:48:00 GMT</pubDate><content:encoded><![CDATA[<h2 id="%EA%B0%9C%EC%9A%94"><strong>&#xAC1C;&#xC694;</strong></h2>
<p>&#xC5C4;&#xCCAD; &#xB2A6;&#xC5C8;&#xC9C0;&#xB9CC; 2022&#xB144; &#xD68C;&#xACE0;.<br>1&#xD3B8;&#xC740; &#xC0AC;&#xD68C;&#xACFC;&#xD559;&#xACC4;&#xC5F4; &#xC804;&#xACF5; &#xAE30;&#xD68D;&#xC790;&#xAC00; &#xAC1C;&#xBC1C;&#xC790;&#xB85C; &#xC774;&#xC9C1;&#xC744; &#xACB0;&#xC2EC;&#xD55C; &#xC774;&#xC57C;&#xAE30;.</p>
<p><em>&#xC8FC;&#xC758;, &#xCCA0;&#xC800;&#xD788; &#xB098;&#xC758; &#xC598;&#xAE30; &#xAE30;&#xB85D;&#xD558;&#xB294; &#xAC70;&#xB77C; &#xB531;&#xD788; &#xB3C4;&#xC6C0;&#xC740; &#xC548;&#xB420; &#xAC83; &#xAC19;&#xC2B5;&#xB2C8;&#xB2E4;.. &#xAD73;&#xC774; &#xB530;&#xC9C0;&#xC790;&#xBA74; &#xC815;&#xBCF4; 10, &#xC0AC;&#xB2F4; 90&#xC758; &#xAE00;&#xC774; &#xB420; &#xC608;&#xC815;&#xC785;&#xB2C8;&#xB2E4;.</em></p>
<p></p>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.kakaocdn.net/dn/c0BRK8/btrXImSBARN/CRkcHsKgnADHHVv31ekHZk/img.png" class="kg-image" alt loading="lazy"><figcaption><span>&#xAC04;&#xB2E4;, &#xC774; &#xC545;&#xBB3C;&#xACE0; &#x1F62C;</span></figcaption></figure>
<p></p>
<h2 id="%EA%B8%B0%ED%9A%8D%EC%9E%90%EC%9D%98-%EA%B8%B0%EC%81%A8%EA%B3%BC-%EC%8A%AC%ED%94%94"><strong>&#xAE30;&#xD68D;&#xC790;&#xC758; &#xAE30;&#xC068;&#xACFC; &#xC2AC;&#xD514;</strong></h2>
<blockquote>2022&#xB144; &#xC774;&#xC804; : &#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xAE30;&#xD68D;&#xC790;&#xB85C;&#xC11C;&#xC758; &#xC77C;!<br>2022&#xB144; 1~2&#xC6D4; : &#xD1F4;&#xC0AC; &#xC5EC;&#xD589;, &#xC0AC;&#xB78C;&#xB9CC;&#xB098;&#xAE30;</blockquote>
<p>&#xC9C1;&#xC5C5;&#xC744; &#xBB3B;&#xB294; &#xC9C8;&#xBB38;&#xC744; &#xCC38; &#xC790;&#xC8FC; &#xB4E3;&#xB294;&#xB2E4;. &#xB098;&#xB294; &#xC5B8;&#xC81C;&#xB098; &#xB0B4; &#xC9C1;&#xC5C5;&#xC744; &#xC124;&#xBA85;&#xD558;&#xAE30;&#xC5D0; &#xC5B4;&#xB824;&#xC6C0;&#xC774; &#xB4E4;&#xC5C8;&#xB2E4;.</p>
<p>&#xBCF4;&#xD1B5; &#xB300;&#xB2E4;&#xC218;&#xC758; &#xC0AC;&#xB78C;&#xB4E4;&#xC5D0;&#xAC8C;&#xB294; &apos;&#xBB38;&#xD654;&#xC608;&#xC220; &#xD504;&#xB85C;&#xADF8;&#xB7A8;/&#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xAE30;&#xD68D;&#xC790;&apos;&#xB77C;&#xB294; &#xB2F5;&#xBCC0;&#xC744; &#xD588;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xC815;&#xD655;&#xD558;&#xAC8C; &#xB0B4; &#xC2A4;&#xC2A4;&#xB85C; &#xADF8;&#xB3D9;&#xC548;&#xC758; &#xC9C1;&#xC5C5;&#xC744; &#xADDC;&#xC815;&#xD558;&#xC790;&#xBA74; &#xC9C0;&#xC5ED; &#xD65C;&#xB3D9;&#xAC00;&#xC774;&#xC790;, &#xCCAD;&#xB144; &#xD65C;&#xB3D9;&#xAC00;&#xC600;&#xB2E4;. &#xCCAD;&#xC18C;&#xB144;&#xAE30;&#xBD80;&#xD130; &#xC0AC;&#xD68C; &#xBB38;&#xC81C;&#xC5D0; &#xAD00;&#xC2EC;&#xC774; &#xB9CE;&#xC558;&#xACE0;, &#xD2B9;&#xD788; &#xB2E4;&#xC591;&#xC131;&#xACFC; &#xB3C4;&#xC2DC;(&#xC11C;&#xC6B8;) &#xBB38;&#xC81C;&#xC5D0; &#xC9C0;&#xADF9;&#xD788; &#xAD00;&#xC2EC;&#xC774; &#xB9CE;&#xC558;&#xB2E4;. &#xADF8;&#xB7EC;&#xB2E4;&#xBCF4;&#xB2C8; &#xC0AC;&#xD68C;&#xD559;&#xC744; &#xC804;&#xACF5;&#xD558;&#xACE0; &#xC774; &#xC9C1;&#xC5C5;&#xC744; &#xAC16;&#xAE30;&#xAE4C;&#xC9C0; &#xAD49;&#xC7A5;&#xD788; &#xC790;&#xC5F0;&#xC2A4;&#xB7EC;&#xC6B4; &#xC218;&#xC21C;&#xC774;&#xC5C8;&#xB2E4;.</p>
<p></p>
<p>&#xADF8;&#xB3D9;&#xC548;&#xC758; &#xB0B4; &#xC77C;&#xC758; &#xC804;&#xBC18;&#xC740; &#xC0AC;&#xD68C; &#xC774;&#xC288;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xB418;&#xB294; &#xAC83;&#xB4E4;&#xC744; &#xD3EC;&#xCC29;&#xD558;&#xACE0; &#xC6D0;&#xC778;&#xACFC; &#xD574;&#xACB0;&#xC5D0; &#xB300;&#xD55C; &#xAC00;&#xC124;&#xC744; &#xC138;&#xC6B0;&#xB294; &#xAC83;&#xC73C;&#xB85C;&#xBD80;&#xD130; &#xAE30;&#xD68D;&#xC744; &#xC2DC;&#xC791;&#xD558;&#xAE30;&#xB3C4; &#xD558;&#xACE0;, &#xC0AC;&#xC5C5; &#xCCAD;&#xC0AC;&#xC9C4;&#xC744; &#xADF8;&#xB9AC;&#xB294; &#xAC83;&#xBD80;&#xD130; &#xC2DC;&#xC791;&#xD588;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xAE30;&#xD68D;&#xB41C; &#xC0AC;&#xC5C5;&#xC5D0;&#xC11C; &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC5C5; &#xACC4;&#xD68D;&#xC744; &#xC9DC;&#xACE0; &#xC6B4;&#xC601;&#xD558;&#xACE0; &#xBCF4;&#xACE0;&#xC11C;&#xB97C; &#xC791;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xC74C;.. &#xC774;&#xB807;&#xAC8C; &#xB9D0;&#xD558;&#xBA74; &#xB108;&#xBB34; &#xCD94;&#xC0C1;&#xC801;&#xC778;&#xAC00;? &#xAD6C;&#xCCB4;&#xC801;&#xC73C;&#xB860; &#xC758;&#xC790; &#xC55E;&#xC5D0;&#xC11C; &#xC549;&#xC544;&#xC11C; &#xD558;&#xB294; &#xAE30;&#xD68D;&#xC11C; &#xC791;&#xC131;&#xBD80;&#xD130; &#xD64D;&#xBCF4;&#xB9C8;&#xCF00;&#xD305;, &#xC0AC;&#xC5C5; &#xAD00;&#xACC4;&#xC790; &#xC12D;&#xC678; &#xBC0F; &#xD611;&#xC5C5;, &#xACF5;&#xAC04; &#xAE30;&#xD68D;, &#xD589;&#xC815;&#xD68C;&#xACC4;, &#xD589;&#xC0AC;&#xD560; &#xB54C; &#xB9C8;&#xC774;&#xD06C;&#xB97C; &#xC7A1;&#xB294; &#xAC83;&#xB3C4; &#xC885;&#xC885; &#xB098;&#xC758; &#xC5C5;&#xBB34; &#xC601;&#xC5ED;&#xC774;&#xC5C8;&#xB2E4;. &#xC774;&#xB7F0; &#xC804;&#xBC18;&#xC801;&#xC778; &#xACFC;&#xC815;&#xC744; &#xBAA8;&#xB450; &#xACAA;&#xB294; &#xAC83;(&#xD639;&#xC740; &#xC77C;&#xC758; A-Z&#xAE4C;&#xC9C0; &#xD30C;&#xC545;&#xD558;&#xACE0; &#xC788;&#xB294; &#xAC83;)&#xC774; &#xB0B4; &#xC131;&#xACA9;&#xC5D0;&#xB294; &#xC798; &#xB9DE;&#xC558;&#xB358; &#xAC83; &#xAC19;&#xB2E4;.</p>
<p></p>
<p>&#xC774; &#xC77C;&#xC744; &#xD558;&#xBA70; &#xC815;&#xB9D0; &#xD798;&#xB4E0; &#xC810;&#xB3C4; &#xB9CE;&#xC558;&#xC9C0;&#xB9CC; &#xB9C9;&#xC5F0;&#xD558;&#xAC8C; &#xD544;&#xC694;&#xD558;&#xB2E4; &#xC0DD;&#xAC01;&#xD588;&#xB358; &#xAC83;&#xC744; &#xD604;&#xC2E4;&#xB85C; &#xB9CC;&#xB4DC;&#xB294; &#xC791;&#xC5C5;&#xC774; &#xB108;&#xBB34;&#xB098; &#xC990;&#xAC70;&#xC6E0;&#xB2E4;.</p>
<p>&#xC785;&#xC0AC;&#xD588;&#xB358; &#xACF3;&#xB4E4;&#xC774; &#xC601;&#xC138;&#xD55C; &#xACF3;&#xC774;&#xC5B4;&#xC11C; &#xC790;&#xC720;&#xB3C4;&#xAC00; &#xB192;&#xC558;&#xB2E4;. &#xAE30;&#xD68D;&#xC790;&#xC758; &#xC5C5;&#xBB34; &#xC601;&#xC5ED;&#xC774; &#xB113;&#xC740; &#xAC83;&#xB3C4; &#xC77C;&#xC758; &#xD2C8;&#xD2C8;&#xC774; &#xB0B4; &#xAD00;&#xC2EC;&#xC0AC;&#xB97C; &#xB179;&#xC774;&#xAE30;&#xC5D0; &#xCD5C;&#xC801;&#xC758; &#xD658;&#xACBD;&#xC774;&#xC5C8;&#xB2E4;. &#xC0C8;&#xB85C;&#xC6B4; &#xD234;, &#xAC1C;&#xB150;&#xC774;&#xB098; &#xC7A5;&#xBE44;&#xB97C; &#xBC30;&#xC6B0;&#xB294; &#xAC83;&#xC744; &#xC88B;&#xC544;&#xD588;&#xB2E4;. &#xC77C;&#xC744; &#xD6A8;&#xC728;&#xC801;&#xC73C;&#xB85C; &#xB9CC;&#xB4DC;&#xB294; &#xAC83;&#xB3C4;. &#xC77C;&#xC774; &#xAD11;&#xBC94;&#xC704;&#xD55C; &#xAC83;&#xB3C4; &#xBCC4;&#xB85C; &#xBB38;&#xC81C; &#xB418;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;. &#xC624;&#xD788;&#xB824; &#xB9E4;&#xBC88; &#xC0C8;&#xB85C; &#xC2B5;&#xB4DD;&#xD55C; &#xAC83;&#xB4E4;&#xC744; &#xC77C;&#xC5D0; &#xBC14;&#xB85C; &#xC801;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xB3C4; &#xAE30;&#xAEBC;&#xC6E0;&#xB2E4;.</p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xD588;&#xB358; &#xC77C;&#xB4E4;&#xC758; &#xACFC;&#xC815;&#xC744; &#xAF3C;&#xAF3C;&#xD788; &#xAE30;&#xB85D;&#xD558;&#xACE0;, &#xD6C4;&#xAE30;&#xB97C; &#xB0A8;&#xACA8; &#xC0AC;&#xB78C;&#xB4E4;&#xC5D0;&#xAC8C; &#xC77D;&#xD788;&#xB294; &#xAC83;&#xB3C4; &#xC815;&#xC2DD; &#xC5C5;&#xBB34;&#xB294; &#xC544;&#xB2C8;&#xC5C8;&#xC9C0;&#xB9CC; &#xC790;&#xCC98;&#xD574;&#xC11C; &#xC5C5;&#xBB34;&#xB85C; &#xB9CC;&#xB4E4;&#xC5B4;&#xD558;&#xACE4; &#xD588;&#xB2E4;. &#xC9C0;&#xAE08; &#xC0DD;&#xAC01;&#xD574; &#xBCF4;&#xBA74; &#xC774;&#xB7F0; &#xAC83;&#xC73C;&#xB85C; &#xB204;&#xC801;&#xB41C; &#xC2A4;&#xD2B8;&#xB808;&#xC2A4;&#xB97C; &#xD480;&#xC5C8;&#xB358; &#xAC83; &#xAC19;&#xAE30;&#xB3C4; &#xD558;&#xB2E4;.</p>
<p></p>
<p>&#xAE30;&#xD68D;&#xC790;&#xB85C; &#xC77C;&#xD558;&#xB294; &#xAC83;&#xC740; &#xAC89;&#xC73C;&#xB85C; &#xBCF4;&#xC774;&#xB294; &#xC990;&#xAC70;&#xC6C0;&#xBCF4;&#xB2E4; &#xD798;&#xB4E0; &#xC77C;&#xC774;&#xB2E4;.</p>
<p>&#xB9E4;&#xBC88; &#xC0C8;&#xB85C;&#xC6B4; &#xC544;&#xC774;&#xB514;&#xC5B4;&#xB97C; &#xC0DD;&#xC0B0;&#xD574; &#xB0B4;&#xC57C;&#xD558;&#xACE0;, &#xB9E4;&#xB825;&#xC801;&#xC774;&#xC5B4;&#xC57C; &#xD55C;&#xB2E4;. &#xB0B4;&#xAC00; &#xC124;&#xB4DD;&#xB418;&#xC9C0; &#xBABB;&#xD558;&#xB294; &#xAE30;&#xD68D;&#xC740; &#xC77C;&#xC744; &#xD560; &#xB54C;&#xB9C8;&#xB2E4; &#xC5EC;&#xAC04; &#xAD34;&#xB85C;&#xC6B4; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xB2E4;.</p>
<p>&#xACF5;&#xBD80;&#xC640; &#xD2B8;&#xB80C;&#xB4DC;&#xB97C; &#xB530;&#xB77C;&#xAC00;&#xB294; &#xAC83;&#xC744; &#xB3D9;&#xC2DC;&#xC5D0; &#xD574;&#xC57C; &#xD55C;&#xB2E4;. &#xAE30;&#xD68D;&#xB3C4; &#xC544;&#xC6C3;&#xD48B;&#xC774;&#xC5B4;&#xC11C; &#xC778;&#xD48B;&#xC774; &#xC5C6;&#xC73C;&#xBA74; &#xC81C;&#xB300;&#xB85C; &#xB098;&#xC624;&#xC9C0; &#xBABB;&#xD55C;&#xB2E4;. &#xADFC;&#xB370; &#xC544;&#xC6C3;&#xD48B;&#xC744; &#xB0B4;&#xB290;&#xB77C; &#xAD11;&#xBC94;&#xC704;&#xD55C; &#xC5C5;&#xBB34;&#xB97C; &#xC218;&#xD589;&#xD558;&#xB2E4; &#xBCF4;&#xBA74; &#xC778;&#xD48B;&#xC744; &#xB123;&#xC5B4;&#xC904; &#xC2DC;&#xAC04;&#xC774; &#xC5C6;&#xB294; &#xC544;&#xC774;&#xB7EC;&#xB2C8;&#xD568;&#x1F62C;... &#xC815;&#xB9D0; &#xC57C;&#xADFC;&#xC740; &#xBC25;&#xBA39;&#xB4EF;&#xC774; &#xAFB8;&#xC900;&#xD788; &#xD588;&#xB2E4;. &#xADF8;&#xB807;&#xAC8C; &#xC77C;&#xD558;&#xB2E4; &#xBCF4;&#xBA74; &#xB0B4;&#xAC00; &#xC544;&#xC8FC; &#xC88B;&#xC544;&#xD558;&#xB358; &#xC77C;&#xC778;&#xB370;&#xB3C4; &#xC885;&#xC885; &#xC77C;&#xC5D0; &#xD30C;&#xBB3B;&#xD600; &#xC790;&#xAE30; &#xD655;&#xC2E0;&#xC774; &#xC548; &#xB4DC;&#xB294; &#xB54C;&#xB294; &#xB0B4; &#xAE30;&#xD68D;&#xC744; &#xB0B4;&#xAC00; &#xBB34;&#xC11C;&#xC6CC;&#xD560; &#xB54C;&#xB3C4; &#xC788;&#xC5C8;&#xB2E4;. &#xB2F5;&#xC774; &#xB098;&#xC624;&#xC9C0; &#xC54A;&#xB294; &#xAC83;&#xC744; &#xC54C;&#xBA74;&#xC11C;&#xB3C4; &#xC774;&#xAC83;&#xC774; &#xC720;&#xC758;&#xBBF8;&#xD55C;&#xAC00; &#xC758;&#xC2EC;&#xD574; &#xBCF4;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<p>&#xB3CC;&#xC774;&#xCF1C;&#xBCF4;&#xBA74; &#xC9C1;&#xBB34; &#xC804;&#xD658;&#xC744; &#xACB0;&#xC2EC;&#xD55C; &#xAC83; &#xC911; &#xAC00;&#xC7A5; &#xD070; &#xC774;&#xC720;&#xAC00; &#xC774;&#xAC83;&#xC774;&#xC9C0; &#xC54A;&#xC744;&#xAE4C;...?</p>
<p></p>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.kakaocdn.net/dn/bwutVh/btrXHCPpSmb/dYy9DV5hYacg9V7k0UmRJK/img.png" class="kg-image" alt loading="lazy" width="594" height="394"><figcaption><span>&#xD1F4;&#xC9C1; &#xC9C1;&#xD6C4; &#xD558;&#xB3D9;, &#xAD6C;&#xB840;, &#xC81C;&#xC8FC;&#xB3C4;&#xB97C; &#xCE5C;&#xAD6C;(&#xC0AC;&#xC9C4; &#xC18D; &#xC778;&#xBB3C;)&#xC640; &#xC5EC;&#xD589;&#xD588;&#xB2E4;. &#xC774;&#xB54C;&#xB294; &#xBAB0;&#xB790;&#xB2E4;. &#xC0C8;&#xB85C;&#xC6B4; &#xC9C1;&#xC5C5;&#xC744; &#xAFC8;&#xAFB8;&#xAC8C; &#xB420; &#xC904;&#xC740;.</span></figcaption></figure>
<p></p>
<p>&#xC9C1;&#xC804; &#xC870;&#xC9C1;&#xC5D0;&#xC11C; &#xC77C;&#xC740; 3&#xB144;&#xC815;&#xB3C4; &#xD588;&#xB2E4;. 21&#xB144; 12&#xC6D4;&#xC744; &#xB05D;&#xC73C;&#xB85C; &#xD1F4;&#xC9C1;&#xC744; &#xD558;&#xACE0; &#xB098;&#xC11C;&#xB3C4; &#xB098;&#xB294; &#xC774; &#xC9C1;&#xC5C5;&#xC744; &#xAF64; &#xC0AC;&#xB791;&#xD574;&#xC11C; &#xD55C; &#xBC18;&#xB144; &#xC7AC;&#xCDA9;&#xC804; &#xD6C4; &#xB2E4;&#xC2DC; &#xD65C;&#xB3D9;&#xAC00;&#xB85C;&#xC11C; &#xCDE8;&#xC5C5;&#xC744; &#xD558;&#xB9AC;&#xB77C; &#xC758;&#xC2EC;&#xCE58; &#xC54A;&#xC558;&#xB2E4;.</p>
<p></p>
<hr>
<h2 id="%EA%B7%BC%EB%8D%B0-%EB%B6%84%EC%9C%84%EA%B8%B0-%EA%B0%91%EC%9E%90%EA%B8%B0-%EA%B0%9C%EB%B0%9C%EC%9E%90-%F0%9F%91%A9%F0%9F%8F%BB%E2%80%8D%F0%9F%92%BB"><strong>&#xADFC;&#xB370; &#xBD84;&#xC704;&#xAE30; &#xAC11;&#xC790;&#xAE30; &#xAC1C;&#xBC1C;&#xC790; &#x1F469;&#x1F3FB;&#x200D;&#x1F4BB;</strong></h2>
<blockquote>2022&#xB144; 3~4&#xC6D4; : &#xC9C0;&#xC778; &#xCE74;&#xD398; &#xC54C;&#xBC14;, &#xCDE8;&#xC5C5; &#xC900;&#xBE44; &#x1F449; &#xAC1C;&#xBC1C;&#xC790;&#xB85C; &#xC9C1;&#xBB34; &#xC804;&#xD658; &#xACE0;&#xBBFC;</blockquote>
<p>&#xBCF8;&#xACA9;&#xC801;&#xC73C;&#xB85C; &#xCDE8;&#xC5C5; &#xC2DC;&#xC7A5;&#xC5D0; &#xB6F0;&#xC5B4;&#xB4E4;&#xACE0; &#xC870;&#xAE08; &#xC9C0;&#xB0AC;&#xC744; &#xB54C;&#xC600;&#xB2E4;. &#xC5B4;&#xCA4C;&#xB2E4; &#xB35C;&#xCEE5; &#xCF54;&#xB85C;&#xB098;19&#xC5D0; &#xAC78;&#xB838;&#xB2E4;. &#xB204;&#xAD6C; &#xB9D0;&#xB9CC; &#xB530;&#xB77C; &#xD55C; 3&#xC77C;&#xC740; &#xC9C0;&#xB3C5;&#xD558;&#xAC8C; &#xC544;&#xD30C;&#xC11C; &#xCE68;&#xB300;&#xB97C; &#xBABB; &#xBC97;&#xC5B4;&#xB098;&#xACE0; &#xB059;&#xB059; &#xC553;&#xC558;&#xB2E4;.</p>
<p></p>
<p>&#xADFC;&#xB370; 4&#xC77C;&#xC9F8;&#xBD80;&#xD130; &#xCE68;&#xB300; &#xC704; &#xC0DD;&#xD65C;&#xB9CC; &#xD558;&#xAC8C;&#xB418;&#xC790; &#xC2AC;&#xC2AC; &#xC9C0;&#xB8E8;&#xD574;&#xC9C0;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xB2E4;. &#xACA9;&#xB9AC;&#xB294; 4&#xC77C;&#xC774;&#xB098; &#xB354; &#xD574;&#xC57C; &#xD588;&#xB2E4;. &#xB204;&#xC6CC;&#xC11C; &#xC601;&#xD654;&#xB97C; &#xCF1C;&#xB450;&#xB294; &#xAC83;&#xB3C4;, &#xCC45;&#xC744; &#xBCF4;&#xB294; &#xAC83;&#xB3C4; &#xB354; &#xC9C0;&#xB8E8;&#xD574;&#xC9C8; &#xB54C;&#xCBE4; &#xD3C9;&#xC18C; &#xAF2D; &#xBC30;&#xC6B0;&#xACE0; &#xC2F6;&#xC5C8;&#xB358; &#xCF54;&#xB529;&#xC744; &#xBC30;&#xC6B0;&#xC790; &#xC2F6;&#xC5C8;&#xB2E4;. &#xC0AC;&#xC2E4; &#xAC1C;&#xBC1C;&#xC740; &#xC131;&#xC778; &#xC774;&#xD6C4;&#xC5D0; &#xACC4;&#xC18D; &#xBC30;&#xC6B0;&#xACE0; &#xC2F6;&#xB2E4;&#xACE0; &#xB9C8;&#xC74C; &#xD55C;&#xD3B8;&#xC5D0; &#xB2F4;&#xC544;&#xB450;&#xC5C8;&#xB358; &#xAE30;&#xC220;&#xC774;&#xC5C8;&#xB2E4;. &#xC61B;&#xB0A0; &#xC61B;&#xC801; &#xB098;&#xBAA8;&#xC6F9;&#xC5D0;&#xB514;&#xD130;&#xB85C; &#xC6F9;&#xD398;&#xC774;&#xC9C0;&#xB97C; &#xB9CC;&#xB4E4;&#xB358; &#xCD94;&#xC5B5;&#xC774; &#xD06C;&#xAC8C; &#xC791;&#xC6A9;&#xD588;&#xB2E4;. (&#xD639;&#xC2DC; &#xB2E4;&#xB4E4;.. &#xB098;&#xBAA8;&#xC6F9;&#xC5D0;&#xB514;&#xD130; &#xC544;&#xC2DC;&#xB294;&#xC9C0;...?)</p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xC704;&#xC5D0;&#xB3C4; &#xC5B8;&#xAE09;&#xD588;&#xB4EF;&#xC774; &#xB098;&#xB294; &#xC0C8;&#xB85C;&#xC6B4; &#xAC83;&#xC744; &#xC2B5;&#xB4DD;&#xD558;&#xB294; &#xAC83;&#xC744; &#xC990;&#xAC70;&#xC6CC;&#xD558;&#xACE0; &#xD638;&#xAE30;&#xC2EC;&#xB3C4; &#xB9CE;&#xC740; &#xD3B8;&#xC774;&#xB77C; &#xBC30;&#xC6B0;&#xAE38; &#xC2DC;&#xC791;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xC558;&#xB2E4;. &#xB208;&#xCE58;&#xCC44;&#xC168;&#xB4EF;&#xC774; &#xC6CC;&#xB099; &#xC2DC;&#xC791;&#xC774; &#xAC00;&#xBCBC;&#xC6B4; &#xC0AC;&#xB78C;&#xC774;&#xB2E4;.</p>
<p></p>
<p>&#xAD6C;&#xAE00;&#xB9C1;&#xC73C;&#xB85C; &#xBA87; &#xBC88; &#xAC80;&#xC0C9;&#xD574;&#xBCF4;&#xB2C8;&#xAE4C; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xCDE8;&#xBBF8; &#xCF54;&#xB529; &#xAC15;&#xC758;&#xB85C; <a href="https://opentutorials.org/course/1?ref=localhost">&#xC0DD;&#xD65C;&#xCF54;&#xB529;</a>&#xC744; &#xCD94;&#xCC9C;&#xD558;&#xAE38;&#xB798; <code>HTML</code>&#xBD80;&#xD130; &#xCC9C;&#xCC9C;&#xD788; &#xC2E4;&#xC2B5;&#xD558;&#xAE30; &#xC2DC;&#xC791;&#xD588;&#xB2E4;.  &#xADF8;&#xB7EC;&#xB2E4; &#xAC1C;&#xBC1C;&#xC5D0; &#xB9E4;&#xB825;&#xC5D0; &#xD479; &#xBE60;&#xC838;&#xBC84;&#xB838;&#xB2E4;. &#xC9C0;&#xAE08;&#xB3C4; &#xCC98;&#xC74C; &#xCF54;&#xB529;&#xC744; &#xD574;&#xBCF4;&#xACA0;&#xB2E4;&#xACE0; &#xD558;&#xB294; &#xCE5C;&#xAD6C;&#xAC00; &#xC788;&#xC73C;&#xBA74; &#xC0DD;&#xD65C;&#xCF54;&#xB529; egoing&#xC744; &#xCD94;&#xCC9C;&#xD55C;&#xB2E4;. &#xD55C; &#xB2E8;&#xACC4; &#xB118;&#xC744; &#xB54C;&#xB9C8;&#xB2E4; &#xCE6D;&#xCC2C;&#xBC1B;&#xB294; &#xC7AC;&#xBBF8;&#xC5D0; &#xC5B4;&#xB290;&#xC0C8; &#xB9C8;&#xC9C0;&#xB9C9;&#xAE4C;&#xC9C0; &#xC644;&#xAC15;&#xC744; &#xD558;&#xACE0;&#xC57C; &#xB9C8;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<p></p>
<p>&#xCEE4;&#xBBA4;&#xB2C8;&#xD2F0; &#xAE30;&#xD68D; &#xC5C5;&#xBB34;&#xB294; &#xAE30;&#xD68D; &#xD6C4; &#xC900;&#xBE44;, &#xC2E4;&#xD589; &#xACFC;&#xC815;&#xC774; &#xC788;&#xC5B4;&#xC11C; &#xB204;&#xAD70;&#xAC00;&#xC758; &#xB9AC;&#xC561;&#xC158;&#xC774; &#xC788;&#xAE30;&#xAE4C;&#xC9C0; &#xC2DC;&#xAC04;&#xC774; &#xAF64; &#xAC78;&#xB9AC;&#xB294; &#xBC18;&#xBA74;, &#xAC1C;&#xBC1C;&#xC758; &#xACB0;&#xACFC;&#xB294; &#xBC14;&#xB85C; &#xD655;&#xC778;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC774; &#xB108;&#xBB34; &#xB9E4;&#xB825;&#xC801;&#xC774;&#xC5C8;&#xB2E4;. &#xC0AC;&#xB78C;&#xACFC; &#xADF8; &#xB0A0;&#xC758; &#xAE30;&#xC6B4;(?)&#xC5D0; &#xB9E4;&#xBC88; &#xB2EC;&#xB77C;&#xC9C0;&#xB294; &#xBAA8;&#xC784; &#xBD84;&#xC704;&#xAE30;&#xB3C4; &#xB9E4;&#xB825;&#xC788;&#xC5C8;&#xC9C0;&#xB9CC;.. &#xC774;&#xAC8C; &#xBC14;&#xB85C; &#xAE30;&#xC220;&#xC758; &#xBB18;&#xBBF8;&#xC778;&#xAC00;? &#xC791;&#xAC8C; &#xAE30;&#xB2A5;&#xC744; &#xB098;&#xB204;&#xACE0; &#xD55C; &#xC904; &#xD55C; &#xC904; &#xC77C;&#xC744; &#xC2DC;&#xD0A4;&#xACE0;, &#xC774;&#xB97C; &#xC124;&#xACC4;&#xD558;&#xACE0; &#xB3CC;&#xC544;&#xAC00;&#xAC8C; &#xD558;&#xB294; &#xC990;&#xAC70;&#xC6C0;&#xC774; &#xC788;&#xC5C8;&#xB2E4;.</p>
<p>&#xACF5;&#xBD80;&#xAC00; &#xC870;&#xAE08;&#xC529; &#xB298;&#xC5B4;&#xB098;&#xBA70; &#xD560; &#xC218; &#xC788;&#xB294; &#xAC83;&#xB4E4;&#xC758; &#xBC94;&#xC704;&#xAC00; &#xD655; &#xB298;&#xC5B4;&#xB098;&#xB294; &#xAC83;&#xB3C4; &#xC7AC;&#xBBF8;&#xC788;&#xC5C8;&#xB2E4;. &#xB3D9;&#xC2DC;&#xC5D0; &#xC0C1;&#xC0C1;&#xC758; &#xBC94;&#xC704;&#xB3C4; &#xB298;&#xC5B4;&#xB098;&#xACE0;. &#xC9C0;&#xAE08;&#xAE4C;&#xC9C0; &#xD588;&#xB358; &#xC77C;&#xC911;&#xC5D0; &#xAC00;&#xC7A5; &#xC2DC;&#xAC04;&#xC774; &#xBE68;&#xB9AC; &#xD758;&#xB7EC;&#xAC00;&#xB294; &#xC77C;&#xC774;&#xC5C8;&#xC5B4;&#xC11C; &#xB354; &#xC2E0;&#xAE30;&#xD588;&#xB2E4;.</p>
<p>&#xB610; &#xC0C8;&#xB85C;&#xC6B4; &#xAC83;&#xC744; &#xBC30;&#xC6B0;&#xACE0;, &#xD55C; &#xAC83;&#xC744; &#xAE30;&#xB85D;&#xD558;&#xACE0; &#xC544;&#xB294; &#xAC83;&#xC744; &#xB098;&#xB204;&#xB294; &#xC77C;&#xB828;&#xC758; &#xACFC;&#xC815;&#xB4E4;&#xC774; &#xC990;&#xAC70;&#xC6E0;&#xB2E4;. &#xC774;&#xB7F0; &#xC9C4;&#xB4DD;&#xD55C; &#xBC30;&#xC6C0;&#xC758; &#xACFC;&#xC815;&#xC744; &#xB098;&#xB294; &#xAE4A;&#xAC8C; &#xBC14;&#xB77C;&#xACE0; &#xC788;&#xC5C8;&#xB358; &#xAC83;&#xAC19;&#xB2E4;.</p>
<p></p>
<p>&#xD55C; 2~3&#xC8FC; &#xD2C8;&#xD2C8;&#xD788; &#xC0DD;&#xD65C;&#xCF54;&#xB529; &#xCEE4;&#xB9AC;&#xD058;&#xB7FC;&#xC744; &#xB530;&#xB77C;&#xAC00;&#xB2E4;&#xAC00; &#xBF08;&#xBB38;&#xACFC;&#xC778; &#xB0B4; &#xC8FC;&#xBCC0; &#xC720;&#xC77C;&#xD55C; &#xAC1C;&#xBC1C;&#xC790;&#xC778; &#xCE5C;&#xAD6C;&#xB97C; &#xB9CC;&#xB0AC;&#xC744; &#xB54C; &#xC870;&#xC2EC;&#xC2A4;&#xB7FD;&#xAC8C; &#xC0C1;&#xB2F4;&#xC744; &#xD588;&#xB2E4;.</p>
<p>&#xC544;&#xBB34;&#xB798;&#xB3C4; &#xB098;&#xC774;&#xAC00; &#xC774;&#xBBF8; 30&#xB300;&#xC778;&#xC9C0;&#xB77C; &#xC9C1;&#xBB34;&#xB97C; &#xBC14;&#xAFB8;&#xB294; &#xB3C4;&#xC804;&#xC774; &#xC870;&#xAE08; &#xBD80;&#xB2F4;&#xC2A4;&#xB7EC;&#xC6E0;&#xB2E4;. &#xADF8;&#xCABD; &#xC5C5;&#xACC4;&#xC758; &#xC0DD;&#xB9AC;&#xB97C; &#xC54C; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC5C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xAC1C;&#xBC1C;&#xC744; &#xBC30;&#xC6B4;&#xB2E4;&#xBA74; &#xC751;&#xB2F9; &#xC598;&#xAE30;&#xB97C; &#xB4E3;&#xB294; &#xADF8;&#xB188;&#xC758; &quot;&#xC801;&#xC131;&quot;&#xB3C4; &#xAC71;&#xC815;&#xC774; &#xB418;&#xC5C8;&#xB2E4;.</p>
<p>&#xADF8;&#xB7F0;&#xB370; &#xADF8; &#xCE5C;&#xAD6C;&#xB3C4; &#xAD49;&#xC7A5;&#xD788; &#xD754;&#xCF8C;&#xD788; &#xAC1C;&#xBC1C;&#xC790;&#xB85C;&#xC758; &#xC9C1;&#xBB34; &#xBCC0;&#xACBD;&#xC744; &#xCD94;&#xCC9C;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2CC;&#xAC00;? &#xC624;&#xD788;&#xB824; &#xC798; &#xC5B4;&#xC6B8;&#xB9B4; &#xAC83; &#xAC19;&#xB2E4;&#xBA70; &#xACA9;&#xB824;&#xAE4C;&#xC9C0; &#xD574;&#xC8FC;&#xC5C8;&#xB2E4;&#x1F972; &#xD55C; 4&#xC2DC;&#xAC04;&#xC5EC; &#xAC00;&#xB7C9; &#xACE0;&#xBBFC;&#xD558;&#xB294; &#xBC14;&#xB97C; &#xC0C1;&#xC758;&#xD55C; &#xB4A4;, &#xB2F9;&#xC77C;&#xC5D0; &#xBC14;&#xB85C; &#xACB0;&#xC815;&#xC744; &#xB0B4;&#xB838;&#xB2E4;. &#xC5B4;&#xCC28;&#xD53C; 6&#xAC1C;&#xC6D4; &#xAD50;&#xC721; &#xB4E3;&#xB294;&#xB2E4;&#xBA74; &#xC6D0;&#xB798;&#xB3C4; &#xC26C;&#xBA74;&#xC11C; &#xC7AC;&#xCDA9;&#xC804;&#xD558;&#xB824;&#xACE0; &#xD588;&#xC73C;&#xB2C8; &#xB9D8;&#xCC98;&#xB7FC; &#xC798; &#xC548;&#xB418;&#xB354;&#xB77C;&#xB3C4; &#xADF8;&#xB0E5; &#xC26C;&#xB294; &#xC148;&#xCE58;&#xC790;&#xB294; &#xC548;&#xC77C;&#xD55C; &#xB9C8;&#xC74C;&#xB3C4; &#xC870;&#xAE08;&#xC740; &#xC788;&#xC5C8;&#xB2E4;. (&#x1F448; 1&#xB2EC; &#xB9CC;&#xC5D0; &#xBB34;&#xB108;&#xC9C8; &#xB9C8;&#xC74C;)</p>
<p></p>
<p>&#xADF8;&#xB9AC;&#xACE0; &#xADF8; &#xD6C4; 1&#xC8FC;&#xC77C; &#xC548;&#xC5D0; &#xAD6D;&#xBE44;&#xAD50;&#xC721;&#xC744; &#xC2E0;&#xCCAD;&#xD558;&#xAC8C; &#xB41C;&#xB2E4;.</p>
<p></p>
<figure class="kg-card kg-image-card kg-card-hascaption"><img src="https://blog.kakaocdn.net/dn/KFL3x/btrXInxb1NV/56q3RTwKcKv1dNvLR3rXYk/img.png" class="kg-image" alt loading="lazy"><figcaption><span>4&#xC6D4; 28&#xC77C;&#xC758; &#xC11C;&#xC6B8;&#xC232;. &#xC598;&#xAE30;&#xD558;&#xBA74;&#xC11C; &#xC11C;&#xC6B8;&#xC232;&#xC744; &#xBA87; &#xBC14;&#xD034;&#xB97C; &#xB3CC;&#xC558;&#xB294;&#xC9C0; &#xBAA8;&#xB974;&#xACA0;&#xB2E4; &#x1F635;</span></figcaption></figure>
<p></p>
<p>&#xB2E4;&#xB978; &#xC0AC;&#xB78C;&#xC774; &#xBCF8;&#xB2E4;&#xBA74; &#xAC11;&#xC790;&#xAE30; &#xC9C4;&#xB85C;&#xB97C; &#xD655; &#xD2C0;&#xC5C8;&#xB2E4;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xACA0;&#xC9C0;&#xB9CC; &#xC0AC;&#xC2E4; &#xB098;&#xB294; &#xB0B4;&#xAC00; &#xAC00;&#xC9C4; &#xC5ED;&#xB7C9;&#xC744; &#xD558;&#xB098; &#xB354; &#xD0A4;&#xC6B4;&#xB2E4;&#xB77C;&#xB294; &#xCE21;&#xBA74;&#xC774; &#xB354; &#xD06C;&#xB2E4;. &#xBB3C;&#xB860; &#xB3C8;&#xC744; &#xBC84;&#xB294; &#xBC29;&#xBC95;&#xC740; &#xBC14;&#xB00C;&#xACA0;&#xC9C0;&#xB9CC;, &#xAE30;&#xC220;&#xC744; &#xD558;&#xB098; &#xB354; &#xAC00;&#xC9D0;&#xC73C;&#xB85C;&#xC368; &apos;&#xB0B4;&#xAC00; &#xD558;&#xACE0; &#xC2F6;&#xC740; &#xAC83;&#xC744; &#xB354; &#xC27D;&#xAC8C; &#xCC3E;&#xC544;&#xAC08; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xC5C8;&#xB2E4;&apos; &#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD558;&#xACE0; &#xC788;&#xB2E4;.</p>
<p>&#xB0B4;&#xAC00; 10&#xB144; &#xD6C4;&#xC5D0;&#xB3C4; 20&#xB144; &#xD6C4;&#xC5D0;&#xB3C4; &#xAC1C;&#xBC1C;&#xC790;&#xB85C; &#xC77C;&#xD560; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xADF8;&#xAC83;&#xB3C4; &#xD589;&#xC6B4;&#xC774;&#xB2E4;. &#xC0B4;&#xC544;&#xB0A8;&#xC744; &#xC218; &#xC788;&#xB294; &#xAC1C;&#xBC1C;&#xC790;&#xB77C;&#xB2C8;!</p>
<p>&#xD558;&#xC9C0;&#xB9CC; &#xB610; &#xC0C8;&#xB85C;&#xC6B4; &#xAE38;&#xC744; &#xCC3E;&#xC544; &#xAC00;&#xB354;&#xB77C;&#xB3C4; &#xADF8;&#xAC83; &#xB098;&#xB984;&#xB300;&#xB85C; &#xC88B;&#xC744; &#xAC83; &#xAC19;&#xB2E4;. &#xB0B4;&#xAC00; &#xC9C0;&#xAE08; &#xBC30;&#xC6B4; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xBAA9;&#xC801;&#xC744; &#xC704;&#xD55C; &#xC218;&#xB2E8;&#xC73C;&#xB85C; &#xC798; &#xC4F8; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xB354;&#xD560;&#xB098;&#xC704; &#xC5C6;&#xC744; &#xAC83;&#xC774;&#xB2E4;.</p>
<hr>
<p>&#xC0AC;&#xC2E4; &#xAD6D;&#xBE44;&#xAD50;&#xC721; &#xC218;&#xAC15;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xBCF4;&#xAC00; &#xAD81;&#xAE08;&#xD560; &#xC0AC;&#xB78C;&#xC774; &#xB9CE;&#xC744; &#xAC83; &#xAC19;&#xC544;&#xC11C;.. &#xBCC4;&#xB85C; &#xC548;&#xAD81;&#xAE08;&#xD560; &#xC598;&#xAE30;&#xB791; &#xBD84;&#xB9AC;&#xD574;&#xBD24;&#xB2E4;.</p>
<p>2&#xD3B8;&#xC740; &#xBF08;&#xBB38;&#xACFC;&#xAC00; &#xAD6D;&#xBE44; &#xAD50;&#xC721; &#xC218;&#xAC15;&#xD558;&#xBA74;&#xC11C; &#xD63C;&#xB780;&#xC758; &#xB3C4;&#xAC00;&#xB2C8;&#xC5D0; &#xBE60;&#xC9C4; &#xC774;&#xC57C;&#xAE30;&#xAC00; &#xC774;&#xC5B4;&#xC9C8; &#xC608;&#xC815;&#xC774;&#xB2E4;.</p>]]></content:encoded></item></channel></rss>